{
  "sn47.8:0.3": "[“A Definitive Guide to Seeing Your Own Mind”](https://www.youtube.com/watch?v=Hd9WZzxqAkE); [“Seeing your own mind”](https://www.youtube.com/watch?v=lMl8C1ViL1c). ",
  "sn47.8:2.1": "“Hint” renders _nimitta_. I’ve chosen this to prevent confusion with the commentarial conception of a “sign” (a mystical mental image) that appears at some point during absorption meditation. The simile shows how in reality this _nimitta_ is something that’s *already there*, but is easily overlooked since it doesn't manifest in a direct, straightforward fashion, hence “hint”. The principle behind it is best illustrated by the [_cittānupassanā_ section of MN 10]((https://suttas.hillsidehermitage.org/?q=mn10#mn10:34.1-mn10:35.4). ",
  "sn47.8:3.4": "[This comment](https://suttas.hillsidehermitage.org/?q=mn10#mn10:3.1-mn10:3.2) to MN 10 explains the reasoning behind this rendering of the standard _satipaṭṭhāna_ formula. ",
  "sn47.8:3.6": "Given the context, “having subdued” (_vineyya_) just above refers to a basic level of withdrawal from the coarse activities involving longing and aversion, not only physically and verbally but mentally as well (in the sense of not crudely revolving around sense pleasures, worldly distractions, etc.). That coarse, blatant layer of hindrances is as much as the unskilled bhikkhu can surmount, as he fails to notice the more general and refined compulsions still underlying his very attempt to abandon the defilements. ",
  "sn47.8:4.1": "Just as the unskilled cook would be serving his master with dishes based on his preconceived, abstract judgment of what he would fancy (“How could anyone not like this curry?”), so too the unskilled bhikkhu would operate with the tacit assumption that his attempt to practice _sati_ (or pursue any facet of the Dhamma) is inherently wholesome, failing to see that the quality of any action originates from the presently arisen [ intention behind it](https://www.hillsidehermitage.org/intentions-behind-ones-actions/). Because of this, he does not realize that what he is “feeding” his mind with those efforts (which are well and good *on paper*) is intentions of a subtler, albeit still defiled nature. He thereby unwittingly—yet by virtue of his own present attitude that he could give up at any time—maintains his mind in an agitated state despite actively striving for the opposite effect. See [“The Mind Whisperer”](https://www.youtube.com/watch?v=of11wtHjudY). ",
  "sn47.8:4.3": "",
  "sn47.8:6.3": "",
  "sn47.8:7.6": "Not by trying to “figure it out”, but by removing [the things that prevent it]((https://suttas.hillsidehermitage.org/?q=an6.68) from becoming apparent. Keeping one's virtue properly already develops some basic recognition of the “hints” of the mind, since it requires being mindful of the motivation behind one's every action and not just adopt external behaviors that align with the letter of the precepts. In exactly the same way, the skilled bhikkhu is always clear and vigilant about the present motivation behind contemplating the body, etc.—seeing whether it's affected with restlessness, anticipation, aversion, impatience, and similar—and his efforts are not just directed at the *content* of that contemplation. ",
  "sn47.8:8.1": "The right “food” for the mind is not found through “experimenting” to see what will give rise to the greatest meditative bliss. It's impossible for that intention not to be accompanied by the very first hindrance of longing (_abhijjhā_), and the abandoning of such obvious tendencies is presupposed even in the unskilled bhikkhu. The right pleasant abiding results from the complete abandonment of craving, and this is achieved through cultivating the intentions that are _known_ to be fully free from passion, aversion, and distraction. ",
  "sn47.8:8.3": ""
}