{
    "mn4:0.1": "Middle Discourses 4 ",
    "mn4:0.2": "Fear and Dread ",
    "mn4:1.1": "So I have heard. ",
    "mn4:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
    "mn4:2.1": "Then the brahmin Jānussoṇi went up to the Buddha, and exchanged greetings with him. ",
    "mn4:2.2": "When the amicable and pleasing talk was over, he sat down to one side and said to the Buddha: ",
    "mn4:2.3": "“Master Gotama, those gentlemen who have gone forth from the lay life to homelessness out of faith in Master Gotama have Master Gotama to lead the way, help them out, and give them encouragement. ",
    "mn4:2.4": "And those people follow Master Gotama’s example.” ",
    "mn4:2.5": "“That’s exactly how it is, Brahmin.” ",
    "mn4:2.8": "“But Master Gotama, remote lodgings in the wilderness and the forest are challenging. Seclusion is hard, and finding joy in solitude is difficult. ",
    "mn4:2.9": "The forests seem to rob the mind of a bhikkhu who cannot achieve composure.” ",
    "mn4:2.10": "“That’s exactly how it is, Brahmin. ",
    "mn4:3.1": "Before my awakening—when I was still unawakened but intent on awakening—I too thought, ",
    "mn4:3.2": "‘Remote lodgings in the wilderness and the forest are challenging. Seclusion is hard, and finding joy in solitude is difficult. ",
    "mn4:3.3": "The forests seem to rob the mind of a bhikkhu who cannot achieve composure.’ ",
    "mn4:4.1": "Then I thought, ",
    "mn4:4.2": "‘There are ascetics and brahmins with unpurified conduct of body, speech, and mind who frequent remote lodgings in the wilderness and the forest. Those ascetics and brahmins give rise to unfavorable fear and dread because of this defect in their conduct. ",
    "mn4:4.3": "But I don’t frequent remote lodgings in the wilderness and the forest with unpurified conduct of body, speech, and mind. ",
    "mn4:4.4": "My conduct is purified. ",
    "mn4:4.5": "I am one of those noble ones who frequent remote lodgings in the wilderness and the forest with purified conduct of body, speech, and mind.’ ",
    "mn4:4.6": "Seeing this purity of conduct in myself I felt even more unconcerned about staying in the forest. ",
    "mn4:5.1": "Then I thought, ",
    "mn4:5.4": "‘There are ascetics and brahmins with unpurified livelihood who frequent remote lodgings in the wilderness and the forest. Those ascetics and brahmins give rise to unfavorable fear and dread because of this defect in their livelihood. ",
    "mn4:6.1": "But I don’t frequent remote lodgings in the wilderness and the forest with unpurified livelihood. ",
    "mn4:6.2": "My livelihood is purified. ",
    "mn4:7.1": "I am one of those noble ones who frequent remote lodgings in the wilderness and the forest with purified livelihood.’ ",
    "mn4:7.2": "Seeing this purity of livelihood in myself I felt even more unconcerned about staying in the forest. ",
    "mn4:8.1": "Then I thought, ",
    "mn4:8.2": "‘There are ascetics and brahmins full of desire for sensuality, with acute passion … ",
    "mn4:8.4": "I am not full of desire …’ ",
    "mn4:9.2": "‘There are ascetics and brahmins with minds of ill-will, with malicious intentions … ",
    "mn4:9.4": "I have a mind of friendliness …’ ",
    "mn4:10.2": "‘There are ascetics and brahmins overcome with dullness and drowsiness … ",
    "mn4:10.4": "I am free of dullness and drowsiness …’ ",
    "mn4:11.2": "‘There are ascetics and brahmins who are restless, with unappeased minds  … ",
    "mn4:11.4": "My mind is appeased …’ ",
    "mn4:12.2": "‘There are ascetics and brahmins who are doubting and uncertain … ",
    "mn4:12.4": "I’ve gone beyond doubt …’ ",
    "mn4:13.2": "‘There are ascetics and brahmins who glorify themselves and put others down … ",
    "mn4:13.4": "I don’t glorify myself and put others down …’ ",
    "mn4:14.2": "‘There are ascetics and brahmins who are cowardly and easy to scare … ",
    "mn4:14.4": "I am free from trepidation …’ ",
    "mn4:15.2": "‘There are ascetics and brahmins who enjoy possessions, honor, and popularity … ",
    "mn4:15.4": "I have few wishes …’ ",
    "mn4:16.2": "‘There are ascetics and brahmins who are lazy and lack effort … ",
    "mn4:16.4": "I am effortful …’ ",
    "mn4:17.2": "‘There are ascetics and brahmins who lack recollection and comprehension … ",
    "mn4:17.4": "My recollection is established …’ ",
    "mn4:18.2": "‘There are ascetics and brahmins who lack composure, with straying minds … ",
    "mn4:18.4": "I am endowed with composure …’ ",
    "mn4:19.2": "‘There are ascetics and brahmins who are witless and stupid who frequent remote lodgings in the wilderness and the forest. Those ascetics and brahmins give rise to unfavorable fear and dread because of the defect of witlessness and stupidity. ",
    "mn4:19.3": "But I don’t frequent remote lodgings in the wilderness and the forest witless and stupid. ",
    "mn4:19.4": "I am endowed with understanding. ",
    "mn4:19.5": "I am one of those noble ones who frequent remote lodgings in the wilderness and the forest endowed with understanding.’ ",
    "mn4:19.6": "Seeing this accomplishment of wisdom in myself I felt even more unconcerned about staying in the forest. ",
    "mn4:20.1": "Then I thought, ",
    "mn4:20.2": "‘There are certain nights that are well-known and designated: ",
    "mn4:20.3": "the fourteenth, fifteenth, and eighth of the fortnight. ",
    "mn4:20.4": "On such nights, why don’t I stay in scary and hair-raising shrines in parks, forests, and trees? In such lodgings, hopefully I might see that fear and dread.’ ",
    "mn4:20.5": "Sometime later, that’s what I did. ",
    "mn4:20.8": "As I was staying there a deer came by, or a peacock snapped a twig, or the wind rustled the leaves. ",
    "mn4:20.9": "Then I thought, ",
    "mn4:20.10": "‘Is this that fear and dread coming?’ ",
    "mn4:20.11": "Then I thought, ",
    "mn4:20.12": "‘Why am I always expecting that fear and terror to come? ",
    "mn4:20.13": "Why don't I dispel that fear and dread in whichever way I am when it comes?’ ",
    "mn4:20.14": "Then that fear and dread came upon me as I was walking. ",
    "mn4:20.15": "I didn’t stand still or sit down or lie down until I had dispelled that fear and dread while walking. ",
    "mn4:20.16": "Then that fear and dread came upon me as I was standing. ",
    "mn4:20.17": "I didn’t walk or sit down or lie down until I had dispelled that fear and dread while standing. ",
    "mn4:20.18": "Then that fear and dread came upon me as I was sitting. ",
    "mn4:20.19": "I didn’t lie down or stand still or walk until I had dispelled that fear and dread while sitting. ",
    "mn4:20.20": "Then that fear and dread came upon me as I was lying down. ",
    "mn4:20.21": "I didn’t sit up or stand still or walk until I had dispelled that fear and dread while lying down. ",
    "mn4:21.1": "There are some ascetics and brahmins who perceive that it’s day when in fact it’s night, or perceive that it’s night when in fact it’s day. ",
    "mn4:21.2": "This way of being of theirs is muddlednessal, I say. ",
    "mn4:21.3": "I perceive that it’s night when in fact it is night, and perceive that it’s day when in fact it is day. ",
    "mn4:21.4": "And if there’s anyone of whom it may be rightly said that ",
    "mn4:21.5": "a being not liable to muddledness has arisen in the world for the welfare and happiness of the people, out of compassion for the world, for the benefit, welfare, and happiness of gods and humans, it’s of me that this should be said. ",
    "mn4:22-26.1": "My effort was roused up and unflagging, my recollection was established and lucid, my body was tranquil and undisturbed, and my mind was collected and composed. ",
    "mn4:22-26.2": "Quite separated from sensuality, separated from unfavorable phenomena, with thinking and with pondering, with joy and ease born of separation, I dwelt having arrived at the first jhāna. ",
    "mn4:22-26.3": "With the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and ease born of composure, I dwelt having arrived at the second jhāna. ",
    "mn4:22-26.4": "With the fading of joy, I dwelt equanimous, recollected and aware, and experiencing ease with the body. I dwelt having arrived at the third jhāna, regarding which the noble ones say “one dwells equanimous, recollected and at ease.” ",
    "mn4:22-26.5": "With the giving up of ease and unease, and beforehand the ending of happiness and sadness, without ease or unease, with purity of equanimity and recollection, I dwelt having arrived at the fourth jhāna. ",
    "mn4:27.1": "When my mind had become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—I extended it toward recollection of past lives. I recollected many kinds of past lives. ",
    "mn4:27.2": "That is: one, two, three, four, five, ten, twenty, thirty, forty, fifty, a hundred, a thousand, a hundred thousand births; many eons of the world contracting, many eons of the world expanding, many eons of the world contracting and expanding. I remembered: ‘There, I was named this, my clan was that, I looked like this, and that was my food. This was how I felt pleasure and displeasure, and that was how my life ended. When I passed away from that place I reappeared somewhere else. There, too, I was named this, my clan was that, I looked like this, and that was my food. This was how I felt pleasure and displeasure, and that was how my life ended. When I passed away from that place I reappearedhere.’ And so I recollected my many kinds of past lives, with features and details. ",
    "mn4:28.1": "This was the first knowledge, which I achieved in the first watch of the night. ",
    "mn4:28.2": "Ignorance was destroyed and knowledge arose; darkness was destroyed and light arose, as happens for one who lives diligent, ardent, and resolute. ",
    "mn4:29.1": "When my mind had become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—I extended it toward knowledge of the passing away and reappearance of beings. ",
    "mn4:29.2": "With clairvoyance that is purified and superhuman, I saw beings passing away and reappearing—inferior and superior, beautiful and ugly, in a good place or a bad place. I understood how beings reappear according to their actions: ‘These beings engaged in misconduct by way of body, speech, and mind. They found fault with the noble ones; they had wrong view; and they chose to act out of that wrong view. When their body breaks up, after death, they reappear in a place of loss, a bad place, the underworld, hell. These other beings, however, engaged in good conduct by way of body, speech, and mind. They did not find fault with the noble ones; they had right view; and they chose to act out of that right view. When their body breaks up, after death, they reappear in a good place, a heavenly realm.’ And so, with clairvoyance that is purified and superhuman, I saw beings passing away and reappearing—inferior and superior, beautiful and ugly, in a good place or a bad place. I understood how beings reappear according to their actions. ",
    "mn4:30.1": "This was the second knowledge, which I achieved in the middle watch of the night. ",
    "mn4:30.2": "Ignorance was destroyed and knowledge arose; darkness was destroyed and light arose, as happens for one who lives diligent, ardent, and resolute. ",
    "mn4:31.1": "When my mind had become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—I extended it toward knowledge of the exhaustion of influxes. ",
    "mn4:31.2": "I understood as it is: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering’. ",
    "mn4:31.3": "I understood as it is: ‘These are influxes’ … ‘This is the origin of influxes’ … ‘This is the cessation of influxes’ … ‘This is the practice that leads to the cessation of influxes’. ",
    "mn4:32.1": "Knowing and seeing like this, my mind was freed from the defilements of sensuality, being, and ignorance. ",
    "mn4:32.2": "When it was freed, I knew it was freed. ",
    "mn4:32.3": "I understood: ‘Birth is exhausted, the spiritual journey has been completed, what had to be done has been done, there will be no more of this.’” ",
    "mn4:33.1": "This was the third knowledge, which I achieved in the final watch of the night. ",
    "mn4:33.2": "Ignorance was destroyed and knowledge arose; darkness was destroyed and light arose, as happens for a meditator who is diligent, ardent, and resolute. ",
    "mn4:34.1": "Brahmin, you might think: ",
    "mn4:34.2": "‘Perhaps the Master Gotama is not free of passion, aversion, and muddledness even today, and that is why he still frequents remote lodgings in the wilderness and the forest.’ ",
    "mn4:34.3": "But you should not see it like this. ",
    "mn4:34.4": "I see two reasons to frequent remote lodgings in the wilderness and the forest. ",
    "mn4:34.5": "I see an easeful dwelling in the present for myself, and I have compassion for future generations.” ",
    "mn4:35.1": "“Indeed, Master Gotama has compassion for future generations, since he is an Arahant, a fully awakened Buddha. ",
    "mn4:35.2": "Excellent, Master Gotama! Excellent, Master Gotama! ",
    "mn4:35.3": "As if he were righting the overturned, or revealing the hidden, or pointing out the path to the lost, or lighting a lamp in the dark so people with clear eyes can see what’s there, Master Gotama has made the Dhamma clear in many ways. ",
    "mn4:35.4": "I go for refuge to Master Gotama, to the Dhamma, and to the bhikkhu Saṅgha. ",
    "mn4:35.5": "From this day forth, may Master Gotama remember me as a lay follower who has gone for refuge for life.” "
}