{
    "glossary": {
      "sati": "literally “memory” or “recollection”, from _√sar_ (“remember”. Mindfulness”, owing to the prevalence of mainstream misinterpretations, tends to imply “focused awareness”, an implication that is actually foreign to the term _sati_. [MN 53](https://suttas.hillsidehermitage.org/?q=mn53) defines a noble disciple endowed with supreme _sati_ as “one who remembers what was said and done long ago”, and even in everyday life, it’s evident that remembering is *not* a matter of unbroken attention; otherwise, we would forget everything we don't focus on continuously, and we wouldn’t be able to keep an overarching goal in mind while switching between various subtasks. <br><br>It is this same quality of remembering, just applied to aspects of one’s present experience that are relevant to freedom from suffering, that underlies each of the four _satipaṭṭhānas_. <br><br>Not incidentally, the Right View is necessary for the Right Recollection: it’s impossible to recollect something that isn’t already known. [“Focusing”, “observing”, and “bare attention”,](https://suttas.hillsidehermitage.org/?q=an11.9#an11.9:2.3-an11.9:2.17) on the other hand, involve overlooking the general aspects of one’s present situation—where ignorance, defilements, hindrances, and wrong views lie—in favor of particularities, and thus the domain where *both* calm and insight are to be developed is obscured.",
      "saṅkhāra": "lit. “(a) doing”. The traditional “(volitional) formations”, “fabrications”, etc., are mystical/abstruse, while “intentions” is an oversimplification, and corresponds actually to _cetanā_, a specific type of _saṅkhāra_. <br><br>Regarding _saṅkhārā_ as fundamentally volitional is misleading, since the reason for their presence is not mere will, but ignorance (“With ignorance as basis, activities [exist]...”). Conversely, their cessation isn't reached by intentionally refraining from choice, but by fully dispelling ignorance (“With the remainderless fading away and cessation of ignorance, activities cease...”).",
      "sīlabbataparāmāsa": "“Clinging to rites and rituals” is certainly an instance of this, but a very coarse one that doesn't require stream-entry to be given up. _parāmāsa_ means “grasping” or “holding” in general, not “misapprehension”, and so the term refers to all forms of internally latching on to even the good, beneficial virtue and precepts. <br><br> As described in numerous Suttas (e.g., [MN 48](https://suttas.hillsidehermitage.org/?q=mn48#mn48:6.12), [AN 6.10](https://suttas.hillsidehermitage.org/?q=an6.10#an6.10:5.1-an6.10:5.7)), a noble disciple’s virtue is spotless and unbroken *and* not clung to at the same time. Thus, *sīlabbataparāmāsa*—like all *upādāna*—is ultimately superfluous and unnecessary, even for the perfect, unbroken maintenance of virtuous behavior. It's a wrong attitude/emphasis with which the behavior is upheld, and not the upholding itself. Anything that is taken on with a sense of duty as “needing to be done” is affected with *sīlabbataparāmāsa* for a *puthujjana*, including his best attempts at practicing the Dhamma."
    }
  }
  
