{
    "glossary": {
      "yoniso manasikāra": "This most central quality [without which no ultimate progress in the Dhamma can be made](https://suttas.hillsidehermitage.org/?q=mn2#mn2:3.1_mn2:3.5) is notably absent from the limelight in mainstream Buddhist discourse, aptly but concisely reflecting the latter's sheer disconnect from what the Buddha originally taught. One of the reasons its importance is so overlooked is that it has been traditionally translated in quite ambiguous and loose ways, such as “wise attention,” “appropriate attention,” “rational application of mind,” etc., whereas I have chosen to render it much more literally as “attention in light of the origin.”<br><br>The main issue with the traditional renderings is that they fail to make explicit what the grammar of the Pāli phrase itself implies: that it’s not about the *object* of your attention, but about that attention being “in terms of” or “according to” the *yoni*. *Yoni* literally means “womb,” and thus it also has a metaphorical sense of the origin or source of something, the basis or reason for that thing’s existence.<br><br>Thus, when practicing *yoniso manasikāra*, which is one of the [two essential conditions for the arising of Right View](https://suttas.hillsidehermitage.org/?q=mn43#mn43:13.3), one does not try to attend to something specific, but rather recognizes an element of one’s experience that is the “womb” of whatever one’s attention is directed at, while attention remains where it was. There are four key “wombs” in everyone’s experience for as long as they’re alive, and these are [the body, the present overall feeling (either pleasant, unpleasant, or neither), the present state of mind, and *dhammas* (general phenomena)](https://suttas.hillsidehermitage.org/?q=mn10).<br><br>Maintaining perspective of any one of these “wombs,” while one‘s attention inevitably continues to move, slowly but surely drains away any assumption of ownership or fundamental control associated with the faculty of attention/intention, as it is now seen as *second*, not *first*. This is how the conceit “I am” is brought to an end, since the reason for it was never that there was a sense of control, but that it was tacitly assumed to be *absolute*—a false assumption that inevitably results in suffering when unwanted events take place—owing to the apparent absence of anything more fundamental than it. This is what ignorance is in a nutshell, and all conceits and “mine-makings” are by-products of it, rather than of deliberate acts of identification that can simply be stopped.<br><br>It is crucial not to try to *attend* to the *yoni*, as this will simply be an instance of *manasikāra* that is not seen in light of the *yoni* that is factually there. For example, when trying to coarsely *think* about your body, trying to connect the dots between various ideas you may have acquired about it, you would most likely be overlooking [the “actual” body that is present “underneath”](https://www.youtube.com/watch?v=hB9dQFtXMKs) that entire activity of contemplation, sitting in this room, in this particular posture. Since it’s divorced from where they actually take place, that effort will have no real effect on your underlying passion and wrong views about your body. On the other hand, if having [peripherally discerned](https://www.hillsidehermitage.org/peripheral-awareness/) that actual, concrete body as the *yoni* of your present experience, you go on to reflect on its liability to illness, aging, and death, or on the loathsomeness of the things that it’s made of, then that will certainly lead to the abandonment of any passion for the body if cultivated properly and long enough.<br><br>However, it’s crucial to note that the tendency of trying to attend to the *yoni* is not something you can put a stop to by choice. In order for *yoniso manasikāra* to be possible (as opposed to *yoni-manasikāra,* or “attention *to* the origin,” which is the mistake), you need to have been living with your *manasikāra* continuously disengaged from certain objects and experiences, since they captivate the mind to such an extent that the discernment of the “womb” becomes impossible. These are anything involving lust, aversion, or careless distraction such as entertainment and idle chatter, and this is why restraint of conduct and of the senses are necessary prerequisites for developing the four *satipaṭṭhānas* (SN 46.6).<br><br>This restraint, though often initially uncomfortable since it contradicts ingrained habits and cravings, naturally results in a lessening of previously unnoticed compulsive mental tendencies if kept unbroken long enough. This takes off a great deal of the “weight” or “emphasis” that *manasikāra* initially carries, thus freeing space for the *yoni* to be discerned where it actually is in the present experience, rather than being *attended to* and thus misconceived.",
      "sati": "Literally “memory” or “recollection”, from _√sar_ (“remember”). “Mindfulness”, owing to the prevalence of mainstream misinterpretations, tends to imply “focused awareness”, an implication that is actually foreign to the term _sati_. [MN 53](https://suttas.hillsidehermitage.org/?q=mn53) defines a noble disciple endowed with supreme _sati_ as “one who remembers what was said and done long ago”, and even in everyday life, it’s evident that remembering is *not* a matter of unbroken attention; otherwise, we would forget everything we don't focus on continuously, and we wouldn’t be able to keep an overarching goal in mind while switching between various subtasks. <br><br>It is this same quality of remembering, just applied to aspects of one’s present experience that are relevant to freedom from suffering, that underlies each of the four _satipaṭṭhānas_. <br><br>Not incidentally, the Right View is necessary for the Right Recollection: it’s impossible to recollect something that isn’t already known. [“Focusing”, “observing”, and “bare attention”,](https://suttas.hillsidehermitage.org/?q=an11.9#an11.9:2.3-an11.9:2.17) on the other hand, involve overlooking the general aspects of one’s present situation—where ignorance, defilements, hindrances, and wrong views lie—in favor of particularities, and thus the domain where *both* calm and insight are to be developed is obscured.",
      "saṅkhāra": "lit. “(a) doing”. The conventional “(volitional) formations”, “fabrications”, etc., are mystical/abstruse, while “intentions” is an oversimplification, and corresponds actually to _cetanā_, a specific type of _saṅkhāra_. <br><br>Regarding _saṅkhārā_ as fundamentally volitional is misleading, since the reason for their presence is not mere will, but ignorance (“With ignorance as basis, activities [exist]...”). Conversely, their cessation isn't reached by intentionally refraining from choice, but by fully dispelling ignorance (“With the remainderless fading away and cessation of ignorance, activities cease...”).",
      "sīlabbataparāmāsa": "“Clinging to rites and rituals” is certainly an instance of this, but a very coarse one that doesn't require stream-entry to be given up. _parāmāsa_ means “grasping” or “holding” in general, not “misapprehension”, and so the term refers to all forms of internally latching on to even the good, beneficial virtue and precepts. <br><br> As described in numerous Suttas (e.g., [MN 48](https://suttas.hillsidehermitage.org/?q=mn48#mn48:6.12), [AN 6.10](https://suttas.hillsidehermitage.org/?q=an6.10#an6.10:5.1-an6.10:5.7)), a noble disciple’s virtue is spotless and unbroken *and* not clung to at the same time. Thus, *sīlabbataparāmāsa*—like all *upādāna*—is ultimately superfluous and unnecessary, even for the perfect, unbroken maintenance of virtuous behavior. It's a wrong attitude/emphasis with which the behavior is upheld, and not the upholding itself. Anything that is taken on with a sense of duty as “needing to be done” is affected with *sīlabbataparāmāsa* for a *puthujjana*, including his best attempts at practicing the Dhamma."
    }
  }
  
