{
  "an2.11:0.1": "Numbered Discourses 2.11–20 ",
  "an2.11:0.2": "The Chapter on Disciplinary Issues ",
  "an2.11:1.0": "11 ",
  "an2.11:1.1": "“There are, bhikkhus, these two powers. ",
  "an2.11:1.2": "What two? ",
  "an2.11:1.3": "The power of reflection and the power of development. ",
  "an2.11:1.4": "And what, bhikkhus, is the power of reflection? ",
  "an2.11:1.5": "It’s when someone reflects: ",
  "an2.11:1.6": "‘Misconduct of body, speech, or thought has a bad result both right in the present experience and in the future.’ ",
  "an2.11:1.7": "Reflecting like this, they give up misconduct by way of body, speech, and thought, and develop good conduct by way of body, speech, and thought, keeping themselves pure. ",
  "an2.11:1.8": "This is called the power of reflection. ",
  "an2.11:2.1": "And what, bhikkhus, is the power of development? ",
  "an2.11:2.2": "In this context, the power of development is the power of the trainees. ",
  "an2.11:2.3": "For relying on the power of a trainee, one gives up passion, aversion, and muddledness. ",
  "an2.11:2.4": "Having given up passion, aversion, and muddledness, one does not do anything unbeneficial; one does not engage in anything harmful. ",
  "an2.11:2.5": "This is called the power of development. ",
  "an2.11:2.6": "These are the two powers.” ",
  "an2.12:1.0": "12 ",
  "an2.12:1.1": "“There are, bhikkhus, these two powers. ",
  "an2.12:1.2": "What two? ",
  "an2.12:1.3": "The power of reflection and the power of development. ",
  "an2.12:1.4": "And what, bhikkhus, is the power of reflection? ",
  "an2.12:1.5": "It’s when someone reflects: ",
  "an2.12:1.6": "‘Misconduct of body, speech, or mind has a bad result both right in the present experience and in the future.’ ",
  "an2.12:1.7": "Reflecting like this, they give up misconduct by way of body, speech, and thought, and develop good conduct by way of body, speech, and thought, keeping themselves pure. ",
  "an2.12:1.8": "This is called the power of reflection. ",
  "an2.12:2.1": "And what, bhikkhus, is the power of development? ",
  "an2.12:2.2": "It’s when a bhikkhu develops the awakening factors of recollection, ",
  "an2.12:2.3": "discernment of phenomena, ",
  "an2.12:2.4": "effort, ",
  "an2.12:2.5": "joy, ",
  "an2.12:2.6": "calm, ",
  "an2.12:2.7": "composure, ",
  "an2.12:2.8": "and equanimity, which rely on withdrawal, dispassion, and cessation, and ripen in relinquishment. ",
  "an2.12:2.9": "This is called the power of development. ",
  "an2.12:2.10": "These are the two powers.” ",
  "an2.13:1.0": "13 ",
  "an2.13:1.1": "“There are, bhikkhus, these two powers. ",
  "an2.13:1.2": "What two? ",
  "an2.13:1.3": "The power of reflection and the power of development. ",
  "an2.13:1.4": "And what, bhikkhus, is the power of reflection? ",
  "an2.13:1.5": "It’s when someone reflects: ",
  "an2.13:1.6": "‘Misconduct of body, speech, or mind has a bad result both right in the present experience and in the future.’ ",
  "an2.13:1.7": "Reflecting like this, they give up misconduct by way of body, speech, and thought, and develop good conduct by way of body, speech, and thought, keeping themselves pure. ",
  "an2.13:1.8": "This is called the power of reflection. ",
  "an2.13:2.1": "And what, bhikkhus, is the power of development? ",
  "an2.13:2.2": "It’s when a bhikkhu, having thoroughly withdrawn from sensuality, having withdrawn from unbeneficial phenomena, with thinking and with pondering, with joy and ease born of withdrawal, abides having entered upon the first jhāna. ",
  "an2.13:2.3": "With the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and ease born of composure, a bhikkhu abides having entered upon the second jhāna. ",
  "an2.13:2.4": "With the fading of joy, a bhikkhu abides equanimous, recollected, and aware, experiencing ease with the body. He abides having entered upon the third jhāna, with regard to which the noble ones say “one abides equanimous, recollected, and at ease.” ",
  "an2.13:2.5": "With the giving up of ease and unease—and with the ending of joys and upsets beforehand—without ease or unease, with purity of equanimity and recollection, a bhikkhu abides having entered upon the fourth jhāna. ",
  "an2.13:2.6": "This is called the power of development. ",
  "an2.13:2.7": "These are the two powers.” ",
  "an2.14:1.0": "14 ",
  "an2.14:1.1": "“There are, bhikkhus, these two ways of teaching the Dhamma. ",
  "an2.14:1.2": "What two? ",
  "an2.14:1.3": "In brief and in detail. ",
  "an2.14:1.4": "These are two ways of teaching the Dhamma.” ",
  "an2.15:1.0": "15 ",
  "an2.15:1.1": "“Bhikkhus, in a disciplinary issue, if neither the offending bhikkhu nor the accusing bhikkhu carefully looks back at himself, you can expect that issue ",
  "an2.15:1.2": "will lead to lasting acrimony and enmity, and the bhikkhus won’t live comfortably. ",
  "an2.15:1.3": "But in a disciplinary issue, if both the offending bhikkhu and the accusing bhikkhu carefully look back at themselves, you can expect that issue ",
  "an2.15:1.4": "won’t lead to lasting acrimony and enmity, and the bhikkhus will live comfortably. ",
  "an2.15:2.1": "And how, bhikkhus, does an offending bhikkhu carefully look back at himself? ",
  "an2.15:2.2": "An offending bhikkhu reflects: ",
  "an2.15:2.3": "‘I have committed a certain unbeneficial [act] with the body. ",
  "an2.15:2.4": "That bhikkhu saw me do this. ",
  "an2.15:2.5": "If I hadn’t committed that unbeneficial [act], he wouldn’t have seen me. ",
  "an2.15:2.6": "But since I commit that unbeneficial [act], he did see me. ",
  "an2.15:2.7": "When he saw me, he was upset, ",
  "an2.15:2.8": "and he voiced his upset to me. ",
  "an2.15:2.9": "Then I also was upset, ",
  "an2.15:2.10": "so I told others. ",
  "an2.15:2.11": "So the mistake is mine alone, like someone who owes customs duty on their goods.’ ",
  "an2.15:2.12": "That’s how, bhikkhus, an offending bhikkhu carefully looks back at himself. ",
  "an2.15:3.1": "And how, bhikkhus, does an accusing bhikkhu carefully look back at himself? ",
  "an2.15:3.2": "An accusing bhikkhu reflects: ",
  "an2.15:3.3": "‘This bhikkhu has committed a certain unbeneficial [act] with the body. ",
  "an2.15:3.4": "I saw him do that. ",
  "an2.15:3.5": "If he hadn’t committed that unbeneficial [act], I wouldn’t have seen him. ",
  "an2.15:3.6": "But since he did commit that unbeneficial [act], I did see him. ",
  "an2.15:3.7": "When I saw him, I was upset, ",
  "an2.15:3.8": "and I voiced my upset to him. ",
  "an2.15:3.9": "Then he was also upset, ",
  "an2.15:3.10": "so he told others. ",
  "an2.15:3.11": "So the mistake is mine alone, like someone who owes customs duty on their goods.’ ",
  "an2.15:3.12": "That’s how, bhikkhus, an accusing bhikkhu carefully looks back at himself. ",
  "an2.15:4.1": "In a disciplinary issue, if neither the offending bhikkhu nor the accusing bhikkhu carefully looks back at himself, you can expect that issue will lead to lasting acrimony and enmity, and the bhikkhus won’t live comfortably. ",
  "an2.15:4.2": "But in a disciplinary issue, if both the offending bhikkhu and the accusing bhikkhu carefully look back at themselves, you can expect that issue won’t lead to lasting acrimony and enmity, and the bhikkhus will live comfortably.” ",
  "an2.16:1.0": "16 ",
  "an2.16:1.1": "Then a certain brahmin went up to the Buddha and exchanged pleasantries with him. ",
  "an2.16:1.2": "When the amicable and cordial talk was over, he sat down to one side and said to the Buddha: ",
  "an2.16:1.3": "“What is the cause, Master Gotama, what is the reason why some beings, when their body breaks up, after death, reappear in a place of loss, a bad place, the underworld, hell?” ",
  "an2.16:1.4": "“Unsuitable conduct, conduct not in line with the Dhamma, is the reason why some beings, when their body breaks up, after death, reappear in a place of loss, a bad place, the underworld, hell.” ",
  "an2.16:2.1": "“What is the cause, Master Gotama, what is the reason why some beings, when their body breaks up, after death, reappear in a good place, a heavenly realm?” ",
  "an2.16:2.2": "“Suitable conduct, conduct in line with the Dhamma, is the reason why some beings, when their body breaks up, after death, reappear in a good place, a heavenly realm.” ",
  "an2.16:3.1": "“Excellent, Master Gotama! Excellent! ",
  "an2.16:3.2": "As if he was righting the overturned, or revealing the hidden, or pointing out the path to the lost, or lighting a lamp in the dark so people with clear eyes can see what’s there, Master Gotama has made the teaching clear in many ways. ",
  "an2.16:3.3": "I go for refuge to Master Gotama, to the teaching, and to the bhikkhu Saṅgha. ",
  "an2.16:3.4": "From this day forth, may Master Gotama remember me as a lay follower who has gone for refuge for life.” ",
  "an2.17:1.0": "17 ",
  "an2.17:1.1": "Then the brahmin Jānussoṇi went up to the Buddha, and exchanged pleasantries with him. ",
  "an2.17:1.2": "When the amicable and cordial talk was over, he sat down to one side and said to the Buddha: ",
  "an2.17:1.3": "“What is the cause, Master Gotama, what is the reason why some beings, when their body breaks up, after death, reappear in a place of loss, a bad place, the underworld, hell?” ",
  "an2.17:1.4": "“What they’ve done and what they’ve not done. ",
  "an2.17:1.5": "That’s why some beings, when their body breaks up, after death, reappear in a place of loss, a bad place, the underworld, hell.” ",
  "an2.17:1.6": "“But what is the cause, Master Gotama, what is the reason why some beings, when their body breaks up, after death, reappear in a good place, a heavenly realm?” ",
  "an2.17:1.7": "“What they’ve done and what they’ve not done. ",
  "an2.17:1.8": "That’s why some beings, when their body breaks up, after death, reappear in a good place, a heavenly realm.” ",
  "an2.17:1.9": "“I don’t understand the meaning of what Master Gotama has said in brief, without explaining the details. ",
  "an2.17:1.10": "Master Gotama, please teach me this matter in detail so I can understand the meaning.” ",
  "an2.17:1.11": "“Well then, brahmin, listen and apply your mind well, I will speak.” ",
  "an2.17:1.12": "“Yes, sir,” Jānussoṇi replied. ",
  "an2.17:1.13": "The Buddha said this: ",
  "an2.17:2.1": "“Firstly, brahmin, someone has engaged in misconduct and not good conduct by way of body, ",
  "an2.17:2.2": "speech, ",
  "an2.17:2.3": "and thought. ",
  "an2.17:2.4": "In this way, what they’ve done and what they’ve not done is the reason why some beings, when their body breaks up, after death, reappear in a place of loss, a bad place, the underworld, hell. ",
  "an2.17:2.5": "Furthermore, brahmin, someone has engaged in good conduct and not misconduct by body, ",
  "an2.17:2.6": "speech, ",
  "an2.17:2.7": "and thought. ",
  "an2.17:2.8": "So what they’ve done and what they’ve not done is why some beings, when their body breaks up, after death, reappear in a good place, a heavenly realm.” ",
  "an2.17:3.1": "“Excellent, Master Gotama! … From this day forth, may Master Gotama remember me as a lay follower who has gone for refuge for life.” ",
  "an2.18:1.0": "18 ",
  "an2.18:1.1": "Then Venerable Ānanda went up to the Buddha, bowed, and sat down to one side. The Buddha said to him, ",
  "an2.18:1.2": "“Ānanda, I categorically say that misconduct by body, speech, and thought should not be engaged in.” ",
  "an2.18:1.3": "“But, Bhante, if someone does these things that should categorically not be done, what perils should they expect?” ",
  "an2.18:1.4": "“They should expect these perils: ",
  "an2.18:1.5": "They blame themselves. ",
  "an2.18:1.6": "After examination, sensible people criticize them. ",
  "an2.18:1.7": "They get a bad reputation. ",
  "an2.18:1.8": "They die muddled. ",
  "an2.18:1.9": "And when their body breaks up, after death, they reappear in a place of loss, a bad place, the underworld, hell. ",
  "an2.18:1.10": "These are the perils they should expect.” ",
  "an2.18:2.1": "“Ānanda, I categorically say that good conduct by way of body, speech, and thought should be engaged in.” ",
  "an2.18:2.2": "“But, Bhante, if someone does these things that should be done, what boons should they expect?” ",
  "an2.18:2.3": "“They should expect these boons. ",
  "an2.18:2.4": "They don’t blame themselves. ",
  "an2.18:2.5": "After examination, sensible people praise them. ",
  "an2.18:2.6": "They get a good reputation. ",
  "an2.18:2.7": "They don’t die muddled. ",
  "an2.18:2.8": "And when the body breaks up, after death, they reappear in a good place, a heavenly realm. ",
  "an2.18:2.9": "These are the boons they should expect.” ",
  "an2.19:1.0": "19 ",
  "an2.19:1.1": "“Bhikkhus, give up what is unbeneficial. ",
  "an2.19:1.2": "It is possible to give up what is unbeneficial. ",
  "an2.19:1.3": "If it wasn’t possible, I wouldn’t say: ",
  "an2.19:1.4": "‘Give up what is unbeneficial.’ ",
  "an2.19:1.5": "But it is possible, and so I say: ",
  "an2.19:1.6": "‘Give up what is unbeneficial.’ ",
  "an2.19:1.7": "And if giving up what’s unbeneficial led to harm and suffering, I would not say: ",
  "an2.19:1.8": "‘Give up what is unbeneficial.’ ",
  "an2.19:1.9": "But giving up what is unbeneficial leads to welfare and happiness, so I say: ",
  "an2.19:1.10": "‘Give up what is unbeneficial.’ ",
  "an2.19:2.1": "Bhikkhus, develop what is beneficial. ",
  "an2.19:2.2": "It is possible to develop what is beneficial. ",
  "an2.19:2.3": "If it wasn’t possible, I wouldn’t say: ",
  "an2.19:2.4": "‘Develop what is beneficial.’ ",
  "an2.19:2.5": "But it is possible, and so I say: ",
  "an2.19:2.6": "‘Develop what is beneficial.’ ",
  "an2.19:2.7": "If developing what is beneficial led to harm and suffering I wouldn’t say: ",
  "an2.19:2.8": "‘Develop what is beneficial.’ ",
  "an2.19:2.9": "But developing what is beneficial leads to welfare and happiness, so I say: ",
  "an2.19:2.10": "‘Develop what is beneficial.’” ",
  "an2.20:1.0": "20 ",
  "an2.20:1.1": "“These two things, bhikkhus, lead to the forgetting and disappearance of the true teaching. ",
  "an2.20:1.2": "What two? ",
  "an2.20:1.3": "The words and phrases are poorly stored, and the meaning is misinterpreted. ",
  "an2.20:1.4": "When the words and phrases are poorly stored, the meaning is hard to infer. ",
  "an2.20:1.5": "These two things lead to the forgetting and disappearance of the true teaching. ",
  "an2.20:2.1": "These two things lead to the continuation, non-forgetting, and non-disappearance of the true teaching. ",
  "an2.20:2.2": "What two? ",
  "an2.20:2.3": "The words and phrases are well stored, and the meaning is correctly interpreted. ",
  "an2.20:2.4": "When the words and phrases are well stored, the meaning is easily inferred. ",
  "an2.20:2.5": "These two things lead to the continuation, non-forgetting, and non-disappearance of the true teaching.” "
}