{
    "sn22.81:5.4": "See the comments in [AN 1.51-52](https://suttas.hillsidehermitage.org/?q=an1.51#an1.51:1.0-an1.52:1.4)",
    "sn22.81:5.8": "On the topic of dependent origination, see [MN 38](http://suttas.hillsidehermitage.org/?q=mn38). It's self-evident that a temporal process or sequence of arising is not what's being discussed here, in which case it wouldn't be possible to understand all these phenomena as dependently originated *after* they have arisen. AN 10.62: “No first point of craving for being can be discerned, before which it was not, and afterwards it came to be.” "
    "sn22.81:5.12": "And for one who *doesn’t* know and see in this way, the influxes remain intact, no matter in what elaborate ways they manipulate the arisen form (feeling, perception, intention, or consciousness). The influxes are there precisely because of _not knowing_—concretely, of course, not just in theory—that there is nothing in the experience, not even craving, that can exist apart from the five aggregates. Whether that not-knowing manifests in the form of submitting to the pull of the craving, or trying to eliminate it altogether or [“manage”](https://www.youtube.com/watch?v=zndwMKAszWM) it is secondary; both fail to address the problem at its root, and the underlying assumption that the aggregates fundamentally _can_ be interfered with continues.",
    "sn22.81:10.8": "AN 10.93",
    "sn22.81:12.10": "In order to understand the nature of doubt (and any other hindrance) in this way and thereby cut it off at its root, one _must_ be ready to indefinitely [withstand the emotional pressure](https://www.youtube.com/watch?v=_XKSVuKe8_c) it will exert. If one cannot do that, it betrays the fact that one still tacitly regards the discomfort of the doubt, be it as acute as it may, as being somehow more than a [feeling](https://www.youtube.com/watch?v=RIx1EmVYbbc). This is why virtue, the practice of not acting out of unwholesome pressures, is the mandatory foundation for right understanding, even though it does not in itself give rise to such knowledge. See also [this passage](https://suttas.hillsidehermitage.org/?q=mn48#mn48:8.12-mn48:8.13) and its notes."
}
