{
  "an9.41:0.1": "Numbered Discourses 9.41 ",
  "an9.41:0.2": "4. The Great Chapter ",
  "an9.41:0.3": "With the Householder Tapussa ",
  "an9.41:1.1": "At one time the Buddha was staying in the land of the Mallas, near the Mallian town named Uruvelakappa. ",
  "an9.41:1.2": "Then the Buddha robed up in the morning and, taking his bowl and robe, entered Uruvelakappa for alms. ",
  "an9.41:1.3": "Then, after the meal, on his return from almsround, he addressed Venerable Ānanda, ",
  "an9.41:1.4": "“Ānanda, you stay right here, while I plunge deep into the Great Wood for the day’s abiding.” ",
  "an9.41:1.5": "“Yes, Bhante,” Ānanda replied. ",
  "an9.41:1.6": "Then the Buddha plunged deep into the Great Wood and sat at the root of a tree for the day’s abiding. ",
  "an9.41:2.1": "The householder Tapussa went up to Venerable Ānanda, bowed, sat down to one side, and said to him: ",
  "an9.41:3.1": "“Bhante Ānanda, we are laypeople who partake in sensuality. We enjoy sensuality, we are fond of it and are pleased by it. ",
  "an9.41:3.2": "To us laypeople who partake in sensuality, who enjoy it, are fond of it, and are pleased by it, renunciation seems like an abyss. ",
  "an9.41:3.3": "I have heard that in this teaching and training there are very young bhikkhus whose minds leap at renunciation; their minds, seeing it as peaceful, are confident, settled, and liberated in it. ",
  "an9.41:3.4": "It is precisely renunciation that is the dividing line between the multitude and the bhikkhus in this teaching and training.” ",
  "an9.41:4.1": "“Householder, we should see the Buddha about this matter. ",
  "an9.41:4.2": "Come, let’s go to the Buddha and inform him about this. ",
  "an9.41:4.3": "As he answers, so we’ll remember it.” ",
  "an9.41:5.1": "“Yes, Bhante,” replied Tapussa. ",
  "an9.41:5.2": "Then Venerable Ānanda together with Tapussa went to the Buddha, bowed, and sat down to one side. Venerable Ānanda told him what had happened. ",
  "an9.41:6.1": "",
  "an9.41:6.2": "",
  "an9.41:6.3": "",
  "an9.41:6.4": "",
  "an9.41:7.1": "“That’s exactly how it is, Ānanda. ",
  "an9.41:7.2": "Before my awakening—when I was still unawakened but intent on awakening—I too thought, ",
  "an9.41:7.3": "‘Renunciation is good! Seclusion is good!’ ",
  "an9.41:7.4": "But my mind didn’t see renunciation as peaceful, and so it didn’t leap at it, and wasn’t confident, settled, and liberated in it. ",
  "an9.41:7.5": "Then I thought, ",
  "an9.41:7.6": "‘What is the cause, what is the reason why my mind doesn’t see renunciation as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it?’ ",
  "an9.41:7.7": "Then I thought, ",
  "an9.41:7.8": "‘I haven’t seen the woe in sensuality, and I haven’t cultivated that. I haven’t realized the value of renunciation, and I haven’t fostered that. ",
  "an9.41:7.9": "That is why my mind doesn’t see renunciation as peaceful, and so doesn’t leap at it, and isn’t confident, settled, and liberated in it.’ ",
  "an9.41:7.10": "Then I thought, ",
  "an9.41:7.11": "‘Suppose that, having seen the woe in sensuality, I were to cultivate that. And suppose that, having realized the value of renunciation, I were to foster that. ",
  "an9.41:7.12": "It’s possible that, seeing it as peaceful, my mind would leap at renunciation, and be confident, settled, and liberated in it.’ ",
  "an9.41:7.13": "And so, after some time, having seen the woe in sensuality, I cultivated that, and having realized the value of renunciation, I fostered that. ",
  "an9.41:7.14": "Then, seeing it as peaceful, my mind leapt at renunciation, and was confident, settled, and liberated in it. ",
  "an9.41:7.15": "And so, quite separated from sensuality, separated from detrimental phenomena, with thinking and with pondering, with joy and ease born of separation, I abided having entered upon the first jhāna. ",
  "an9.41:7.16": "As I abided in that way, perceptions and attentions connected with sensuality beset me, and that was an affliction for me. ",
  "an9.41:7.17": "Suppose unease would arise for someone who is at ease; that would be an affliction for them. ",
  "an9.41:7.18": "In the same way, perceptions and attentions connected with sensuality beset me, and that was an affliction for me. ",
  "an9.41:8.1": "Then I thought, ",
  "an9.41:8.2": "‘Why don’t I, with the appeasement of thinking and pondering ... abide having entered upon the second jhāna?’ ",
  "an9.41:8.3": "But my mind didn’t see the absence-of-thinking as peaceful, and so it didn’t leap at it, and wasn’t confident, settled, and liberated in it. ",
  "an9.41:8.4": "Then I thought, ",
  "an9.41:8.5": "‘What is the cause, what is the reason why my mind doesn’t see the absence-of-thinking as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it?’ ",
  "an9.41:8.6": "Then I thought, ",
  "an9.41:8.7": "‘I haven’t seen the woe in thinking, and I haven’t cultivated that. I haven’t realized the value of the absence-of-thinking, and I haven’t fostered  that. ",
  "an9.41:8.8": "That is why my mind doesn’t see the absence-of-thinking as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it.’ ",
  "an9.41:8.9": "Then I thought, ",
  "an9.41:8.10": "‘Suppose that, having seen the woe in thinking, I were to cultivate that. And suppose that, having realized the value of the absence-of-thinking, I were to foster that. It’s possible that, seeing it as peaceful my mind would leap at the absence-of-thinking, and be confident, settled, and liberated in it.’ ",
  "an9.41:8.11": "And so, after some time, having seen the woe in thinking, I cultivated that, and having realized the value of the absence-of-thinking, I fostered that. ",
  "an9.41:8.12": "Then, seeing it as peaceful, my mind leapt at the absence-of-thinking, and was confident, settled, and liberated in it. ",
  "an9.41:8.13": "‘And so, with the appeasement of thinking and pondering ... I abided having entered upon the second jhāna.’ ",
  "an9.41:8.14": "As I abided in that way, perceptions and attentions connected with thinking beset me, and that was an affliction for me. ",
  "an9.41:8.15": "Suppose unease would arise for someone who is at ease; that would be an affliction for them. ",
  "an9.41:8.16": "In the same way,  perceptions and attentions connected with thinking beset me, and that was an affliction for me. ",
  "an9.41:9.1": "Then I thought, ",
  "an9.41:9.2": "‘Why don’t I—with the fading of joy, abiding equanimous, recollected, and comprehending, experiencing ease with the body—abide having entered upon the third jhāna, regarding which the noble ones say “one abides equanimous, recollected and at ease”?’. ",
  "an9.41:9.3": "But my mind didn’t see the absence-of-joy as peaceful, and so it didn’t leap at it, and wasn’t confident, settled, and liberated in it. ",
  "an9.41:9.4": "Then I thought, ",
  "an9.41:9.5": "‘What is the cause, what is the reason why my mind doesn’t see the absence-of-joy as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it?’ ",
  "an9.41:9.6": "Then I thought, ",
  "an9.41:9.7": "‘I haven’t seen the woe in joy, and I haven’t cultivated that. I haven’t realized the value of the absence-of-joy, and I haven’t fostered that. ",
  "an9.41:9.8": "That is why my mind doesn’t see the absence-of-joy as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it.’ ",
  "an9.41:9.9": "Then I thought, ",
  "an9.41:9.10": "‘Suppose that, having seen the woe in joy, I were to cultivate that. And suppose that, having realized the value of the absence-of-joy, I were to foster that. It’s possible that, seeing it as peaceful, my mind would leap at the absence-of-joy, and be confident, settled, and liberated in it.’ ",
  "an9.41:9.11": "And so, after some time, having seen the woe in joy, I cultivated that, and having realized the value of the absence-of-joy, I fostered that. ",
  "an9.41:9.12": "Then, seeing it as peaceful, my mind leapt at the absence-of-joy, and was confident, settled, and liberated in it. ",
  "an9.41:9.13": "And so, with the fading of joy … I abided having entered upon the third jhāna. ",
  "an9.41:9.14": "As I abided in that way, perceptions and attentions connected with joy beset me, and that was an affliction for me. ",
  "an9.41:9.15": "Suppose unease would arise for someone who is at ease; that would be an affliction for them. ",
  "an9.41:9.16": "In the same way, perceptions and attentions connected with joy beset me, and that was an affliction for me. ",
  "an9.41:10.1": "Then I thought, ",
  "an9.41:10.2": "‘Why don’t I, with the giving up of ease and unease—and with the ending of happiness and sadness beforehand—without ease or unease, with purity of equanimity and recollection, abide having entered upon the fourth jhāna?’ ",
  "an9.41:10.3": "But my mind didn’t see the absence-of-ease-and-unease as peaceful, and so it didn’t leap at it, and wasn’t confident, settled, and liberated in it. ",
  "an9.41:10.4": "Then I thought, ",
  "an9.41:10.5": "‘What is the cause, what is the reason why my mind doesn’t see the absence-of-ease-and-unease as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it?’ ",
  "an9.41:10.6": "Then I thought, ",
  "an9.41:10.7": "‘I haven’t seen the woe in the ease-of-equanimity, and I haven’t cultivated that. I haven’t realized the value of the absence-of-ease-and-unease, and I haven’t fostered  that. ",
  "an9.41:10.8": "‘That is why my mind doesn’t see the absence-of-ease-and-unease as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it.’ ",
  "an9.41:10.9": "Then I thought, ",
  "an9.41:10.10": "‘Suppose that, having seen the woe in the ease-of-equanimity, I were to cultivate that. And suppose that, having realized the value of the absence-of-ease-and-unease, I were to foster that. It’s possible that, seeing it as peaceful, my mind would leap at the absence-of-ease-and-unease, and be confident, settled, and liberated in it.’ ",
  "an9.41:10.11": "And so, after some time, having seen the woe in the ease-of-equanimity, I cultivated that, and having realized the value of the absence-of-ease-and-unease, I fostered that. ",
  "an9.41:10.12": "Then, seeing it as peaceful, my mind leapt at the absence-of-ease-and-unease, and was confident, settled, and liberated in it. ",
  "an9.41:10.13": "And so, with the giving up of ease and unease … I abided having entered upon the fourth jhāna. ",
  "an9.41:10.14": "As I abided in that way, perceptions and attentions connected with equanimity beset me, and that was an affliction for me. ",
  "an9.41:10.15": "Suppose unease would arise for someone who is at ease; that would be an affliction for them. ",
  "an9.41:10.16": "In the same way, perceptions and attentions connected with equanimity beset me, and that was an affliction for me. ",
  "an9.41:11.1": "Then I thought, ",
  "an9.41:11.2": "‘Why don’t I, having fully surmounted perceptions of form, with the ending of perceptions of resistance, not attending to perceptions of diversity, aware that ‘space is infinite’, abide having entered upon the field of infinite space?’ ",
  "an9.41:11.3": "But my mind didn’t see the field of infinite space as peaceful, and so it didn’t leap at it, and wasn’t confident, settled, and liberated in it. ",
  "an9.41:11.4": "Then I thought, ",
  "an9.41:11.5": "‘What is the cause, what is the reason why my mind doesn’t see the field of infinite space as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it?’ ",
  "an9.41:11.6": "Then I thought, ",
  "an9.41:11.7": "‘I haven’t seen the woe in form, and I haven’t cultivated that. I haven’t realized the value of the field of infinite space, and I haven’t fostered  that. ",
  "an9.41:11.8": "That is why my mind doesn’t see the field of infinite space as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it.’ ",
  "an9.41:11.9": "Then I thought, ",
  "an9.41:11.10": "‘Suppose that, having seen the woe in form, I were to cultivate that. And suppose that, having realized the value of the field of infinite space, I were to foster that. It’s possible that, seeing it as peaceful, my mind would leap at the field of infinite space, and be confident, settled, and liberated in it.’ ",
  "an9.41:11.11": "And so, after some time, having seen the woe in thinking, I cultivated that, and having realized the value of the absence-of-thinking, I fostered that. ",
  "an9.41:11.12": "Then, seeing it as peaceful, my mind leapt at the field of infinite space, and was confident, settled, and liberated in it. ",
  "an9.41:11.13": "And so, having fully surmounted perceptions of form, with the ending of perceptions of resistance, not attending to perceptions of diversity, aware that ‘space is infinite’, I abided having entered upon the field of infinite space. ",
  "an9.41:11.14": "As I abided in that way, perceptions and attentions connected with form beset me, and that was an affliction for me. ",
  "an9.41:11.15": "Suppose unease would arise for someone who is at ease; that would be an affliction for them. ",
  "an9.41:11.16": "In the same way, perceptions and attentions connected with form beset me, and that was an affliction for me. ",
  "an9.41:12.1": "Then I thought, ",
  "an9.41:12.2": "‘Why don’t I, having fully surmounted the field of infinite space, aware that ‘consciousness is infinite’, abide having entered upon the field of infinite consciousness?’ ",
  "an9.41:12.3": "But my mind didn’t see the field of infinite consciousness as peaceful, and so it didn’t leap at it, and wasn’t confident, settled, and liberated in it. ",
  "an9.41:12.4": "Then I thought, ",
  "an9.41:12.5": "‘What is the cause, what is the reason why my mind doesn’t see the field of infinite consciousness as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it?’ ",
  "an9.41:12.6": "Then I thought, ",
  "an9.41:12.7": "‘I haven’t seen the woe in the field of infinite space, and I haven’t cultivated that. I haven’t realized the value of the field of infinite consciousness, and I haven’t fostered  that. ",
  "an9.41:12.8": "That is why my mind doesn’t see the field of field infinite consciousness as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it.’ ",
  "an9.41:12.9": "Then I thought, ",
  "an9.41:12.10": "‘Suppose that, having seen the woe in the field of infinite space, I were to cultivate that. And suppose that, having realized the value of the field of infinite consciousness, I were to foster that. It’s possible that, seeing it as peaceful, my mind would leap at the field of infinite consciousness, and be confident, settled, and liberated in it.’ ",
  "an9.41:12.11": "And so, after some time, having seen the woe in the field of infinite space, I cultivated that, and having realized the value of the field of infinite consciousness, I fostered that. ",
  "an9.41:12.12": "Then, seeing it as peaceful, my mind leapt at the field of infinite consciousness, and was confident, settled, and liberated in it. ",
  "an9.41:12.13": "And so, having fully surmounted the field of infinite space, aware that ‘consciousness is infinite’, I abided having entered upon the field of infinite consciousness. ",
  "an9.41:12.14": "As I abided in that way, perceptions and attentions connected with the field of infinite space beset me, and that was an affliction for me. ",
  "an9.41:12.15": "Suppose unease would arise for someone who is at ease; that would be an affliction for them. ",
  "an9.41:12.16": "In the same way, perceptions and attentions connected with the field of infinite space beset me, and that was an affliction for me. ",
  "an9.41:13.1": "Then I thought, ",
  "an9.41:13.2": "‘Why don’t I, having fully surmounted the field of infinite consciousness, aware that ‘there is nothing’, abide having entered upon the field of nothingness?’ ",
  "an9.41:13.3": "But my mind didn’t see the field of nothingness as peaceful, and so it didn’t leap at it, and wasn’t confident, settled, and liberated in it. ",
  "an9.41:13.4": "Then I thought, ",
  "an9.41:13.5": "‘What is the cause, what is the reason why my mind doesn’t see the field of nothingness as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it?’ ",
  "an9.41:13.6": "Then I thought, ",
  "an9.41:13.7": "‘I haven’t seen the woe in the field of infinite consciousness, and I haven’t cultivated that. I haven’t realized the value of the field of nothingness, and I haven’t fostered  that. ",
  "an9.41:13.8": "That is why my mind doesn’t see the field of nothingness as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it.’ ",
  "an9.41:13.9": "Then I thought, ",
  "an9.41:13.10": "‘Suppose that, having seen the woe in the field of infinite consciousness, I were to cultivate that. And suppose that, having realized the value of the field of nothingness, I were to foster that. It’s possible that, seeing it as peaceful, my mind would leap at the field of nothingness, and be confident, settled, and liberated in it.’ ",
  "an9.41:13.11": "And so, after some time, having seen the woe in the field of infinite consciousness, I cultivated that, and having realized the value of the field of nothingness, I fostered that. ",
  "an9.41:13.12": "Then, seeing it as peaceful, my mind leapt at the field of nothingness, and was confident, settled, and liberated in it. ",
  "an9.41:13.13": "And so, having fully surmounted the field of infinite consciousness, aware that ‘there is nothing’, I abided abide having entered upon the field of nothingness. ",
  "an9.41:13.14": "As I abided in that way, perceptions and attentions connected with the field of infinite consciousness beset me, and that was an affliction for me. ",
  "an9.41:13.15": "Suppose unease would arise for someone who is at ease; that would be an affliction for them. ",
  "an9.41:13.16": "In the same way, perceptions and attentions connected with the field of infinite consciousness beset me, and that was an affliction for me. ",
  "an9.41:14.1": "Then I thought, ",
  "an9.41:14.2": "‘Why don’t I, having fully surmounted the field of nothingness, abide having entered upon the field of neither-perception-nor-non-perception?’ ",
  "an9.41:14.3": "But my mind didn’t see the field of neither-perception-nor-non-perception as peaceful, and so it didn’t leap at it, and wasn’t confident, settled, and liberated in it. ",
  "an9.41:14.4": "Then I thought, ",
  "an9.41:14.5": "‘What is the cause, what is the reason why my mind doesn’t see the field of neither-perception-nor-non-perception as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it?’ ",
  "an9.41:14.6": "Then I thought, ",
  "an9.41:14.7": "‘I haven’t seen the woe in the field of nothingness, and I haven’t cultivated that. I haven’t realized the value of the field of neither-perception-nor-non-perception, and I haven’t fostered  that. ",
  "an9.41:14.8": "That is why my mind doesn’t see the field of neither-perception-nor-non-perception as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it.’ ",
  "an9.41:14.9": "Then I thought, ",
  "an9.41:14.10": "‘Suppose that, having seen the woe in the field of nothingness, I were to cultivate that. And suppose that, having realized the value of the field of neither-perception-nor-non-perception, I were to foster that. It’s possible that, seeing it as peaceful, my mind would leap at the field of neither-perception-nor-non-perception, and be confident, settled, and liberated in it.’ ",
  "an9.41:14.11": "And so, after some time, having seen the woe in the field of nothingness, I cultivated that, and having realized the value of the field of neither-perception-nor-non-perception, I fostered that. ",
  "an9.41:14.12": "Then, seeing it as peaceful, my mind leapt at the field of neither-perception-nor-non-perception, and was confident, settled, and liberated in it. ",
  "an9.41:14.13": "And so, having fully surmounted the field of nothingness, I abided having entered upon the field of neither-perception-nor-non-perception. ",
  "an9.41:14.14": "As I abided in that way, perceptions and attentions connected with the field of nothingness beset me, and that was an affliction for me. ",
  "an9.41:14.15": "Suppose unease would arise for someone who is at ease; that would be an affliction for them. ",
  "an9.41:14.16": "In the same way,  perceptions and attentions connected with the field of nothingness beset me, and that was an affliction for me. ",
  "an9.41:15.1": "Then I thought, ",
  "an9.41:15.2": "‘Why don’t I, having fully surmounted the field of neither-perception-nor-non-perception, abide having entered upon the cessation of perception-and-feeling?’ ",
  "an9.41:15.3": "But my mind didn’t see the cessation of perception-and-feeling as peaceful, and so it didn’t leap at it, and wasn’t confident, settled, and liberated in it. ",
  "an9.41:15.4": "Then I thought, ",
  "an9.41:15.5": "‘What is the cause, what is the reason why my mind doesn’t see the cessation of perception-and-feeling as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it?’ ",
  "an9.41:15.6": "Then I thought, ",
  "an9.41:15.7": "‘I haven’t seen the woe in the field of neither-perception-nor-non-perception, and I haven’t cultivated that. I haven’t realized the value of the cessation of perception-and-feeling, and I haven’t fostered  that. ",
  "an9.41:15.8": "That is why my mind doesn’t see the cessation of perception-and-feeling as peaceful, and so it doesn’t leap at it, and isn’t confident, settled, and liberated in it.’ ",
  "an9.41:15.9": "Then I thought, ",
  "an9.41:15.10": "‘Suppose that, having seen the woe in the field of neither-perception-nor-non-perception, I were to cultivate that. And suppose that, having realized the value of the cessation of perception-and-feeling, I were to foster that. It’s possible that, seeing it as peaceful, my mind would leap at the cessation of perception-and-feeling, and be confident, settled, and liberated in it.’ ",
  "an9.41:15.11": "And so, after some time, having seen the woe in the field of neither-perception-nor-non-perception, I cultivated that, and having realized the value of the cessation of perception-and-feeling, I fostered that. ",
  "an9.41:15.12": "Then, seeing it as peaceful, my mind leapt at the cessation of perception-and-feeling, and was confident, settled, and liberated in it. ",
  "an9.41:15.13": "And so, having fully surmounted the field of neither-perception-nor-non-perception, I abided having entered upon the cessation of perception-and-feeling. And, having seen with understanding, my influxes were exhausted. ",
  "an9.41:16.1": "As long as I hadn’t entered upon and withdrawn from these nine progressive attainments of abiding in both forward and reverse order, I didn’t announce my supreme perfect awakening in this world with its gods, Māras, and Brahmās, this population with its ascetics and brahmins, its gods and humans. ",
  "an9.41:16.2": "But when I had entered upon and withdrawn from these nine progressive attainments of abiding in both forward and reverse order, I announced my supreme perfect awakening in this world with its gods, Māras, and Brahmās, this population with its ascetics and brahmins, its gods and humans. ",
  "an9.41:16.3": "Knowledge-and-vision arose in me: ",
  "an9.41:16.4": "‘My liberation of mind is unshakable; this is my last birth; now there will be no renewal of being.’ ",
  "an9.41:16.5": "",
  "an9.41:16.6": "",
  "an9.41:17.1": "",
  "an9.41:17.2": "",
  "an9.41:17.3": ""
}