{
  "an6.10:0.1": "Numbered Discourses 6.10 ",
  "an6.10:0.2": "1. Worthy of Offerings ",
  "an6.10:0.3": "With Mahānāma ",
  "an6.10:1.1": "At one time the Buddha was staying in the land of the Sakyans, near Kapilavatthu in the Banyan Tree Monastery. ",
  "an6.10:1.2": "Then Mahānāma the Sakyan went up to the Buddha, bowed, sat down to one side, and said to him: ",
  "an6.10:1.3": "“Bhante, when a noble disciple has reached the fruit and understood the instructions, how is it that they frequently abide?” ",
  "an6.10:2.1": "“Mahānāma, when a noble disciple has reached the fruit and understood the instructions, they abide in this way. ",
  "an6.10:2.2": "Firstly, a noble disciple recollects the Realized One: ",
  "an6.10:2.3": "‘That Auspicious One is an Arahant, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed.’ ",
  "an6.10:2.4": "When a noble disciple recollects the Realized One, their mind is not consumed by passion, aversion, or muddledness. ",
  "an6.10:2.5": "At that time, their mind is unswerving, based on the Realized One. ",
  "an6.10:2.6": "A noble disciple whose mind is unswerving realizes the Dhamma and its meaning, and gains gladness connected with the Dhamma. ",
  "an6.10:2.7": "When they’re glad, joy is born. When the mind is joyous, the body becomes calm. When the body is calm, they feel at ease. When they’re at ease, the mind becomes composed. ",
  "an6.10:2.8": "This is called ",
  "an6.10:2.9": "a noble disciple who lives in balance among the unbalanced populace, and lives untroubled among the troubled populace. They’ve entered the stream of the Dhamma, and develop the recollection of the Buddha. ",
  "an6.10:3.1": "Furthermore, a noble disciple recollects the Dhamma: ",
  "an6.10:3.2": "‘The Dhamma is well explained by the Buddha: presently evident, not involving time, verifiable, and goading-on, to be known by the wise for themselves.’ ",
  "an6.10:3.3": "When a noble disciple recollects the Dhamma, their mind is not consumed by passion, aversion, or muddledness.  … ",
  "an6.10:3.4": "",
  "an6.10:3.5": "",
  "an6.10:3.6": "",
  "an6.10:3.7": "This is called ",
  "an6.10:3.8": "a noble disciple who lives in balance among the unbalanced populace, and lives untroubled among the troubled populace. They’ve entered the stream of the Dhamma, and develop the recollection of the Dhamma. ",
  "an6.10:4.1": "Furthermore, a noble disciple recollects the Saṅgha: ",
  "an6.10:4.2": "‘The Saṅgha of the Buddha’s disciples is practicing rightly and straightly, practicing the way, the proper course. It consists of the four pairs of people, the eight individuals. This is the Saṅgha of the Buddha’s disciples that is worthy of offerings, worthy of hospitality, worthy of donation, worthy of greeting with joined palms, and is the supreme field of merit for the world.’ ",
  "an6.10:4.3": "When a noble disciple recollects the Saṅgha, their mind is not consumed by passion, aversion, or muddledness.  … ",
  "an6.10:4.4": "",
  "an6.10:4.5": "",
  "an6.10:4.6": "",
  "an6.10:4.7": "This is called ",
  "an6.10:4.8": "a noble disciple who lives in balance among the unbalanced populace, and lives untroubled among the troubled populace. They’ve entered the stream of the Dhamma, and develop the recollection of the Saṅgha. ",
  "an6.10:5.1": "Furthermore, a noble disciple recollects their own virtue: that virtue which is unbroken, flawless, unmottled, spotless, and liberating, praised by the wise, not clung to, and leading to composure. ",
  "an6.10:5.2": "When a noble disciple recollects their own virtue, their mind is not consumed by passion, aversion, or muddledness.  … ",
  "an6.10:5.3": "",
  "an6.10:5.4": "",
  "an6.10:5.5": "",
  "an6.10:5.6": "This is called ",
  "an6.10:5.7": "a noble disciple who lives in balance among the unbalanced populace, and lives untroubled among the troubled populace. They’ve entered the stream of the Dhamma, and develop the recollection of virtue. ",
  "an6.10:6.1": "Furthermore, a noble disciple recollects their own generosity: ",
  "an6.10:6.2": "‘I’m so fortunate, so very fortunate! ",
  "an6.10:6.3": "Among the populace consumed by the stain of stinginess, I live at home rid of stinginess, freely generous, open-handed, delighting in letting go, conscientious of requests, delighting in giving and sharing.’ ",
  "an6.10:6.4": "When a noble disciple recollects their own generosity, their mind is not consumed by passion, aversion, or muddledness.  … ",
  "an6.10:6.5": "",
  "an6.10:6.6": "",
  "an6.10:6.7": "",
  "an6.10:6.8": "This is called ",
  "an6.10:6.9": "a noble disciple who lives in balance among the unbalanced populace, and lives untroubled among the troubled populace. They’ve entered the stream of the Dhamma, and develop the recollection of generosity. ",
  "an6.10:7.1": "Furthermore, a noble disciple recollects the deities: ",
  "an6.10:7.2": "‘There are the Gods of the Four Great Kings, the Gods of the Thirty-Three, the Gods of Yama, the Contented Gods, the Gods Who Delight in Creation, the Gods Who Control the Creations of Others, the Gods of Brahmā’s Host, and gods even higher than these. ",
  "an6.10:7.3": "When those deities passed away from here, they were reborn there because of their faith, virtue, learning, generosity, and understanding. I, too, have the same kind of faith, virtue, learning, generosity, and understanding.’ ",
  "an6.10:7.4": "",
  "an6.10:7.5": "",
  "an6.10:7.6": "",
  "an6.10:7.7": "",
  "an6.10:7.8": "When a noble disciple recollects the faith, virtue, learning, generosity, and understanding of both themselves and those deities, their mind is not consumed by passion, aversion, or muddledness. ",
  "an6.10:7.9": "At that time their mind is unswerving, based on those deities. ",
  "an6.10:7.10": "A noble disciple whose mind is unswerving realizes the Dhamma and its meaning, and gains gladness connected with the Dhamma. ",
  "an6.10:7.11": "When they’re glad, joy is born. When the mind is joyous, the body becomes calm. When the body is calm, they feel at ease. When they’re at ease, the mind becomes composed. ",
  "an6.10:7.12": "This is called ",
  "an6.10:7.13": "a noble disciple who lives in balance among the unbalanced populace, and lives untroubled among the troubled populace. They’ve entered the stream of the Dhamma, and develop the recollection of deities. ",
  "an6.10:8.1": "When a noble disciple has reached the fruit and understood the instructions, they frequently abide in this way.” ",
  "an6.10:8.2": "",
  "an6.10:8.3": "",
  "an6.10:9.1": "",
  "an6.10:9.2": "",
  "an6.10:9.3": ""
}