{
  "sn1.20:21.5": "Notice that these lines do not affirm a hidden reality that lies beyond the domain of the describable. What’s being expressed is that suffering arises due to the mistaken [_conceiving_ of an entity existing outside](https://suttas.hillsidehermitage.org/?q=mn1) the describable (i.e., the experience as a whole) and who wields mastery over it. But if instead of outright denying that there is a sense of self and leaning onto the empty theoretical statement that “the self is an illusion” or similar, one comes to fully understand—within that same present experience—that the sense of self that factually manifests _also_ falls squarely within the domain of the describable, it will cease to be misconceived as an outside master. And therefore it cannot rightly be called a self anymore—while the domain of the describable (the five aggregates) continues to be all that there is. In this way one ceases to be “established in the describable” without going somewhere else (which would only lead to becoming equally established in another describable phenomenon: a transcendent reality that supposedly lies “beyond all experience” is describable to that extent, is being experienced, and thus lies within the five aggregates). ",
  "sn1.20:23.3": "These three judgments cannot be totally eliminated, for even if such an attempt succeeded, there would always be the implication that not having them is “better” and having them is “worse”. But by seeing them as phenomena, enduring within the experience but on a subtler level, one ceases to take them for granted, and there will no longer be the implicit discrepancy/conflict felt when there is a sense of “lack”, nor any actions that come out of that. If one sees, as a phenomenon in its own right, the suggestion of this or that experience as “better” and the associated sense of “lack“—even if it is an accurate idea of Nibbāna—then one can get to see how Nibbāna actually lies in the subduing of delight towards any and all phenomena as such, [*including that one*](https://suttas.hillsidehermitage.org/?q=mn1#mn1:49.1-mn1:50.4). ",
  "sn1.20:25.3": "From the previous comment it should be clear that hope is entirely redundant to the task of developing Nibbāna (of giving up craving). Passion with regard to phenomena is always a present affair, and whenever it is either further maintained and acted out of, or abandoned, it is always *presently*. In this sense the Dhamma does not involve time, which is what the deity is asking the Buddha to explain. ",
  "sn1.20:25.5": "That which would’ve been called “him” has been clearly understood as another describable aspect within the five aggregates, and that’s why “he”, *qua* independent self, [cannot be found anywhere within the experience](https://suttas.hillsidehermitage.org/?q=mn22#mn22:36.4), not because he *destroyed* that which would’ve ordinarily been designated as “him” if he were not an Arahant. The latter is annihilationism and involves time, thus it’s not the Dhamma. [Undermining the Sense of Self](https://www.youtube.com/watch?v=HIDVvlTYxIc) "
}
