{
  "snp4.4:0.1": "Sutta Nipāta 4.4 ",
  "snp4.4:0.2": "The Octad on Purity ",
  "snp4.4:1.1": "“I see the highest purity, free from illness, ",
  "snp4.4:1.2": "A man’s purification is through what is seen.” ",
  "snp4.4:1.3": "Recollecting what he has known as the highest, ",
  "snp4.4:1.4": "He rests on this knowledge, regards it as pure. ",
  "snp4.4:2.1": "If a man’s purity is on account of the seen, ",
  "snp4.4:2.2": "Or if it is by knowledge that he abandons suffering, ",
  "snp4.4:2.3": "Then he, still with appropriation, is purified by something else— ",
  "snp4.4:2.4": "His own view has denounced him as he speaks like this. ",
  "snp4.4:3.1": "A brahman does not speak of purity from something else, ",
  "snp4.4:3.2": "Whether in regard to the seen, heard, thought, or practised and observed. ",
  "snp4.4:3.3": "He is unaffected in terms of both evil and good, ",
  "snp4.4:3.4": "Creating nothing in dropping what was taken up. ",
  "snp4.4:4.1": "They are embedded in the next, having left what came before; ",
  "snp4.4:4.2": "Going by impetus, they cannot get past entrapment. ",
  "snp4.4:4.3": "They let go and take up, ",
  "snp4.4:4.4": "As a monkey drops one branch to grab hold of another. ",
  "snp4.4:5.1": "A person undertaking practices on their own terms, ",
  "snp4.4:5.2": "Goes high and low, tied up in notions. ",
  "snp4.4:5.3": "But the wise one, knowing through discernment the nature of things, ",
  "snp4.4:5.4": "With broad understanding, does not go high and low. ",
  "snp4.4:6.1": "He has removed opposition in regard to all things— ",
  "snp4.4:6.2": "Whatever is seen, heard, or thought. ",
  "snp4.4:6.3": "As he lives transparently seeing like this, ",
  "snp4.4:6.4": "By what in the world could one designate him? ",
  "snp4.4:7.1": "They do not put together or put first; ",
  "snp4.4:7.2": "They do not speak of an “utmost purity.” ",
  "snp4.4:7.3": "Having set loose the tangled knot of grasping, ",
  "snp4.4:7.4": "They create no longing anywhere in the world. ",
  "snp4.4:8.1": "For the brahman who has surmounted limits, ",
  "snp4.4:8.2": "Nothing known or seen is taken up. ",
  "snp4.4:8.3": "Without passion for either passion or dispassion, ",
  "snp4.4:8.4": "There is nothing here for him to hold as the highest. ",
  "snp4.4:8.5": ""
}