{
  "snp4.2:0.1": "Sutta Nipāta 4.2 ",
  "snp4.2:0.2": "The Octad on the Cave ",
  "snp4.2:1.1": "Imprisoned in a cave, deeply buried, ",
  "snp4.2:1.2": "Stands the man who is sunk into ignorance. ",
  "snp4.2:1.3": "One like this is truly far from independence, ",
  "snp4.2:1.4": "For the pleasures of the world are not easy to give up. ",
  "snp4.2:2.1": "Confined based on desire by the sweetness in being, ",
  "snp4.2:2.2": "Not to be freed by others, they are difficult to free. ",
  "snp4.2:2.3": "Now looking behind, now looking ahead, ",
  "snp4.2:2.4": "They long for these pleasures and those of before. ",
  "snp4.2:3.1": "Greedy, absorbed and entranced with pleasures, ",
  "snp4.2:3.2": "They are hard to correct, being set in crooked ways. ",
  "snp4.2:3.3": "Brought into suffering, they lament: ",
  "snp4.2:3.4": "“What will become of us when we fall from here?” ",
  "snp4.2:4.1": "So a person should train themselves in this way: ",
  "snp4.2:4.2": "Whatever they might recognise as crooked in the world, ",
  "snp4.2:4.3": "They should not let that cause them to act crookedly, ",
  "snp4.2:4.4": "For this life is not long, as the wise would say. ",
  "snp4.2:5.1": "In this world I see the struggling of this generation",
  "snp4.2:5.2": "Fallen into craving in regard to states of being. ",
  "snp4.2:5.3": "Wretches who wail in the jaws of death, ",
  "snp4.2:5.4": "Not rid of craving regarding various states of being. ",
  "snp4.2:6.1": "See them struggling in what they regard as “mine”, ",
  "snp4.2:6.2": "Like fish in a pool whose stream has dried up. ",
  "snp4.2:6.3": "Seeing this, one should live without ownership, ",
  "snp4.2:6.4": "Not making attachment to states of being. ",
  "snp4.2:7.1": "Having removed passion in regard to both ends ",
  "snp4.2:7.2": "And comprehended experience, he cannot covet. ",
  "snp4.2:7.3": "Creating no basis for self-reproach, ",
  "snp4.2:7.4": "A wise one is unsoiled in the seen and the heard. ",
  "snp4.2:8.1": "Having comprehended perception and crossed over the flood, ",
  "snp4.2:8.2": "The sage who remains unsoiled by possessions ",
  "snp4.2:8.3": "—With the arrow drawn out, living in diligence—",
  "snp4.2:8.4": "Has no expectation for this world or the other. "
}
