{
  "an9.41:7.9": "See [AN 6.73](https://suttas.hillsidehermitage.org/?q=an6.73). ",
  "an9.41:7.11": "[SN 35.246](https://suttas.hillsidehermitage.org/?q=sn35.246). ",
  "an9.41:7.15": "See the book [“The Only Way to Jhana”](https://www.hillsidehermitage.org/new-book-jhana/), and the essay [“What the Jhānas Actually Are”](https://www.hillsidehermitage.org/what-the-jhanas-actually-are/). It's important to note that the value to cultivate is that of renunciation, not of the first jhāna directly. This is because, from the perspective of a mind not free from sensuality, even the ideas and expectations of the first jhāna would be infected with the same hindrance of longing (_abhijjhā_). One must therefore relinquish *all* expectations of pleasure and invest all the effort in clarifying the peril of sensuality (having already stopped the actual _engagement_ with sensuality way beforehand through virtue and restraint), and the right type of joy will arise on its own as a result of that. See the [simile of the hen and the eggs](https://suttas.hillsidehermitage.org/?q=mn16#mn16:27.2-mn16:27.6). ",
  "an9.41:7.16": "",
  "an9.41:7.17": "",
  "an9.41:7.18": "Translating _saññāmanasikārā_ literally. As said in [AN 9.42](https://suttas.hillsidehermitage.org/?q=an9.42), the first jhāna is the “opening” or “space” (_okāsa_) *amidst* the “confinement” (_sambādha_) of the five strands of sensuality. This means that the perceptions of the pleasant objects of the five senses are, contrary to popular belief, very much still there. But there is an “opening” due to the internal dispassion that has been cultivated beforehand and is still enduring (by [contemplating the affliction](https://suttas.hillsidehermitage.org/?q=mn19)) inherent in those pleasures). That is also what is meant by “*separated* from sensuality …” (_vivicceva kāmehi_). For this same reason, the mind _will_ fall back into sensuality if the dispassion is neglected, and the same principle applies to the subsequent jhānas as seen below. ",
  "an9.41:8.2": "",
  "an9.41:8.10": "Each and every one of the successive attainments, including the cessation of perception-and-feeling, is reached by the Buddha through this reflection, showing how the capacity for contemplation is still there beyond even the second jhāna (but without thinking and pondering, of course). Each jhāna could be regarded as the contemplation/reflection (the literal meaning of _jhāna_) of the unsatisfactoriness of the state that preceded it, and that reflection is the basis where the mind is “unified” (_ekaggatā_). See also AN 9.34 and AN 9.47. "
}