{
  "an10.62:1.1": "This disproves the rather prevalent understanding of ignorance of craving as somethingthat arises at distinct “moments” of our experience and that can be dispelled as a matter of choice. Craving is a much subtler phenomenon than the particular, blatant urges that almost anyone can recognize in themselves, and that is why seeing what craving is to begin with—and understanding that it’s the root of suffering—is *noble insight*, not common sense. ",
  "an10.62:2.9": "The five hindrances are found at the level of one’s overarching attitudes towards the world and behaviors that are exhibited on a regular basis. This is why it is misguided to think they can be “suppressed” during discrete “sessions” of concentration practice—or rather, it’s misguided to think that “suppression” of hindrances is the goal to begin with. One’s actions no longer being driven by the pulls of the hindrances is the goal, not the complete suspension of all action, and one’s overall lifestyle cannot possibly be exempted from those efforts. This is why the abandonment of hindrances is a late stage of [the Gradual Training](https://suttas.hillsidehermitage.org/?q=mn107). See [The Truth About the Five Hindrances](https://www.youtube.com/watch?v=UczBkf8eqxI) and [AN 6.73](https://suttas.hillsidehermitage.org/?q=an6.73). ",
  "an10.62:2.12": "[Restraining the Senses](https://www.hillsidehermitage.org/restraining-the-senses/) ",
  "an10.62:2.18": "[“Wise Attention” — Misunderstanding of Yoniso Manasikāra]; [MN 2](https://suttas.hillsidehermitage.org/?q=mn2) ",
  "an10.62:2.21": "This is a succinct but momentous statement: if one lacks faith in the right instruction, no matter how much one has made sense of _yoniso manasikāra_ on an intellectual level, whatever one takes the “origin” (_yoni_) to be will not actually be the origin, and that is especially the cease if the prerequisites regarding restraint of behavior have not been met. _Yoniso manasikāra_ requires going against the grain of the mind’s tendencies in order to actually qualify as such; it requires leaving no stone unturned. Faith—the willingness to put any view or conviction one might have second to the external instruction—is the only thing that can prevent one from stopping short of that. One’s reasoning is inherently biased by ignorance, and thus, it alone cannot overcome _avijjā_. ",
  "an10.62:6.9": "See also SN 46.6 and SN 47.3. One is immeasurably closer to the four satipaṭṭhānas by keeping the precepts and cultivating virtuous and restrained behavior than by concentrating on one’s breathing sensations X amount of hours per day. The former involves a degree of _yoniso manasikāra_ intrinsically; the latter is the active cultivation of the opposite. "
}