{
  "sn42.8:0.1": "Linked Discourses 42.8 ",
  "sn42.8:0.2": "1. Chiefs ",
  "sn42.8:0.3": "A Horn Blower ",
  "sn42.8:1.1": "On one occasion the Blessed One was staying near Nalandain the Pavarika Mango Grove. ",
  "sn42.8:1.2": "Then Asibandhakaputta the headman, a disciple of the Niganthas, went to the Blessed One and on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him: ",
  "sn42.8:1.3": "“Headman, how does Nigantha Nataputta teach the Dhamma to his disciples?” ",
  "sn42.8:1.4": "“Nigantha Nataputta teaches the Dhamma to his disciples in this way, lord: ",
  "sn42.8:1.5": "‘All those who take life are destined for a state of deprivation, are destined for hell. All those who steal... All those who engage in sexual misconduct... All those who tell lies are destined for a state of deprivation, are destined for hell. ",
  "sn42.8:1.6": "Whatever one keeps doing frequently, by that is one led’ ",
  "sn42.8:1.7": "That's how Nigantha Nataputta teaches the Dhamma to his disciples.” ",
  "sn42.8:1.8": "“If it's true that ‘Whatever one keeps doing frequently, by that is one led’ then no one is destined for a state of deprivation or destined to hell in line with Nigantha Nataputta's words. ",
  "sn42.8:2.1": "What do you think, headman: ",
  "sn42.8:2.2": "If a man is one who takes life, then taking into consideration time spent doing and not doing, whether by day or by night, which time is more: the time he spends taking life or the time he spends not taking life?” ",
  "sn42.8:2.3": "“If a man is one who takes life, lord, then taking into consideration time spent doing and not doing, whether by day or by night, then the time he spends taking life is less, and the time he spends not taking life is certainly more. ",
  "sn42.8:2.4": "If it's true that ‘Whatever one keeps doing frequently, by that is one led’ then no one is destined for a state of deprivation or destined for hell in line with Nigantha Nataputta's words. ”",
  "sn42.8:3.1": "“What do you think, headman: ",
  "sn42.8:3.2": "If a man is one who steals … ",
  "sn42.8:3.3": "",
  "sn42.8:3.4": "",
  "sn42.8:4.1": "engages in sexual misconduct … ",
  "sn42.8:4.2": "",
  "sn42.8:4.3": "",
  "sn42.8:5.1": "tells lies, then taking into consideration time spent doing and not doing, whether by day or by night, which time is more: the time he spends telling lies or the time he spends not telling lies?” ",
  "sn42.8:5.2": "“If a man is one who tells lies, lord, then taking into consideration time spent doing and not doing, whether by day or by night, then the time he spends telling lies is less, and the time he spends not telling lies is certainly more. ",
  "sn42.8:5.3": "If it's true that ‘Whatever one keeps doing frequently, by that is one led’ then no one is destined for a state of deprivation or destined for hell in line with Nigantha Nataputta's words.” ",
  "sn42.8:6.1": "“There's the case, headman, where a certain teacher holds this doctrine, holds this view: ",
  "sn42.8:6.2": "‘All those who take life are destined for a state of deprivation, are destined for hell. All those who steal… All those who indulge in sexual misconduct… All those who tell lies are destined for a state of deprivation, are destined for hell.’ ",
  "sn42.8:6.3": "A disciple has faith in that teacher, ",
  "sn42.8:6.4": "and the thought occurs to him, ",
  "sn42.8:6.5": "‘Our teacher holds this doctrine, holds this view: ",
  "sn42.8:6.6": "“All those who take life are destined for a state of deprivation, are destined for hell. All those who steal… All those who indulge in sexual misconduct… All those who tell lies are destined for a state of deprivation, are destined for hell.” ",
  "sn42.8:6.7": "There are living beings that I have killed … ",
  "sn42.8:6.8": "",
  "sn42.8:6.9": "",
  "sn42.8:6.10": "",
  "sn42.8:6.11": "goods that I have stolen … ",
  "sn42.8:6.12": "",
  "sn42.8:6.13": "",
  "sn42.8:6.14": "",
  "sn42.8:6.15": "sexual misconducts that I have committed … ",
  "sn42.8:6.16": "",
  "sn42.8:6.17": "",
  "sn42.8:6.18": "",
  "sn42.8:6.19": "",
  "sn42.8:6.20": "There are lies that I have told.’ ",
  "sn42.8:6.21": "Therefore I am destined for a state of deprivation, I am destined for hell.’ He fastens onto that view. ",
  "sn42.8:6.22": "If he doesn't abandon that conviction, doesn't abandon that state of mind, doesn't relinquish that view, then as if he were to be carried off, he would thus be placed in hell. ",
  "sn42.8:7.1": "There is the case, headman, where a Tathagata appears in the world, worthy and rightly self-awakened, with clear knowing and conduct, well-gone, a knower of the world, unexcelled trainer of those to be tamed, teacher of human and divine beings, awakened, blessed. ",
  "sn42.8:7.2": "He, in various ways, criticizes and censures the taking of life, and says: ‘Abstain from taking life.’ ",
  "sn42.8:7.3": "He criticizes and censures stealing … ",
  "sn42.8:7.4": "engaging in sexual misconduct … ",
  "sn42.8:7.5": "the telling of lies, and says: ‘Abstain from telling lies.’ ",
  "sn42.8:7.6": "A disciple has faith in that teacher ",
  "sn42.8:7.7": "and reflects: ",
  "sn42.8:7.8": "‘The Blessed One in a variety of ways criticizes and censures the taking of life, and says: “Abstain from taking life.” ",
  "sn42.8:7.9": "There are living beings that I have killed, to a greater or lesser extent. ",
  "sn42.8:7.10": "That was not right. That was not good. ",
  "sn42.8:7.11": "I am remorseful because of that. ",
  "sn42.8:7.12": "But I cannot undo what I've done.’ ",
  "sn42.8:7.13": "So, reflecting thus, he abandons right then the taking of life, ",
  "sn42.8:7.14": "and in the future refrains from taking life. ",
  "sn42.8:7.15": "This is how there comes to be the abandoning of that evil deed. ",
  "sn42.8:7.16": "This is how there comes to be the transcending of that evil deed. ",
  "sn42.8:8.1": "[He reflects:] ‘The Blessed One in a variety of ways criticizes and censures stealing … ",
  "sn42.8:8.2": "",
  "sn42.8:8.3": "",
  "sn42.8:8.4": "",
  "sn42.8:8.5": "",
  "sn42.8:8.6": "",
  "sn42.8:8.7": "",
  "sn42.8:8.8": "",
  "sn42.8:9.1": "engaging in sexual misconduct … ",
  "sn42.8:9.2": "",
  "sn42.8:9.3": "",
  "sn42.8:9.4": "",
  "sn42.8:9.5": "",
  "sn42.8:9.6": "",
  "sn42.8:9.7": "",
  "sn42.8:10.1": "the telling of lies, and says: “Abstain from telling lies.” ",
  "sn42.8:10.2": "There are lies that I have told, to a greater or lesser extent. ",
  "sn42.8:10.3": "That was not right. That was not good. I am remorseful because of that. But I cannot undo what I’ve done.’ ",
  "sn42.8:10.4": "So, reflecting thus, he abandons right then the telling of lies, and in the future refrains from telling lies. ",
  "sn42.8:10.5": "This is how there comes to be the abandoning of that evil deed. This is how there comes to be the transcending of that evil deed. ",
  "sn42.8:11.1": "Having abandoned the taking of life, he refrains from taking life. ",
  "sn42.8:11.2": "Having abandoned stealing, he refrains from stealing. ",
  "sn42.8:11.3": "Having abandoned sexual misconduct, he refrains from sexual misconduct ",
  "sn42.8:11.4": "Having abandoned the telling of lies, he refrains from telling lies. ",
  "sn42.8:11.5": "Having abandoned divisive speech, he refrains from divisive speech ",
  "sn42.8:11.6": "Having abandoned harsh speech, he refrains from harsh speech. ",
  "sn42.8:11.7": "Having abandoned idle chatter, he refrains from idle chatter. ",
  "sn42.8:11.8": "Having abandoned covetousness, he becomes uncovetous ",
  "sn42.8:11.9": "Having abandoned ill will and anger, he becomes one with a mind of no ill will. ",
  "sn42.8:11.10": "Having abandoned wrong views, he becomes one who has right views. ",
  "sn42.8:12.1": "That disciple of the noble ones, headman — thus devoid of covetousness, devoid of ill will, unbewildered, alert, mindful — keeps pervading the first direction [the east] with a mind imbued with friendliness, likewise the second, likewise the third, likewise the fourth. Thus above, below, and all around, everywhere, in its entirety, he keeps pervading the all-encompassing world with a mind imbued with friendliness — abundant, expansive, immeasurable, without hostility, without ill will. ",
  "sn42.8:12.2": "Just as a strong conch-trumpet blower can notify the four directions without any difficulty, ",
  "sn42.8:12.3": "in the same way, when the liberation through friendliness is thus developed, thus pursued, any deed done to a limited extent no longer remains there, no longer stays there. ",
  "sn42.8:13.1": "That disciple of the noble ones — thus devoid of covetousness, devoid of ill will, unconfused, alert, recollected — keeps pervading the first direction with a mind imbued with compassion … ",
  "sn42.8:13.2": "appreciation … ",
  "sn42.8:13.3": "equanimity, likewise the second, likewise the third, likewise the fourth. Thus above, below, and all around, everywhere, in its entirety, he keeps pervading the all-encompassing world with a mind imbued with equanimity — abundant, expansive, immeasurable, without hostility, without ill will. ",
  "sn42.8:13.4": "Just as a strong conch-trumpet blower can notify the four directions without any difficulty, ",
  "sn42.8:13.5": "in the same way, when the liberation through equanimity is thus developed, thus pursued, any deed done to a limited extent no longer remains there, no longer stays there.” ",
  "sn42.8:14.1": "When this was said, Asibandhakaputta the headman, the disciple of the Niganthas, said to the Blessed One: ",
  "sn42.8:14.2": "“Magnificent, lord! … ",
  "sn42.8:14.3": "May the Blessed One remember me as a lay follower who has gone for refuge from this day forward, for life.” "
}
