{
  "sn36.6:0.3": "[“Difference Between Ariya and Puthujjana”](https://www.youtube.com/watch?v=gkwYOroXqK0&pp=ygUeaGlsbHNpZGUgaGVtcml0YWdlIGFycm93IHN1dHRh) ",
  "sn36.6:1.3": "The two statements above set the context of the entire Sutta, and make plain that the first arrow (that which is shared by both individuals) is feeling in general, not “physical feelings” only, as it's sometimes interpreted. _vedanā_ denotes the affective quality of something, and not bodily sensations. Confusing the two wreaks havoc on the Dhamma. Sensations are _saññā_, and are limited to the 5th sense base; pleasant, unpleasant, and neutral feeling is _vedanā_, and this arises in regard to every sense base (MN 148), including the sense of touch. Cutting themselves can feel pleasant and satisfying for some people, and being caressed by someone can be upsetting in some situations, showing how any given sensation can be _felt_ either pleasantly or unpleasantly. ",
  "sn36.6:1.7": "“kāyika” (bodily) here tends to be mistranslated as “physical”, implying that it refers to painful sensations. But the term for physical pain in Pali is _sārīrika dukkhā vedanā_, used for instance in the context of enduring heat, cold, harsh words of others etc. (e.g., AN 3.49). _kāyika_ refers to the six-sense base/five aggregates as a whole. For instance, SN 22.1 classifies “affliction in body (_kāya_)” as deterioration of *any* of the five aggregates, whereas “affliction in mind (_citta_)” is caused by appropriation being present when the aggregates deteriorate. The feeling arising from the death of a loved one or from a bad mood would thus also be “bodily”, i.e., pertaining to the five aggregates. An extra layer of suffering in the _citta_ will be there on top of that when notions of ownership regarding the aggregates are present, and that is the second arrow. See [this](https://www.youtube.com/watch?v=lMl8C1ViL1c) and [this](https://www.youtube.com/watch?v=Hd9WZzxqAkE) for clarification on _citta_, which in this Sutta is best left untranslated to avoid confusion with _mano_ (see next comment). ",
  "sn36.6:1.13": "The word _cetasika_ here is key and rules out any suggestion of a contrast being made between the five physical senses and the sixth sense, which is _mano_, not _citta_. That _citta_ is not the same as _mano_ is illustrated by Suttas like AN 6.55, where it’s stated that the Arahant’s _citta_ remains unperturbed despite intense phenomena arising for _mano_. ",
  "sn36.6:1.14": "—[and that is the sole reason why they suffer.]](https://www.youtube.com/watch?v=f8R1za5f9sI) That resistance is the inevitable result of the implicit sense of ownership that a _puthujjana_ cannot overcome (_sakkāyadiṭṭhi_ or personality-view). Only with the view that one is in a privileged position of control—of being somehow “outside” and “above” the five aggregates and thus being able to manipulate them freely—is resistance conceivable. ",
  "sn36.6:1.18": "The pleasure of sensuality serves as a “cover up” to avoid facing the displeasure and dissatisfaction [that would be there otherwise](https://www.youtube.com/watch?v=t6Q94MYr3Qc). ",
  "sn36.6:1.21": "A discussion on [“neutral” feeling](https://www.youtube.com/watch?v=ow4u4hHQwL8). ",
  "sn36.6:2.3": "Since this depends on the understanding of the nature of feeling, which is gained only with the [Right View](https://suttas.hillsidehermitage.org/?q=mn%209), there is no way for a _puthujjana_ not to be struck by the second arrow if an unpleasant feeling has arisen. If a _puthujjana_ is not suffering on a given occasion, it has to be because the present *feeling* is not actually unpleasant, even if the *perceptions* (bodily sensations) involved are things that would make most people suffer. An example of this would be soldiers, whose tolerance of intense physical sensations is way above average. Their tolerance of _feeling_ is an entirely different matter, however, which is why they aren't any closer to becoming noble disciples than normal people. ",
  "sn36.6:3.9": "The first two types of noble disciples, the stream-enterer and once-returner, are still subject to the fetter of sensual desire, and so they theoretically can experience craving for sensuality on occasions of heedlessness. But the difference remains that for them, that pleasure would no longer be used as a tool to escape and cover up an unpleasant feeling, as they know that this is futile, and they also know the actual escape. Their sensual craving, despite still being a defilement from an Arahant's point of view, is not accompanied by the vast amounts of delusion and self-deception with which the ordinary person would seek sensual pleasures. ",
  "sn36.6:3.11": "The escape is nothing but the cessation of craving against the feeling _while_ it persists, hence the metaphor of being “unyoked” just below. Replacing an unpleasant feeling with a different feeling, the principle of [“management”](https://www.youtube.com/watch?v=zndwMKAszWM) that the majority of contemporary practices revolve around, is not at all an escape. It results in simply being “yoked” to something less unpleasant for the time being, and it's essentially about evading the first arrow so as to circumstantially prevent the second one. ",
  "sn36.6:4.1": "“Not feeling a feeling”: as said above, the feeling is there, but the noble disciple is “unyoked” from it. "
}