{
  "sn47.8:0.1": "Linked Discourses 47.8 ",
  "sn47.8:0.2": "1. In Ambapālī’s Mango Grove ",
  "sn47.8:0.3": "The Cook ",
  "sn47.8:1.1": "“Bhikkhus, suppose a foolish, incompetent, unskillful cook was to serve a king or his minister with a vast array of curries: ",
  "sn47.8:1.2": "superbly sour, bitter, pungent, and sweet; hot and mild, salty and bland. ",
  "sn47.8:2.1": "But that cook didn’t pick up the cue of his own master: ",
  "sn47.8:2.2": "‘Today my master preferred this sauce, or he reached for it, or he took a lot of it, or he praised it. ",
  "sn47.8:2.3": "Today my master preferred the sour or bitter or pungent or sweet or hot or mild or salty sauce. Or he preferred the bland sauce, or he reached for the bland one, or he took a lot of it, or he praised it.’ ",
  "sn47.8:3.1": "That foolish, incompetent, unskillful cook doesn’t get presented with clothes, wages, or bonuses. ",
  "sn47.8:3.2": "Why is that? ",
  "sn47.8:3.3": "Because he doesn’t pick up the cue of his own master. ",
  "sn47.8:3.4": "In the same way, a foolish, incompetent, unskillful bhikkhu abides maintaining perspective of the body concurrently with the body—diligent, aware, and recollected, having subdued longing and upset in regard to the world. ",
  "sn47.8:3.5": "As he abides maintaining perspective of the body concurrently with the body, his mind does not become composed, and the defilements are not given up. ",
  "sn47.8:3.6": "He doesn’t pick up that cue. ",
  "sn47.8:3.7": "He abides maintaining perspective of feelings concurrently with feelings... ",
  "sn47.8:3.8": "of the mind concurrently with the mind … ",
  "sn47.8:3.9": "of phenomena concurrently with phenomena—diligent, aware, and recollected, having subdued longing and upset in regard to the world. ",
  "sn47.8:3.10": "As he abides maintaining perspective of phenomena concurrently with phenomena, his mind does not become composed, and the defilements are not given up. ",
  "sn47.8:3.11": "He doesn’t pick up that cue. ",
  "sn47.8:4.1": "That foolish, incompetent, unskillful bhikkhu doesn’t gain comfortable abidings right in the present experience, nor does he gain recollection and awareness. ",
  "sn47.8:4.2": "Why is that? ",
  "sn47.8:4.3": "Because that foolish, incompetent, unskillful bhikkhu does not pick up the cue of his own mind. ",
  "sn47.8:5.1": "Suppose an astute, competent, skillful cook was to serve a ruler or their minister with a vast array of curries: ",
  "sn47.8:5.2": "superbly sour, bitter, pungent, and sweet; hot and mild, salty and bland. ",
  "sn47.8:6.1": "And that cook picked up the cue of his own master: ",
  "sn47.8:6.2": "‘Today my master preferred this sauce, or he reached for it, or he took a lot of it, or he praised it. ",
  "sn47.8:6.3": "Today my master preferred the sour or bitter or pungent or sweet or hot or mild or salty sauce. Or he preferred the bland sauce, or he reached for the bland one, or he took a lot of it, or he praised it.’ ",
  "sn47.8:7.1": "That astute, competent, skillful cook gets presented with clothes, wages, and bonuses. ",
  "sn47.8:7.2": "Why is that? ",
  "sn47.8:7.3": "Because he picks up the cue of his own master. ",
  "sn47.8:7.4": "In the same way, a wise, competent, skillful bhikkhu abides maintaining perspective of the body concurrently with the body—diligent, aware, and recollected, having subdued longing and upset in regard to the world. ",
  "sn47.8:7.5": "As he abides maintaining perspective of the body concurrently with the body, his mind becomes composed, and the defilements are given up. ",
  "sn47.8:7.6": "He picks up that cue. ",
  "sn47.8:7.7": "He abides maintaining perspective of feelings concurrently with feelings ... ",
  "sn47.8:7.8": "of the mind concurrently with the mind … ",
  "sn47.8:7.9": "of phenomena concurrently with phenomena—diligent, aware, and recollected, having subdued longing and upset in regard to the world. ",
  "sn47.8:7.10": "As he abides maintaining perspective of phenomena concurrently with phenomena, his mind becomes composed, and the defilements are given up. ",
  "sn47.8:7.11": "He picks up that cue. ",
  "sn47.8:8.1": "That wise, competent, skillful bhikkhu gains comfortable abidings right in the present experience, and he gains recollection and awareness. ",
  "sn47.8:8.2": "Why is that? ",
  "sn47.8:8.3": "Because that wise, competent, skillful bhikkhu picks up the cue of his own mind.” "
}