{
  "an3.101:2.1": "Since it’s a bhikkhu being referred to, these “coarse corruptions” are still by necessity a lot finer than incelibacy and sensual pursuits. So a person must bring themselves to that point at least, regardless of whether they formally ordain or not, before any of this even applies. Otherwise, it would be like placing raw gold ore directly into the crucible, without removing the crude impurities first. ",
  "an3.101:2.2": "Note that genuine abandonment of impurities in the way described here can only occur when one is willing to relinquish them indefinitely, without deciding in advance to re-take them at a later time. Granted, from a third-person point of view one can say that the impurities will most likely return and can only be permanently dispelled by the attainment of non-return or higher, but from the _internal_, first-person, perspective of the mind that is being presently purified, they are being given up “forever“ if they are actually being given up at all. ",
  "an3.101:2.4": "See [this passage](https://suttas.hillsidehermitage.org/?q=mn19#mn19:9-10.6-mn19:9-10.14). ",
  "an3.101:2.8": "_sati satiāyatane_: The meaning here is that each of the following knowledges can only be realized if they are already implicit in the experience as phenomena, and thus can be “remembered” or “recollected” (the meaning of _sati_, which applies here in the same sense as the [_satipaṭṭhānas_]: the four foundations of experience that are always _already there_ and are not being fabricated, and can at most be un-ignored/remembered).  In the case of psychic abilities, these might not be available no matter how far one's _sati_ has been developed through samādhi, as was the case for Ven. Sāriputta and others. As for Arahantship, the same principle applies: Nibbāna can be “remembered” as a phenomenon if the things that obstruct it have been sufficiently cleared out and the most general aspects of experience become evident, and this would also take place through the development of _samādhi_ (which broadens and expands the mind as opposed to narrowing it down, as would tend to be expected). "
}