{
  "an10.2:0.1": "Numbered Discourses 10.2 ",
  "an10.2:0.2": "1. Benefits ",
  "an10.2:0.3": "Making a Wish ",
  "an10.2:1.1": "“Bhikkhus, for a virtuous person, one who is accomplished in virtue, no intention need be exerted: ",
  "an10.2:1.2": "‘May non-regret arise in me!’ ",
  "an10.2:1.3": "It’s only natural that non-regret arises in a virtuous person who is accomplished in virtue. ",
  "an10.2:1.4": "For one without regret, no intention need be exerted: ",
  "an10.2:1.5": "‘May gladness arise in me!’ ",
  "an10.2:1.6": "It’s only natural that gladness is born for one without regret. ",
  "an10.2:1.7": "For one who is glad, no intention need be exerted: ",
  "an10.2:1.8": "‘May joy arise in me!’ ",
  "an10.2:1.9": "It’s only natural that joy arises for one who is glad. ",
  "an10.2:1.10": "For one whose mind is joyous, no intention need be exerted: ",
  "an10.2:1.11": "‘May my body become calm!’ ",
  "an10.2:1.12": "It’s only natural that for one whose mind is joyous, the body becomes calm. ",
  "an10.2:1.13": "For one whose body is calm, no intention need be exerted: ",
  "an10.2:1.14": "‘May I feel at ease!’ ",
  "an10.2:1.15": "It’s only natural that one whose body is calm feels at ease. ",
  "an10.2:1.16": "For one who is at ease, no volition need be exerted: ",
  "an10.2:1.17": "‘May my mind become composed!’ ",
  "an10.2:1.18": "It’s only natural that for one who is at ease, the mind becomes composed. ",
  "an10.2:1.19": "For one who is composed, no intention need be exerted: ",
  "an10.2:1.20": "‘May I know and see accurately!’ ",
  "an10.2:1.21": "It’s only natural that one who is composed knows and sees accurately. ",
  "an10.2:1.22": "For one who knows and sees accurately, no intention need be exerted: ",
  "an10.2:1.23": "‘May I become disenchanted and dispassionate!’ ",
  "an10.2:1.24": "It’s only natural that one who knows and sees accurately becomes disenchanted and dispassionate. ",
  "an10.2:1.25": "For one who is disenchanted and dispassionate, no intention need be exerted: ",
  "an10.2:1.26": "‘May I realize the knowledge-and-vision of liberation!’ ",
  "an10.2:1.27": "It’s only natural that one who is disenchanted and dispassionate realizes the knowledge-and-vision of liberation. ",
  "an10.2:2.1": "And so, bhikkhus, the knowledge-and-vision of freedom is the purpose and benefit of disenchantment and dispassion. ",
  "an10.2:2.2": "Disenchantment and dispassion is the purpose and benefit of truly knowing and seeing. ",
  "an10.2:2.3": "Knowing and seeing accurately is the purpose and benefit of composure. ",
  "an10.2:2.4": "Composure is the purpose and benefit of ease. ",
  "an10.2:2.5": "Ease is the purpose and benefit of calm. ",
  "an10.2:2.6": "Calm is the purpose and benefit of joy. ",
  "an10.2:2.7": "Joy is the purpose and benefit of gladness. ",
  "an10.2:2.8": "Gladness is the purpose and benefit of non-regret. ",
  "an10.2:2.9": "Non-regret is the purpose and benefit of virtuous behavior. ",
  "an10.2:2.10": "And so, bhikkhus, things flow on and fill up from one to the other, for going from the near shore to the far shore.” "
}