{
    "dn10:0.1": "Long Discourses 10 ",
    "dn10:0.2": "With Subha ",
    "dn10:1.1.1": "So I have heard. ",
    "dn10:1.1.2": "At one time Venerable Ānanda was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. It was not long after the Auspicious One had become fully extinguished. ",
    "dn10:1.1.3": "Now at that time the brahmin student Subha, Todeyya’s son, was residing in Sāvatthī on some business. ",
    "dn10:1.2.1": "Then he addressed a certain student, ",
    "dn10:1.2.2": "“Here, student, go to the ascetic Ānanda and in my name bow with your head to his feet. Ask him if he is healthy and well, nimble, strong, and living comfortably. ",
    "dn10:1.2.4": "And then say: ",
    "dn10:1.3.1": "‘Sir, please visit the student Subha, Todeyya’s son, at his home out of compassion.’” ",
    "dn10:1.3.2": "“Yes, sir,” replied the student, and did as he was asked. ",
    "dn10:1.4.1": "When he had spoken, Venerable Ānanda said to him, ",
    "dn10:1.4.2": "“It is not the right time, student. ",
    "dn10:1.4.3": "I have drunk a dose of medicine today. ",
    "dn10:1.4.4": "But hopefully tomorrow I’ll get a chance to visit him.” ",
    "dn10:1.4.5": "“Yes, sir,” replied the student. He went back to Subha, and informed him of the matter, adding, ",
    "dn10:1.4.13": "“This much, sir, I managed to do. At least Master Ānanda will take the opportunity to visit tomorrow.” ",
    "dn10:1.5.1": "Then, when the night had passed, Ānanda robed up in the morning and, taking his bowl and robe, went with Venerable Cetaka as his second monk to Subha’s home, where he sat on the seat spread out. Then Subha approached Ānanda, and exchanged pleasantries with him. ",
    "dn10:1.5.2": "When the amicable and cordial talk was over, he sat down to one side and said to Ānanda: ",
    "dn10:1.5.3": "“Master Ānanda, you were Master Gotama’s attendant. You were close to him, living in his presence. ",
    "dn10:1.5.4": "You ought to know what things Master Gotama praised, and in which he encouraged, settled, and grounded all these people. ",
    "dn10:1.5.5": "What were those things?” ",
    "dn10:1.6.1": "“Student, the Auspicious One praised three aggregates, and that is what he encouraged, settled, and grounded all these people in. ",
    "dn10:1.6.2": "What three? ",
    "dn10:1.6.3": "The noble aggregate of virtue, the noble aggregate of composure, and the noble aggregate of understanding. ",
    "dn10:1.6.4": "These are the three aggregates that the Auspicious One praised, and in which he encouraged, settled, and grounded all these people.” ",
    "dn10:1.6.5.0": "1. The Aggregate of Virtue ",
    "dn10:1.6.6": "“But what was that aggregate of noble virtue that the Buddha praised?” ",
    "dn10:1.7.1": "“Student, it is when a Realized One arises in the world, an Arahant, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed. ",
    "dn10:1.7.2": "Having for himself comprehended and experienced this world—with its gods, Māras and Brahmās, this population with its ascetics and brahmins, gods and humans—he makes it known to others. ",
    "dn10:1.7.3": "He teaches the Dhamma that is good in the beginning, good in the middle, and good in the end, meaningful and well-phrased. And he reveals a renunciate life that is entirely complete and pure. ",
    "dn10:1.8.1": "A householder hears that teaching, or a householder’s son, or someone born in some good family. ",
    "dn10:1.8.2": "He gains faith in the Realized One ",
    "dn10:1.8.3": "and reflects: ",
    "dn10:1.8.4": "‘Household life is confined and dusty, but the life of one gone forth is wide open. ",
    "dn10:1.8.5": "It is not easy for someone living at home to lead the renunciate life utterly complete and pure, like a polished shell. ",
    "dn10:1.8.6": "Why don’t I shave off my hair and beard, dress in ocher robes, and go forth from the lay life to homelessness?’ ",
    "dn10:1.9.1": "After some time, he gives up a large or small fortune and a large or small family circle. He shaves off hair and beard, dresses in ocher robes, and goes forth from the lay life to homelessness. ",
    "dn10:1.10.1": "Once he is gone forth, he lives restrained by the code of conduct, endowed with proper behavior and a suitable environment. Seeing danger in the slightest fault, he trains in the training rules. He acts skillfully by body and speech. He is purified in livelihood and accomplished in virtue. He guards the sense doors, is endowed with remembrance-and-awareness, and is content. ",
    "dn10:1.11.1": "And how is the bhikkhu accomplished in virtue? ",
    "dn10:1.11.2": "It is when the bhikkhu gives up and abstains from killing living creatures, renouncing the rod and the sword. He is scrupulous and kind, living compassionate for the welfare of all creatures and beings. ",
    "dn10:1.12.1-1.27": "This pertains to his virtue. ",
    "dn10:1.28.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
    "dn10:1.28.2": "This includes rites for propitiation, for granting wishes, for ghosts, for the earth, for rain, for property settlement, and for preparing and consecrating house sites, and rites involving rinsing and bathing, and oblations. It also includes administering emetics, purgatives, expectorants, and phlegmagogues; administering ear-oils, eye restoratives, nasal medicine, ointments, and counter-ointments; surgery with needle and scalpel, treating children, prescribing root medicines, and binding on herbs. ",
    "dn10:1.28.3": "He abstains from such low arts, such wrong livelihood. ",
    "dn10:1.28.7": "This pertains to his virtue. ",
    "dn10:1.29.1": "In the same way, a bhikkhu thus accomplished in virtue sees no danger in any quarter in regards to his virtuous restraint. ",
    "dn10:1.29.2": "It is like a king who has defeated his enemies. He sees no danger from his foes in any quarter. ",
    "dn10:1.29.3": "In the same way, a bhikkhu thus accomplished in virtue sees no danger in any quarter in regards to his virtuous restraint. ",
    "dn10:1.29.4": "Possessed of this noble aggregate of virtue, he experiences a blameless ease internally. ",
    "dn10:1.29.5": "That is how the bhikkhu is accomplished in virtue. ",
    "dn10:1.30.1": "This is that noble aggregate of virtue that the Auspicious One praised. ",
    "dn10:1.30.2": "But there is still more to be done.” ",
    "dn10:1.30.3": "“It is remarkable, Master Ānanda, it is extraordinary, ",
    "dn10:1.30.4": "This noble aggregate of virtue is complete, not lacking anything! ",
    "dn10:1.30.5": "Such a complete, noble aggregate of virtue cannot be seen among the other ascetics and brahmins. ",
    "dn10:1.30.6": "Were other ascetics and brahmins to see such a complete, noble aggregate of virtue in themselves, they’d be pleased with just that much: ",
    "dn10:1.30.7": "‘At this point it is enough; at this point our work is done. We have reached the goal of our ascetic life. There is nothing more to be done.’ ",
    "dn10:1.30.8": "And yet you say: ",
    "dn10:1.30.9": "‘But there is still more to be done.’ ",
    "dn10:2.1.0": "2. The Aggregate of Composure ",
    "dn10:2.1.1": "But what, Master Ānanda, was that noble aggregate of composure that the Buddha praised?” ",
    "dn10:2.2.1": "“And how, student, does the bhikkhu guard the sense doors? ",
    "dn10:2.2.2": "When he sees a sight with the eye, he does not grasp at signs and features of it ",
    "dn10:2.2.3": "on account of which—due to abiding with the eye faculty unrestrained—bad, unbeneficial thoughts of longing and upset would flow in on him. He practices to restrain that; he guards the eye faculty and brings about the restraint of the eye faculty. ",
    "dn10:2.2.4": "When he hears a sound with the ear … ",
    "dn10:2.2.5": "When he smells an odor with the nose … ",
    "dn10:2.2.6": "When he tastes a flavor with the tongue … ",
    "dn10:2.2.7": "When he touches a touch with the body … ",
    "dn10:2.2.8": "When he cognizes a phenomenon with the mental faculty, he does not grasp at signs and features of it ",
    "dn10:2.2.9": "on account of which—due to abiding with the mental faculty unrestrained—bad, unbeneficial thoughts of longing and upset would flow in on him. He practices to restrain that; he guards the mental faculty and brings about the restraint of the mental faculty. ",
    "dn10:2.2.10": "Possessed of this noble sense restraint, he experiences an unsullied ease internally. ",
    "dn10:2.2.11": "That is how a bhikkhu guards the sense doors. ",
    "dn10:2.3.1": "And how is the bhikkhu possessed of remembrance-and-awareness? ",
    "dn10:2.3.2": "It is when the bhikkhu acts with awareness when going out and coming back; when looking ahead and aside; when bending and extending the limbs; when bearing the outer robe, bowl and robes; when eating, drinking, chewing, and tasting; when urinating and defecating; when walking, standing, sitting, sleeping, waking, speaking, and keeping silent. ",
    "dn10:2.3.3": "That is how the bhikkhu is possessed of remembrance-and-awareness. ",
    "dn10:2.4.1": "And how is the bhikkhu content? ",
    "dn10:2.4.2": "It is when a bhikkhu is content with robes to look after the body and almsfood to look after the belly. Wherever he goes, he sets out taking only these things. ",
    "dn10:2.4.3": "He is like a bird: wherever it flies, wings are its only burden. ",
    "dn10:2.4.4": "In the same way, the bhikkhu is content with robes to look after the body and almsfood to look after the belly. Wherever he goes, he sets out taking only these things. ",
    "dn10:2.4.5": "That is how the bhikkhu is content. ",
    "dn10:2.5.1": "Possessed of noble aggregate of noble virtue, this noble sense restraint, this noble remembrance-and-awareness, and this noble contentment, ",
    "dn10:2.5.2": "he frequents a secluded lodging—a wilderness, the root of a tree, a hill, a ravine, a mountain cave, a charnel ground, a forest, the open air, a heap of straw. ",
    "dn10:2.5.3": "After the meal, he returns from almsround, sits down cross-legged, sets his body straight, and establishes remembrance at the fore. ",
    "dn10:2.6.1": "With the giving up of longing with regard to the world, he abides with a mind rid of longing; he cleanses the mind of longing. ",
    "dn10:2.6.2": "With the giving up of ill will and hatred, he abides with a mind rid of ill will, compassionate for the welfare of all creatures and beings; he cleanses the mind of ill will and hatred. ",
    "dn10:2.6.3": "With the giving up of indolence-and-lethargy, he abides with a mind rid of indolence-and-lethargy, perceiving light, recollected, and aware; he cleanses the mind of indolence-and-lethargy. ",
    "dn10:2.6.4": "With the  giving up of restlessness-and-anxiety, he abides without restlessness, his mind internally appeased; he cleanses the mind of restlessness-and-anxiety. ",
    "dn10:2.6.5": "With the giving up of doubt, he abides having gone beyond doubt, not uncertain about beneficial qualities; he cleanses the mind of doubt. ",
    "dn10:2.7.1": "Suppose a man who has gotten into debt were to apply himself to work, ",
    "dn10:2.7.2": "and his efforts proved successful. ",
    "dn10:2.7.3": "He would pay off the original loan and have enough left over to support his partner. ",
    "dn10:2.7.4": "Thinking about this, ",
    "dn10:2.7.8": "he would be filled with joy and happiness. ",
    "dn10:2.8.1": "Suppose a man was sick, suffering, and gravely ill. He would lose his appetite and get physically weak. ",
    "dn10:2.8.2": "But after some time, he would recover from that illness, and regain his appetite and his strength. ",
    "dn10:2.8.3": "Thinking about this, ",
    "dn10:2.8.6": "he would be filled with joy and happiness. ",
    "dn10:2.9.1": "Suppose a man was imprisoned in a jail. ",
    "dn10:2.9.2": "But after some time, he was released from jail, safe and sound, with no loss of wealth. ",
    "dn10:2.9.3": "Thinking about this, ",
    "dn10:2.9.6": "he would be filled with joy and happiness. ",
    "dn10:2.10.1": "Suppose a man was a bondservant. He would not be his own master, but indentured to another, unable to go where he wishes. ",
    "dn10:2.10.2": "But after some time, he would be freed from servitude. He would be his own master, not indentured to another, an emancipated individual able to go where he wishes. ",
    "dn10:2.10.3": "Thinking about this, ",
    "dn10:2.10.6": "he would be filled with joy and happiness. ",
    "dn10:2.11.1": "Suppose there was a man with wealth and property who was traveling along a desert road, which was perilous, with nothing to eat. ",
    "dn10:2.11.2": "But after some time, he crossed over the desert safely, arriving within a village, a sanctuary free of peril. ",
    "dn10:2.11.3": "Thinking about this, ",
    "dn10:2.11.6": "he would be filled with joy and happiness. ",
    "dn10:2.12.1": "In the same way, the bhikkhu regards these five hindrances that are not given up in him as a debt, a disease, a prison, slavery, and a desert crossing. ",
    "dn10:2.12.2": "But when these five hindrances are given up in him, the bhikkhu regards this as freedom from debt, good health, release from prison, emancipation, and a place of safety at last. ",
    "dn10:2.12.4": "Considering that the five hindrances have been given up in him, gladness is born. When he is glad, joy is born. When the mind is joyous, the body becomes calm. When the body is calm, he feels at ease. When he is at ease, the mind becomes composed. ",
    "dn10:2.13.1": "Having thoroughly withdrawn from sensuality, having withdrawn from unbeneficial phenomena, with thinking and with pondering, with joy and ease born of withdrawal, they abide having entered upon the first jhāna. ",
    "dn10:2.13.2": "He tops up, suffuses, fills, and pervades his body with the joy and ease born of withdrawal. There would be no part of his whole body that is not pervaded with the joy and ease born of withdrawal. ",
    "dn10:2.14.1": "It is like when a deft bathroom attendant or their apprentice pours bath powder into a bronze dish, sprinkling it little by little with water. They knead it until the ball of bath powder is soaked and saturated with moisture, spread through inside and out; yet no moisture oozes out. ",
    "dn10:2.14.2": "In the same way, the bhikkhu tops up, suffuses, fills, and pervades his body with the joy and ease born of withdrawal. There would be no part of his whole body that is not pervaded with the joy and ease born of withdrawal. ",
    "dn10:2.14.5": "This pertains to his composure. ",
    "dn10:2.15.1": "Furthermore, with the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and ease born of composure, a bhikkhu abides having entered upon the second jhāna. ",
    "dn10:2.15.2": "He tops up, suffuses, fills, and pervades his body with the joy and ease born of composure. There would be no part of his whole body that is not pervaded with the joy and ease born of composure. ",
    "dn10:2.16.1": "It is like a deep lake fed by spring water where there would be no inlet to the east, west, north, or south, and no rainfall to replenish it from time to time. But the stream of cool water welling up in the lake would top up, suffuse, fill, and pervade the lake. There would be no part of the whole lake that is not pervaded with cool water. ",
    "dn10:2.16.2": "In the same way, the bhikkhu tops up, suffuses, fills, and pervades his body with the joy and ease born of composure. There would be no part of his whole body that is not pervaded with the joy and ease born of composure. ",
    "dn10:2.16.5": "This pertains to his composure. ",
    "dn10:2.17.1": "Furthermore, with the fading of joy, the bhikkhu abides equanimous, recollected, and aware, experiencing ease with the body. He abides having entered upon the third jhāna, with regard to which the noble ones say “one abides equanimous, recollected, and at ease.” ",
    "dn10:2.17.2": "He tops up, suffuses, fills, and pervades his body with the ease devoid of joy. There would be no part of his whole body that is not pervaded with the ease devoid of joy. ",
    "dn10:2.17.3": "It is like a pool with blue water lilies, or pink or white lotuses. Some of them sprout and grow in the water without rising above it, thriving underwater. From the tip to the root they are topped up, suffused, filled, and pervaded with cool water. There would be no part of them that is not pervaded with cool water. ",
    "dn10:2.17.4": "In the same way, the bhikkhu tops up, suffuses, fills, and pervades his whole body with the ease devoid of joy. There would be no part of his whole body that is not pervaded with the ease devoid of joy. ",
    "dn10:2.17.7": "This pertains to his composure. ",
    "dn10:2.18.1": "Furthermore, with the giving up of ease and unease—and with the ending of joys and upsets beforehand—without ease or unease, with purity of equanimity and remembrance, a bhikkhu abides having entered upon the fourth jhāna. ",
    "dn10:2.18.2": "He sits having pervaded his body with a pure, bright mind. ",
    "dn10:2.18.3": "There’s no part of his whole body that is not pervaded with a pure, bright mind. ",
    "dn10:2.18.4": "It is like a man sitting wrapped from head to foot with white cloth. There would be no part of his whole body that is not spread over with white cloth. ",
    "dn10:2.18.5": "In the same way, the bhikkhu sits having pervaded his body with a pure, bright mind. There would be no part of his whole body that is not pervaded with a pure, bright mind. ",
    "dn10:2.18.8": "This pertains to his composure. ",
    "dn10:2.19.1": "This is that noble aggregate of composure that the Auspicious One praised. ",
    "dn10:2.19.2": "But there is still more to be done.” ",
    "dn10:2.19.3": "“It is remarkable, Master Ānanda, it is extraordinary! ",
    "dn10:2.19.4": "This noble spectrum of composure is complete, not lacking anything! ",
    "dn10:2.19.5": "Such a complete, noble aggregate of composure cannot be seen among the other ascetics and brahmins. ",
    "dn10:2.19.6": "Were other ascetics and brahmins to see such a complete, noble aggregate of composure in themselves, they’d be pleased with just that much: ",
    "dn10:2.19.7": "‘At this point it is enough; at this point our work is done. We have reached the goal of our ascetic life. There is nothing more to be done.’ ",
    "dn10:2.19.8": "And yet you say: ",
    "dn10:2.19.9": "‘But there is still more to be done.’ ",
    "dn10:2.20.0": "3. The Aggregate of Understanding ",
    "dn10:2.20.1": "But what, Master Ānanda, was that noble aggregate of understanding that the Buddha praised?” ",
    "dn10:2.21.1": "When his mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it towards knowledge-and-vision. ",
    "dn10:2.21.2": "He understands: ",
    "dn10:2.21.3": "‘This body of mine is material. It is made up of the four great elements, produced by mother and father, built up from rice and porridge, liable to impermanence, to wearing away and erosion, to breaking up and destruction. ",
    "dn10:2.21.4": "And this consciousness of mine is dependent and tied to it.’ ",
    "dn10:2.22.1": "Suppose there was a beryl gem that was beautiful, genuine, eight-faceted, well-worked, transparent, clear, and unclouded, endowed with all good qualities. And it was strung with a thread of blue, yellow, red, white, or golden brown. ",
    "dn10:2.22.2": "And a man with good eyesight were to take it in his hand and examine it: ‘This beryl gem is beautiful, genuine, eight-faceted, well-worked, transparent, clear, and unclouded, endowed with all good qualities. And it is strung with a thread of blue, yellow, red, white, or golden brown.’ ",
    "dn10:2.22.3": "In the same way, the bhikkhu’s mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it towards knowledge-and-vision. ",
    "dn10:2.22.10": "This pertains to his understanding. ",
    "dn10:2.23.1": "When his mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it towards the creation of a mind-made body. ",
    "dn10:2.23.2": "From this body he creates another body, material, mind-made, complete in all its various parts, not deficient in any faculty. ",
    "dn10:2.24.1": "Suppose a man was to draw a reed out from its sheath. ",
    "dn10:2.24.2": "He would think: ",
    "dn10:2.24.3": "‘This is the reed, this is the sheath. The reed and the sheath are different things. The reed has been drawn out from the sheath.’ ",
    "dn10:2.24.4": "Or suppose a man was to draw a sword out from its scabbard. ",
    "dn10:2.24.5": "He would think: ",
    "dn10:2.24.6": "‘This is the sword, this is the scabbard. The sword and the scabbard are different things. The sword has been drawn out from the scabbard.’ ",
    "dn10:2.24.7": "Or suppose a man was to draw a snake out from its slough. ",
    "dn10:2.24.8": "He would think: ",
    "dn10:2.24.9": "‘This is the snake, this is the slough. The snake and the slough are different things. The snake has been drawn out from the slough.’ ",
    "dn10:2.24.10": "In the same way, when the bhikkhu’s mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it towards knowledge-and-vision. ",
    "dn10:2.24.12": "This pertains to his understanding. ",
    "dn10:2.25.1": "When his mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it extends it towards the various kinds of psychic abilities. ",
    "dn10:2.25.2": "He wields the many kinds of psychic ability: multiplying himself and becoming one again; appearing and disappearing; going unimpeded through a wall, a rampart, or a mountain as if through space; diving in and out of the earth as if it were water; walking on water as if it were earth; flying cross-legged through the sky like a bird; touching and stroking with the hand the sun and moon, so mighty and powerful; controlling the body as far as the Brahmā realm. ",
    "dn10:2.26.1": "Suppose a deft potter or his apprentice had some well-prepared clay. He could produce any kind of pot that he likes. ",
    "dn10:2.26.2": "Or suppose a deft ivory-carver or his apprentice had some well-prepared ivory. He could produce any kind of ivory item that he likes. ",
    "dn10:2.26.3": "Or suppose a deft goldsmith or his apprentice had some well-prepared gold. He could produce any kind of gold item that he likes. ",
    "dn10:2.26.4": "In the same way, when the bhikkhu’s mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it towards the many kinds of psychic abilities. ",
    "dn10:2.26.6": "This pertains to his understanding. ",
    "dn10:2.27.1": "When his mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it towards the divine ear element. ",
    "dn10:2.27.2": "With the divine ear element that is purified and superhuman, they hear both kinds of sounds, human and divine, whether near or far. ",
    "dn10:2.27.3": "Suppose there was a man traveling along the road. He would hear the sound of drums, clay drums, horns, kettledrums, and tom-toms. He would think: ‘That is the sound of drums,’ and ‘that is the sound of clay drums,’ and ‘that is the sound of horns, kettledrums, and tom-toms.’ ",
    "dn10:2.27.4": "In the same way, when the bhikkhu’s mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it towards the divine ear element. ",
    "dn10:2.27.7": "This pertains to his understanding. ",
    "dn10:2.28.1": "When his mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it towards the knowledge of comprehension of minds. ",
    "dn10:2.28.2": "He understands the minds of other beings and individuals, having comprehended them with his own mind. ",
    "dn10:2.28.3": "He understands mind with passion as ‘mind with passion,’ ",
    "dn10:2.28.4": "and mind without passion as ‘mind without passion.’ ",
    "dn10:2.28.5": "He understands mind with aversion as ‘mind with aversion,’ ",
    "dn10:2.28.6": "and mind without aversion as ‘mind without aversion.’ ",
    "dn10:2.28.7": "He understands mind with muddledness as ‘mind with muddledness,’ ",
    "dn10:2.28.8": "and mind without muddledness as ‘mind without muddledness.’ ",
    "dn10:2.28.9": "constricted mind … ",
    "dn10:2.28.10": "scattered mind … ",
    "dn10:2.28.11": "expansive mind … ",
    "dn10:2.28.12": "unexpansive mind … ",
    "dn10:2.28.13": "mind that is not supreme … ",
    "dn10:2.28.14": "mind that is supreme … ",
    "dn10:2.28.15": "composed mind … ",
    "dn10:2.28.16": "mind not composed … ",
    "dn10:2.28.17": "liberated mind … ",
    "dn10:2.28.18": "He understands unliberated mind as ‘unliberated mind’. ",
    "dn10:2.29.1": "Suppose there was a woman or man who was young, youthful, and fond of adornments, and they check their own reflection in a clean bright mirror or a clear bowl of water. If they had a spot they’d know ‘I have a spot,’ and if they had no spots they’d know ‘I have no spots.’ ",
    "dn10:2.29.2": "In the same way, when the bhikkhu’s mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it towards the knowledge of comprehension of minds. ",
    "dn10:2.29.7": "This pertains to his understanding. ",
    "dn10:2.30.1": "When his mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it towards the knowledge of recollection of past lives. ",
    "dn10:2.30.2": "He recollects many kinds of past lives. That is: one, two, three, four, five, ten, twenty, thirty, forty, fifty, a hundred, a thousand, a hundred thousand births; many eons of the world contracting, many eons of the world expanding, many eons of the world contracting and expanding. I remembered: ‘There, I was named this, my clan was that, I looked like this, and that was my food. This was how I felt pleasure and displeasure, and that was how my life ended. When I passed away from that place I reappeared somewhere else. There, too, I was named this, my clan was that, I looked like this, and that was my food. This was how I felt pleasure and displeasure, and that was how my life ended. When I passed away from that place I reappeared here.’ And so I recollected my many kinds of past lives, with features and details. ",
    "dn10:2.31.1": "Suppose a man was to leave his home village and go to another village. From that village he would go to yet another village. And from that village he would return to his home village. He would think: ‘I went from my home village to another village. There I stood like this, sat like that, spoke like this, or kept silent like that. From that village I went to yet another village. There too I stood like this, sat like that, spoke like this, or kept silent like that. And from that village I returned to my home village.’ ",
    "dn10:2.31.2": "In the same way, when the bhikkhu’s mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it towards the knowledge of recollection of past lives. ",
    "dn10:2.31.4": "This pertains to his understanding. ",
    "dn10:2.32.1": "When his mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs it and extends it towards the knowledge of the passing away and reappearance of beings. ",
    "dn10:2.32.2": "With the divine eye that is purified and superhuman, he sees beings passing away and reappearing—inferior and superior, beautiful and ugly, in a good place or a bad place. He understands how beings reappear according to their actions. ‘These beings engaged in misconduct by way of body, speech, and thought. They found fault with the noble ones; they had wrong view; and they chose to act in line with that wrong view. On the dissolution of the body, after death, they reappear in a place of loss, a bad place, the underworld, hell. These beings, however, engaged in good conduct by way of body, speech, and thought. They did not find fault with the noble ones; they had right view; and they chose to act in line with that right view. On the dissolution of the body, after death, they reappear in a good place, a heavenly realm.’ And so, with the divine eye that is purified and superhuman, he sees beings passing away and reappearing—inferior and superior, beautiful and ugly, in a good place or a bad place. He understands how beings reappear according to their actions. ",
    "dn10:2.33.1": "Suppose there was a stilt longhouse at the central square. A man with good eyesight standing there might see people entering and leaving a house, walking along the streets and paths, and sitting at the central square. He would think: ‘These are people entering and leaving a house, walking along the streets and paths, and sitting at the central square.’ ",
    "dn10:2.33.2": "In the same way, when the bhikkhu’s mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it towards the knowledge of the passing away and reappearance of beings. ",
    "dn10:2.33.5": "This pertains to his understanding. ",
    "dn10:2.34.1": "When his mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it towards the knowledge of the destruction of the influxes. ",
    "dn10:2.34.2": "He understands as it is: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering.’ ",
    "dn10:2.34.3": "He understands as it is: ‘These are influxes’ … ‘This is the origin of influxes’ … ‘This is the cessation of influxes’ … ‘This is the practice that leads to the cessation of influxes.’ ",
    "dn10:2.35.1": "Knowing and seeing like this, his mind is liberated from the influxes of sensuality, being, and ignorance. ",
    "dn10:2.35.2": "When it is liberated, he knows it is liberated. ",
    "dn10:2.35.3": "He understands: ‘Birth is destroyed, the renunciate life has been lived, what had to be done has been done, there will be no more of this.’ ",
    "dn10:2.36.1": "Suppose that in a mountain glen there was a lake that was transparent, clear, and unclouded. A man with good eyesight standing on the bank would see the clams and mussels, and pebbles and gravel, and schools of fish swimming about or staying still. He would think: ‘This lake is transparent, clear, and unclouded. And here are the clams and mussels, and pebbles and gravel, and schools of fish swimming about or staying still.’ ",
    "dn10:2.36.2": "In the same way, when the bhikkhu’s mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he directs and extends it towards the knowledge of the destruction of the influxes. ",
    "dn10:2.36.7": "This pertains to his understanding. ",
    "dn10:2.37.1": "This is that noble aggregate of understanding that the Auspicious One praised. ",
    "dn10:2.37.2": "And there is nothing more to be done.” ",
    "dn10:2.37.3": "“It is remarkable, Master Ānanda, it is extraordinary! ",
    "dn10:2.37.4": "This noble aggregate of understanding is complete, not lacking anything! ",
    "dn10:2.37.5": "Such a complete, noble aggregate of understanding cannot be seen among the other ascetics and brahmins. ",
    "dn10:2.37.6": "And there is nothing more to be done. ",
    "dn10:2.37.7": "Excellent, Master Ānanda! Excellent! ",
    "dn10:2.37.8": "As if he were righting the overturned, or revealing the hidden, or pointing out the path to the lost, or lighting a lamp in the dark so people with clear eyes can see what is there, Master Ānanda has made the teaching clear in many ways. ",
    "dn10:2.37.9": "I go for refuge to Master Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. ",
    "dn10:2.37.10": "From this day forth, may Master Ānanda remember me as a lay follower who has gone for refuge for life.” "
}