{
    "mn107:0.1": "Middle Discourses 107 ",
    "mn107:0.2": "With Moggallāna the Accountant ",
    "mn107:1.1": "Thus have I heard. ",
    "mn107:1.2": "At one time, the Auspicious One was staying near Sāvatthī in the Eastern Monastery, the stilt longhouse of Migāra’s mother. ",
    "mn107:1.3": "Then the brahmin Moggallāna the Accountant approached the Auspicious One, and exchanged pleasantries with him. ",
    "mn107:1.4": "When the amicable and cordial talk was over, he sat down to one side and said to the Auspicious One: ",
    "mn107:2.1": "“Master Gotama, in this stilt longhouse, we can see sequential progress ",
    "mn107:2.2": "down to the last step of the staircase. ",
    "mn107:2.3": "Among the brahmins, we can see sequential progress ",
    "mn107:2.4": "in learning the chants. ",
    "mn107:2.5": "Among archers, we can see sequential progress ",
    "mn107:2.6": "in archery. ",
    "mn107:2.7": "Among us accountants, who earn a living by accounting, we can see sequential progress ",
    "mn107:2.8": "in calculation. ",
    "mn107:2.9": "For when we obtain an apprentice, we first make them count: ",
    "mn107:2.10": "‘One one, two twos, three threes, four fours, five fives, six sixes, seven sevens, eight eights, nine nines, ten tens.’ ",
    "mn107:2.11": "We even make them count up to a hundred. ",
    "mn107:2.12": "Is it possible to similarly describe a sequential training, sequential progress, and sequential practice in this teaching-and-discipline?” ",
    "mn107:3.1": "“It is possible, brahmin. ",
    "mn107:3.2": "Suppose a deft horse trainer were to obtain a fine thoroughbred. First of all, he would accustom it to wearing the bit. ",
    "mn107:3.3": "In the same way, when the Realized One obtains a man for training, he first guides him like this: ",
    "mn107:3.4": "‘Come, bhikkhu, be virtuous.Live restrained by the code of conduct, endowed with proper behavior and a suitable environment. Seeing danger in the slightest fault, train yourself in the training rules.’",
    "mn107:4.1": "When the bhikkhu is virtuous, the Realized One guides him further: ",
    "mn107:4.2": "‘Come, bhikkhu, guard the doors of your faculties. When you see a sight with the eyes, do not grasp at signs and features of it ",
    "mn107:4.3": "on account of which—due to abiding with the eye faculty unrestrained—bad, unbeneficial thoughts of longing and upset would flow in on you. Practice to restrain that; guard the eye faculty and bring about the restraint of the eye faculty.’ ",
    "mn107:4.4": "When you hear a sound with the ear … ",
    "mn107:4.5": "When you smell an odor with the nose … ",
    "mn107:4.6": "When you taste a flavor with the tongue … ",
    "mn107:4.7": "When you touch a touch with the body … ",
    "mn107:4.8": "When you cognize a phenomenon with the mind, do not grasp at signs and features of it ",
    "mn107:4.9": "on account of which—due to abiding with the mental faculty unrestrained—bad, unbeneficial thoughts of longing and upset would flow in on you. Practice to restrain that; guard the mental faculty and bring about the restraint of the mental faculty. ",
    "mn107:5.1": "When the bhikkhu has the doors of his faculties guarded, the Realized One guides him further: ",
    "mn107:5.2": "‘Come, bhikkhu, be moderate in eating. ",
    "mn107:5.3": "Eat with reflection in light of the origin: ",
    "mn107:5.4": "‘Not for entertainment, indulgence, beautification, or adornment, but only to sustain this body, to avoid harm, and to support the renunciate life. In this way, I shall put an end to old discomfort and not give rise to new discomfort, and I shall live blamelessly and at ease.’ ",
    "mn107:6.1": "When the bhikkhu eats in moderation, the Realized One guides him further: ",
    "mn107:6.2": "‘Come, bhikkhu, be committed to vigilance. During the day, cleanse your mind of obstructive states while walking or sitting. During the first watch of the night, cleanse your mind of obstructive states while walking or sitting. During the second watch of the night, you should lie down in the lion’s posture—on the right side, placing one foot on top of the other—recollected and aware, having set the intention to arise. Having arisen in the last watch of the night, continue to cleanse your mind of obstructive states while walking or sitting.’ ",
    "mn107:7.1": "When the bhikkhu is committed to vigilance, the Realized One guides him further: ",
    "mn107:7.2": "‘Come, bhikkhu, be possessed of recollectedness-and-awareness. Act with awareness when going out and returning; when looking ahead and aside; when bending and extending the limbs; when bearing the outer robe, bowl, and robes; when eating, drinking, chewing, and tasting; when urinating and defecating; when walking, standing, sitting, sleeping, waking, speaking, and keeping silent.’ ",
    "mn107:8.1": "When the bhikkhu is possessed of recollectedness-and-awareness, the Realized One guides him further: ",
    "mn107:8.2": "‘Come, bhikkhu, frequent a secluded lodging—a wilderness, the root of a tree, a hill, a ravine, a mountain cave, a charnel ground, a forest, the open air, a heap of straw.’ ",
    "mn107:9.1": "And he does so. ",
    "mn107:9.2": "After the meal, he returns from almsround, sits down cross-legged, sets his body straight, and establishes recollectedness at the fore. ",
    "mn107:9.3": "With the giving up of longing with regard to the world, he abides with a mind rid of longing; he cleanses the mind of longing. ",
    "mn107:9.4": "With the giving up of ill will and hatred, he abides with a mind rid of ill will, compassionate for the welfare of all creatures and beings; he cleanses the mind of ill will and hatred. ",
    "mn107:9.5": "With the giving up of indolence-and-lethargy, he abides with a mind rid of indolence-and-lethargy, perceiving light, recollected, and aware; he cleanses the mind of indolence-and-lethargy. ",
    "mn107:9.6": "With the giving up of restlessness-and-anxiety, he abides without restlessness, his mind internally appeased; he cleanses the mind of restlessness-and-anxiety. ",
    "mn107:9.7": "With the giving up of doubt, he abides having gone beyond doubt, not uncertain about beneficial qualities; he cleanses the mind of doubt. ",
    "mn107:10.1": "He gives up these five hindrances, defilements of the mind that weaken understanding. ",
    "mn107:10.2": "Then, having thoroughly withdrawn from sensuality, having withdrawn from unbeneficial phenomena, with thinking and with pondering, with joy and ease born of withdrawal, he abides having entered upon the first jhāna. ",
    "mn107:10.3": "With the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and ease born of composure, he abides having entered upon second jhāna. ",
    "mn107:10.4": "With the fading of joy, he abides equanimous, recollected, and aware, experiencing ease with the body. He abides having entered upon the third jhāna, with regard to which the noble ones say “one abides equanimous, recollected, and at ease.” ",
    "mn107:10.5": "With the giving up of ease and unease—and with the ending of joys and upsets beforehand—without ease or unease, with purity of equanimity and recollectedness, he abides having entered upon the fourth jhāna. ",
    "mn107:11.1": "That is how I instruct the bhikkhus who are trainees—who have not achieved their goal, but live aspiring to the supreme safety from the yoke. ",
    "mn107:11.2": "But for those bhikkhus who are Arahants—who have destroyed the influxes, fulfilled the training, done what had to be done, laid down the burden, arrived at the highest goal, utterly destroyed the fetters of being, and are liberated by right understanding—these things lead to an easeful abiding in the present experience, and to recollectedness-and-awareness.” ",
    "mn107:12.1": "When he had spoken, Moggallāna the Accountant said to the Auspicious One, ",
    "mn107:12.2": "“When his disciples are instructed and advised like this by Master Gotama, do all of them achieve the ultimate goal, Nibbāna, or do some of them fail?” ",
    "mn107:12.3": "“Some succeed, while others fail.” ",
    "mn107:13.1": "“What is the cause, Master Gotama, what is the reason why, though Nibbāna is available, the path leading to Nibbāna is available, and Master Gotama is present to encourage them, ",
    "mn107:13.2": "still some succeed, while others fail?” ",
    "mn107:14.1": "“Well then, brahmin, I will ask you about this in return, and you can answer as you please. ",
    "mn107:14.2": "What do you think, brahmin? ",
    "mn107:14.3": "Are you skilled in the road to Rājagaha?” ",
    "mn107:14.4": "“Yes, I am.” ",
    "mn107:14.5": "“What do you think, brahmin? ",
    "mn107:14.6": "Suppose a man were to come along who wished to go to Rājagaha. ",
    "mn107:14.7": "He would approach you and say: ",
    "mn107:14.8": "‘Sir, I wish to go to Rājagaha. ",
    "mn107:14.9": "Please point out the road to Rājagaha.’ ",
    "mn107:14.10": "Then you would say to them: ",
    "mn107:14.11": "‘Here, sir, this road goes to Rājagaha. ",
    "mn107:14.12": "Go along it for a while, and you will see a certain village. Go along a while further, and you will see a certain town. ",
    "mn107:14.13": "Go along a while further, and you will see Rājagaha with its delightful parks, woods, meadows, and lotus ponds.’ ",
    "mn107:14.14": "Instructed like this by you, they might still take the wrong road, heading west. ",
    "mn107:14.15": "But a second person might come with the same question and receive the same instructions. ",
    "mn107:14.16": "",
    "mn107:14.17": "",
    "mn107:14.18": "",
    "mn107:14.19": "",
    "mn107:14.20": "",
    "mn107:14.21": "",
    "mn107:14.22": "",
    "mn107:14.23": "",
    "mn107:14.24": "Instructed by you, they might safely arrive at Rājagaha. ",
    "mn107:14.25": "What is the cause, brahmin, what is the reason why, though Rājagaha is available, the path leading to Rājagaha is available, and you are there to encourage them, ",
    "mn107:14.26": "one person takes the wrong path and heads west, while another arrives safely at Rājagaha?” ",
    "mn107:14.27": "“What can I do about that, Master Gotama? ",
    "mn107:14.28": "I am the one who shows the way.” ",
    "mn107:14.29": "“In the same way, though Nibbāna is available, the path leading to Nibbāna is available, and I am present to encourage them, ",
    "mn107:14.30": "still some of my disciples, instructed and advised like this, achieve the ultimate goal, Nibbāna, while some of them fail. ",
    "mn107:14.31": "What can I do about that, brahmin? ",
    "mn107:14.32": "The Realized One is the one who shows the way.” ",
    "mn107:15.1": "When he had spoken, Moggallāna the Accountant said to the Auspicious One, ",
    "mn107:15.2": "“Master Gotama, there are those faithless individuals who went forth from the lay life to homelessness not out of faith but to earn a livelihood. They are devious, deceitful, and furtive. They are restless, insolent, fickle, scurrilous, and garrulous. They do not guard the doors of their faculties or eat in moderation, and they are not committed to vigilance. They lack regard for the ascetic life, and do not diligently respect the training. They are indulgent and lax, leaders in backsliding, neglecting seclusion, lazy, and indolent. They are forgetful, lacking awareness and composure, with distracted minds, devoid of understanding and foolish. Master Gotama does not associate with these. ",
    "mn107:15.3": "But there are those sons of good families who went forth from the lay life to homelessness out of faith. They are not devious, deceitful, and furtive. They are not restless, insolent, fickle, scurrilous, and garrulous. They guard the doors of their faculties and eat in moderation, and they are dedicated to vigilance. They have regard for the ascetic life, and diligently respect the training. They are not indulgent or lax; they neglect backsliding and are leaders in seclusion. They are effortful and resolute. Their recollectedness is established, and they are aware and composed, with unified minds; possessing understanding, not foolish. Master Gotama associates with these. ",
    "mn107:16.1": "Of all kinds of fragrant root, spikenard is said to be the best. ",
    "mn107:16.2": "Of all kinds of fragrant heartwood, red sandalwood is said to be the best. ",
    "mn107:16.3": "Of all kinds of fragrant flower, jasmine is said to be the best. ",
    "mn107:16.4": "In the same way, Master Gotama’s advice is the best of contemporary teachings. ",
    "mn107:17.1": "Excellent, Master Gotama! Excellent! ",
    "mn107:17.2": "As if he were righting the overturned, or revealing the hidden, or pointing out the path to the lost, or lighting a lamp in the dark so people with clear eyes can see what is there, Master Gotama has made the Teaching clear in many ways. ",
    "mn107:17.3": "I go for refuge to Master Gotama, to the Dhamma, and to the bhikkhu Saṅgha. ",
    "mn107:17.4": "From this day forth, may Master Gotama remember me as a lay follower who has gone for refuge for life.” "
}
