{
    "mn11:0.1": "Middle Discourses 11 ",
    "mn11:0.2": "The Shorter Discourse on the Lion’s Roar ",
    "mn11:1.1": "Thus have I heard. ",
    "mn11:1.2": "At one time, the Auspicious One was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
    "mn11:1.3": "There the Auspicious One addressed the bhikkhus, ",
    "mn11:1.4": "“Bhikkhus!” ",
    "mn11:1.5": "“Venerable sir,” they replied. ",
    "mn11:1.6": "The Auspicious One said this: ",
    "mn11:2.1": "“‘Only here is there an ascetic, a second ascetic, a third ascetic, and a fourth ascetic. ",
    "mn11:2.2": "The doctrines of others are devoid of ascetics.’ ",
    "mn11:2.3": "This, bhikkhus, is how you should rightly roar your lion’s roar. ",
    "mn11:3.1": "It is possible that wanderers of other teachings might say: ",
    "mn11:3.2": "‘But what is the source of the venerables’ self-confidence and strength that they say this?’ ",
    "mn11:3.3": " ",
    "mn11:3.4": " ",
    "mn11:3.5": "You should say to them: ",
    "mn11:3.6": "‘There are four things explained by the Auspicious One, who knows and sees, the Arahant, the Rightly Self-Awakened One. Seeing these things in ourselves, we say that: ",
    "mn11:3.7": "“Only here is there an ascetic, a second ascetic, a third ascetic, and a fourth ascetic. ",
    "mn11:3.8": "The doctrines of others are devoid of ascetics.” ",
    "mn11:3.9": "What four? ",
    "mn11:3.10": "We have confidence in the Teacher, we have confidence in the teaching, and we have fulfilled the precepts. ",
    "mn11:3.11": "And those who share our path are dear and agreeable to us, ",
    "mn11:3.12": "both laypeople and renunciates. ",
    "mn11:3.13": "These are the four things explained by the Auspicious One which we see in ourselves.’ ",
    "mn11:3.14": " ",
    "mn11:3.15": " ",
    "mn11:4.1": "It is possible that wanderers of other teachings might say: ",
    "mn11:4.2": "‘We too have confidence in the Teacher—our Teacher; we have confidence in the teaching—our teaching; and we have fulfilled the precepts—our precepts. ",
    "mn11:4.3": "And those who share our path are dear and agreeable to us, ",
    "mn11:4.4": "both laypeople and renunciates. ",
    "mn11:4.5": "What, then, is the difference between you and us?’ ",
    "mn11:5.1": "You should say to them: ",
    "mn11:5.2": "‘Well, venerables, is there one culmination, or are there many?’ ",
    "mn11:5.3": "Answering rightly, the wanderers would say: ",
    "mn11:5.4": "‘There is one culmination, venerables, not many.’ ",
    "mn11:5.5": "‘But is that culmination for the one with passion or the one without passion?’ ",
    "mn11:5.6": "Answering rightly, the wanderers would say: ",
    "mn11:5.7": "‘That culmination is for the one without passion, not for the one with passion.’ ",
    "mn11:5.8": "‘Is it for the one with aversion or the one without aversion?’ ",
    "mn11:5.9": "Answering rightly, the wanderers would say: ",
    "mn11:5.10": "‘It is for the one without aversion.’ ",
    "mn11:5.11": "‘Is it for the one with muddledness or the one without muddledness’ ",
    "mn11:5.12": "Answering rightly, the wanderers would say: ",
    "mn11:5.13": "‘It is for the one without muddledness.’ ",
    "mn11:5.14": "‘Is it for the one with craving or the one without craving?’ ",
    "mn11:5.15": "Answering rightly, the wanderers would say: ",
    "mn11:5.16": "‘It is for the one without craving.’ ",
    "mn11:5.17": "‘Is it for the one with assumption or the one without assumption?’ ",
    "mn11:5.18": "Answering rightly, the wanderers would say: ",
    "mn11:5.19": "‘It is for the one without assumption.’ ",
    "mn11:5.20": "‘Is it for the one with knowledge or the one who is ignorant?’ ",
    "mn11:5.21": "Answering rightly, the wanderers would say: ",
    "mn11:5.22": "‘It is for the one with knowledge.’ ",
    "mn11:5.23": "‘Is it for the one who welcomes and opposes or the one who does not welcome and oppose?’ ",
    "mn11:5.24": "Answering rightly, the wanderers would say: ",
    "mn11:5.25": "‘It is for the one who does not welcome and oppose.’ ",
    "mn11:5.26": "‘Is that culmination for the one who enjoys proliferation or the one who enjoys non-proliferation?’ ",
    "mn11:5.27": "Answering rightly, the wanderers would say: ",
    "mn11:5.28": "‘It is for the one who enjoys non-proliferation, not for the one who enjoys proliferation.’ ",
    "mn11:6.1": "Bhikkhus, there are these two views: ",
    "mn11:6.2": "the view of being and the view of non-being. ",
    "mn11:6.3": "Any ascetics or brahmins whatsoever who adhere to, hold to, and rest upon on the view of being will oppose the view of non-being. ",
    "mn11:6.4": "Any ascetics or brahmins whatsoever who adhere to, hold to, and rest upon the view of non-being will oppose the view of being. ",
    "mn11:7.1": "Any ascetics and brahmins whatsoever who do not understand as it is these two views’ origin, ending, gratification, peril, and escape—I say that they are with passion, aversion, muddledness, craving, assumption, and are ignorant. They welcome and oppose, and they enjoy proliferation. ",
    "mn11:7.2": "They are not liberated from birth, old age, and death, from sorrow, lamentation, displeasure, sadness, and distress; ",
    "mn11:7.3": "they are not liberated from suffering. ",
    "mn11:8.1": "Any ascetics and brahmins who do understand as they are these two views’ origin, ending, gratification, peril, and escape—I say that they are free from passion, aversion, muddledness, craving, assumption, and are endowed with knowledge. They do not welcome and oppose, and they enjoy non-proliferation. ",
    "mn11:8.2": "They are liberated from birth, old age, and death, from sorrow, lamentation, displeasure, sadness, and distress; ",
    "mn11:8.3": "they are liberated from suffering. ",
    "mn11:9.1": "Bhikkhus, there are these four assumptions. ",
    "mn11:9.2": "What four? ",
    "mn11:9.3": "The assumption of sensuality, the assumption of views, the assumption of virtue-and-duty, and the assumption of a view of self. ",
    "mn11:10.1": "There are some ascetics and brahmins who claim to propound the complete understanding of all assumption. ",
    "mn11:10.2": "But they do not rightly describe the complete understanding of all assumption. ",
    "mn11:10.3": "They describe the complete understanding of the assumption of sensuality, but not of the assumption of views, the assumption of virtue-and-duty, or the assumption of a view of self. ",
    "mn11:10.4": "Why is that? ",
    "mn11:10.5": "Because they do not understand these three things as they are. ",
    "mn11:10.6": "That is why they claim to propound the complete understanding of all assumption, ",
    "mn11:10.7": "but in reality, they do not. ",
    "mn11:10.8": " ",
    "mn11:11.1": "There are some other ascetics and brahmins who claim to propound the complete understanding of all assumption, ",
    "mn11:11.2": "but in reality, they do not. ",
    "mn11:11.3": "They describe the complete understanding of assumption of sensuality and the assumption of views, but not of the assumption of virtue-and-duty, nor the assumption of a view of self. ",
    "mn11:11.4": "Why is that? ",
    "mn11:11.5": "Because they do not understand these two things as they are. ",
    "mn11:11.6": "That is why they claim to propound the complete understanding of all assumption, ",
    "mn11:11.7": "but in reality, they do not. ",
    "mn11:11.8": " ",
    "mn11:12.1": "There are some other ascetics and brahmins who claim to propound the complete understanding of all assumption, ",
    "mn11:12.2": "but in reality, they do not. ",
    "mn11:12.3": "They describe the complete understanding of assumption of sensuality, the assumption of views, and the assumption of virtue-and-duty, but not of the assumption of a view of self. ",
    "mn11:12.4": "Why is that? ",
    "mn11:12.5": "Because they do not understand this one thing as it is. ",
    "mn11:12.6": "That is why they claim to propound the complete understanding of all assumption, ",
    "mn11:12.7": "but in reality, they do not. ",
    "mn11:12.8": " ",
    "mn11:13.1": "Bhikkhus, it is evident that in such a teaching-and-discipline, confidence in the teacher is not rightly directed, ",
    "mn11:13.2": "confidence in the teaching is not rightly directed, ",
    "mn11:13.3": "fulfillment of the precepts is not rightly directed, ",
    "mn11:13.4": "and finding those sharing the same path dear and agreeable is not rightly directed. ",
    "mn11:13.5": "Why is that? ",
    "mn11:13.6": "Because that teaching-and-discipline is wrongly explained and wrongly propounded, not emancipating, not leading to peace, proclaimed by someone who is not a Rightly Self-Awakened One. ",
    "mn11:14.1": "Bhikkhus, The Realized One, the Arahant, the Rightly Self-Awakened One, claiming to propound the complete understanding of all assumption, rightly describes the complete understanding of all assumption. ",
    "mn11:14.2": "He describes the complete understanding of the assumption of sensuality, the assumption of views, the assumption of virtue-and-duty, and the assumption of a view of self. ",
    "mn11:15.1": "Bhikkhus, it is evident that in such a teaching-and-discipline, confidence in the Teacher is rightly directed, ",
    "mn11:15.2": "confidence in the teaching is rightly directed, ",
    "mn11:15.3": "fulfillment of the precepts is rightly directed, ",
    "mn11:15.4": "and finding those sharing the same path dear and agreeable is rightly directed. ",
    "mn11:15.5": "Why is that? ",
    "mn11:15.6": "It is because that teaching-and-discipline is well explained and well propounded, emancipating, leading to peace, proclaimed by a Rightly Self-Awakened One. ",
    "mn11:16.1": "Now, bhikkhus, what is the foundation, origin, birthplace, and source of these four assumptions? ",
    "mn11:16.2": "The foundation, origin, birthplace, and source of these four assumptions is craving. ",
    "mn11:16.3": "And what is the foundation, origin, birthplace, and source of craving? ",
    "mn11:16.4": "The foundation, origin, birthplace, and source of craving is feeling… ",
    "mn11:16.5": "And what is the foundation … of feeling? ",
    "mn11:16.6": "Pressure. ",
    "mn11:16.7": "And what is the foundation … of pressure? ",
    "mn11:16.8": "The six sense fields. ",
    "mn11:16.9": "And what is the foundation … of the six sense fields? ",
    "mn11:16.10": "Name-and-form. ",
    "mn11:16.11": "And what is the foundation … of name-and-form? ",
    "mn11:16.12": "Consciousness. ",
    "mn11:16.13": "And what is the foundation … of consciousness? ",
    "mn11:16.14": "Activities. ",
    "mn11:16.15": "And what is the foundation, origin, birthplace, and source of activations? ",
    "mn11:16.16": "Ignorance. ",
    "mn11:17.1": "When for a bhikkhu ignorance has been abandoned and knowledge has arisen, he does not assume the assumption of sensuality, the assumption of views, the assumption of virtue-and-duty, or the assumption of a view of self. ",
    "mn11:17.2": "Not assuming, he is not perturbed; not being perturbed, he is personally quenched. ",
    "mn11:17.3": "He understands: ‘Birth is destroyed, the renunciate life has been lived, what had to be done has been done, there will be no more of this.’” ",
    "mn11:17.4": "That is what the Auspicious One said. ",
    "mn11:17.5": "Pleased, the bhikkhus delighted in what the Auspicious One said. "
}