{
  "mn19:0.1": "Middle Discourses 19 ",
  "mn19:0.2": "Two Kinds of Thought ",
  "mn19:1.1": "So I have heard. ",
  "mn19:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
  "mn19:1.3": "There the Buddha addressed the bhikkhus, ",
  "mn19:1.4": "“Bhikkhus!” ",
  "mn19:1.5": "“Bhante,” they replied. ",
  "mn19:1.6": "The Buddha said this: ",
  "mn19:2.1": "“Bhikkhus, before my awakening, when I was still unawakened but intent on awakening, I thought: ",
  "mn19:2.2": "‘Why don’t I abide having divided my thoughts into two categories?’ ",
  "mn19:2.3": "So I assigned sensual, averse, and cruel thoughts ",
  "mn19:2.4": "to one class. ",
  "mn19:2.5": "And I assigned non-sensual, non-averse, and non-cruel thoughts ",
  "mn19:2.6": "to the second class. ",
  "mn19:3.1": "Then, as I abided heedful, diligent, and resolute, a sensual thought arose. ",
  "mn19:3.2": "I understood: ",
  "mn19:3.3": "‘This sensual thought has arisen for me. ",
  "mn19:3.4": "It leads to my affliction, to the affliction of others, and to the affliction of both. It blocks understanding, is bound with trouble, and it doesn’t lead to Nibbāna.’ ",
  "mn19:3.5": "When I considered that it leads to my affliction, it subsided. ",
  "mn19:3.6": "When I considered that it leads to the affliction of others, it subsided. ",
  "mn19:3.7": "When I considered that it leads to the affliction of both, it subsided. ",
  "mn19:3.8": "When I considered that it blocks understanding, is bound with trouble, and doesn’t lead to Nibbāna, it subsided. ",
  "mn19:3.9": "So I gave up, drove out, and put an end to any sensual thoughts that arose. ",
  "mn19:4-5.1": "Then, as I abided heedful, diligent, and resolute, an averse thought arose … ",
  "mn19:4-5.2": "a cruel thought arose. ",
  "mn19:4-5.3": "I understood: ",
  "mn19:4-5.4": "‘This cruel thought has arisen for me. ",
  "mn19:4-5.5": "It leads to my affliction, the affliction of others, and to the affliction of both. It blocks understanding, it’s bound with trouble, and it doesn’t lead to Nibbāna.’ ",
  "mn19:4-5.6": "When I considered that it leads to my affliction … ",
  "mn19:4-5.7": "the affliction of others … ",
  "mn19:4-5.8": "to the affliction of both, it subsided. ",
  "mn19:4-5.9": "When I considered that it blocks understanding, is bound with trouble, and doesn’t lead to Nibbāna, it subsided. ",
  "mn19:4-5.10": "So I gave up, drove out, and put an end to any cruel thought that arose. ",
  "mn19:6.1": "Whatever a bhikkhu frequently thinks and ponders along with is what his mind inclines to. ",
  "mn19:6.2": "If he often thinks and ponders along with sensual thoughts, he’s given up non-sensual thoughts to cultivate sensual thoughts. His mind inclines to sensual thoughts. ",
  "mn19:6.3": "If he often thinks and ponders along with averse thoughts … his mind inclines to averse thoughts. ",
  "mn19:6.4": "If he often thinks and ponders along with cruel thoughts … his mind inclines to cruel thoughts. ",
  "mn19:7.1": "Suppose it’s the last month of the rainy season, when the crops grow closely together, and a cowherd must take care of the cattle. ",
  "mn19:7.2": "He would tap and poke them with his staff on this side and that to keep them in check. ",
  "mn19:7.3": "Why is that? ",
  "mn19:7.4": "For he sees that if they wander into the crops he could be executed, imprisoned, fined, or condemned. ",
  "mn19:7.5": "In the same way, I saw the peril, inferiority, and defilement of unbeneficial qualities, and in beneficial qualities I saw the value and cleansing aspect of non-sensuality. ",
  "mn19:8.1": "Then, as I abided heedful, diligent, and resolute, a non-sensual thought arose. ",
  "mn19:8.2": "I understood: ",
  "mn19:8.3": "‘This non-sensual thought has arisen for me. ",
  "mn19:8.4": "It doesn’t lead to my affliction, the affliction of others, or to the affliction of both. It nourishes understanding, is not bound with trouble, and leads to Nibbāna.’ ",
  "mn19:8.5": "If I were to keep on thinking and pondering along with this all night … ",
  "mn19:8.6": "all day … ",
  "mn19:8.7": "all night and day, I see no danger that would come from that. ",
  "mn19:8.8": "Still, thinking and pondering along with it for too long would tire my body. ",
  "mn19:8.9": "And when the body is tired, the mind is bothered. ",
  "mn19:8.10": "And when the mind is bothered, it’s far from composure. ",
  "mn19:8.11": "So I established, settled, unified, and composed my mind internally. ",
  "mn19:8.12": "Why is that? ",
  "mn19:8.13": "So that my mind would not be bothered. ",
  "mn19:9-10.1": "Then, as I abided heedful, diligent, and resolute, a non-averse thought arose … ",
  "mn19:9-10.2": "a non-cruel thought arose. ",
  "mn19:9-10.3": "I understood: ",
  "mn19:9-10.4": "‘This non-cruel thought has arisen for me. ",
  "mn19:9-10.5": "It doesn’t lead to my affliction, the affliction of others, or to the affliction of both. It nourishes understanding, is not bound with trouble, and leads to Nibbāna.’ ",
  "mn19:9-10.6": "If I were to keep on thinking and pondering along with this all night … ",
  "mn19:9-10.7": "all day … ",
  "mn19:9-10.8": "all night and day, I see no danger that would come from that. ",
  "mn19:9-10.9": "Still, thinking and pondering along with it for too long would tire my body. ",
  "mn19:9-10.10": "And when the body is tired, the mind is bothered. ",
  "mn19:9-10.11": "And when the mind is bothered, it’s far from composure. ",
  "mn19:9-10.12": "So I established, settled, unified, and composed my mind internally. ",
  "mn19:9-10.13": "Why is that? ",
  "mn19:9-10.14": "So that my mind would not be bothered. ",
  "mn19:11.1": "Whatever a bhikkhu frequently thinks and ponders along with is what his mind inclines to. ",
  "mn19:11.2": "If he often thinks and ponders along with non-sensual thoughts, he’s given up sensual thoughts to cultivate non-sensual thoughts. His mind inclines to non-sensual thoughts. ",
  "mn19:11.3": "If he often thinks and ponders along with non-averse thoughts … his mind inclines to non-averse thoughts. ",
  "mn19:11.4": "If he often thinks and ponders along with non-cruel thoughts … his mind inclines to non-cruel thoughts. ",
  "mn19:12.1": "Suppose it’s the last month of summer, when all the crops have been gathered within a village, and a cowherd must take care of the cattle. While at the root of a tree or in the open, he need only remember that ",
  "mn19:12.2": "the cattle are there. ",
  "mn19:12.3": "In the same way, I needed only to remember that ",
  "mn19:12.4": "those phenomena were there. ",
  "mn19:13.1": "My effort was roused up and steadfast, my recollection was established and lucid, my body was calm and unperturbed, and my mind was composed and collected. ",
  "mn19:14.1": "Quite disjoined from sensuality, disjoined from unbeneficial phenomena, with thinking and with pondering, with joy and ease born of separation, I abided having entered upon the first jhāna. ",
  "mn19:15.1": "With the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and ease born of composure, I abided having entered upon the second jhāna. ",
  "mn19:16.1": "With the fading of joy, I abided equanimous, recollected and aware, experiencing ease with the body. I abided having entered upon the third jhāna, with regard to which the noble ones say “one abides equanimous, recollected, and at ease.” ",
  "mn19:17.1": "With the giving up of ease and unease—and with the ending of joys and upsets beforehand—without ease or unease, with purity of equanimity and recollection, I abided having entered upon the fourth jhāna. ",
  "mn19:18.1": "When my mind had become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—I extended it towards the knowledge of recollection of past lives. ",
  "mn19:18.2": "I recollected many kinds of past lives, with features and details. ",
  "mn19:19.1": "This was the first knowledge, which I achieved in the first watch of the night. ",
  "mn19:19.2": "Ignorance was destroyed and knowledge arose; darkness was destroyed and light arose, as happens for one who lives heedful, diligent, and resolute. ",
  "mn19:20.1": "When my mind had become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—I extended it towards the knowledge of the passing away and reappearance of beings. ",
  "mn19:20.2": "With the divine eye that is purified and superhuman, I saw beings passing away and reappearing, inferior and superior, beautiful and ugly, in a good place or a bad place. I understood how beings reappear according to their actions. ",
  "mn19:21.1": "This was the second knowledge, which I achieved in the middle watch of the night. ",
  "mn19:21.2": "Ignorance was destroyed and knowledge arose; darkness was destroyed and light arose, as happens for one who lives heedful, diligent, and resolute. ",
  "mn19:22.1": "When my mind had become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—I extended it towards the knowledge of the destruction of the influxes. ",
  "mn19:22.2": "I understood as it is: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering.' ",
  "mn19:23.1": "I understood as it is: ‘These are influxes’ … ‘This is the origin of influxes’ … ‘This is the cessation of influxes’ … ‘This is the practice that leads to the cessation of influxes.' ",
  "mn19:23.2": "Knowing and seeing like this, my mind was liberated from the influxes of sensuality, being, and ignorance. Being liberated, there was the knowledge, “it’s liberated.”",
  "mn19:23.3": "I understood: ‘Birth is destroyed; the renunciate life has been lived; what had to be done has been done; there will be no more of this.’ ",
  "mn19:24.1": "This was the third knowledge, which I achieved in the last watch of the night. ",
  "mn19:24.2": "Ignorance was destroyed and knowledge arose; darkness was destroyed and light arose, as happens for one who lives heedful, diligent, and resolute. ",
  "mn19:25.1": "Suppose that in a forested wilderness, there was an expanse of low-lying marshes, ",
  "mn19:25.2": "and a large herd of deer lived nearby. ",
  "mn19:25.3": "Then along came a man who wanted to harm, injure, and threaten them. ",
  "mn19:25.4": "He would close off the safe, secure path that leads to happiness, and open the wrong path. There he would plant domesticated male and female deer as decoys ",
  "mn19:25.5": "so that, in due course, that herd of deer would fall to ruin and disaster. ",
  "mn19:25.6": "Now, bhikkhus, suppose a man comes along who wishes for the benefit, welfare and safety of the herd of deer. ",
  "mn19:25.7": "He would open up the safe, secure path that leads to happiness, and close off the wrong path. He would get rid of the decoys ",
  "mn19:25.8": "so that, in due course, that herd of deer would grow, increase, and mature. ",
  "mn19:26.1": "I’ve devised this simile to make a point. ",
  "mn19:26.2": "And this is what it means: ",
  "mn19:26.3": "‘An expanse of low-lying marshes’ is a term for sensuality. ",
  "mn19:26.4": "‘A large herd of deer’ is a term for beings. ",
  "mn19:26.5": "‘A man who wants to harm, injure, and threaten them’ is a term for Māra the Wicked. ",
  "mn19:26.6": "‘The wrong path’ is a term for the wrong eightfold path, that is, ",
  "mn19:26.7": "wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong recollection, and wrong composure. ",
  "mn19:26.8": "‘A domesticated male deer’ is a term for delight-and-passion. ",
  "mn19:26.9": "‘A domesticated female deer’ is a term for ignorance. ",
  "mn19:26.10": "‘A man who wants to help keep the herd of deer safe’ is a term for the Realized One, the Arahant, the fully awakened Buddha. ",
  "mn19:26.11": "‘The safe, secure path that leads to happiness’ is a term for the Noble Eightfold Path, that is: ",
  "mn19:26.12": "right view, right intention, right speech, right action, right livelihood, right effort, right recollection, and right composure. ",
  "mn19:26.13": "So, bhikkhus, I have opened up the safe, secure path to happiness and closed off the wrong path. And I have gotten rid of the male and female decoys. ",
  "mn19:27.1": "Out of compassion, I’ve done what a teacher should do who wants what’s best for his disciples. ",
  "mn19:27.2": "Here are these roots of trees, and here are these empty huts. Develop jhāna, bhikkhus! Don’t be careless! Don’t regret it later! This is my instruction to you.” ",
  "mn19:27.3": "That is what the Buddha said. ",
  "mn19:27.4": "Pleased, the bhikkhus delighted in what the Buddha said. "
}