{
    "mn21:0.1": "Middle Discourses 21 ",
    "mn21:0.2": "The Simile of the Saw ",
    "mn21:1.1": "Thus have I heard. ",
    "mn21:1.2": "At one time the Auspicious One was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
    "mn21:2.1": "Now at that time, Venerable Phagguna of the Top-Knot was excessively mingling with some nuns. ",
    "mn21:2.2": "So much so that ",
    "mn21:2.3": "if any bhikkhu criticized those nuns in his presence, Venerable Phagguna of the Top-Knot became angry and displeased, and even instigated disciplinary proceedings. ",
    "mn21:2.4": "And if any bhikkhu criticized Venerable Phagguna of the Top-Knot in their presence, those nuns became angry and displeased, and even instigated disciplinary proceedings. ",
    "mn21:2.5": "That is how close Venerable Phagguna of the Top-Knot was with those nuns. ",
    "mn21:3.1": "Then a bhikkhu approached the Auspicious One, bowed, sat down to one side, and informed him of the matter. ",
    "mn21:3.2": " ",
    "mn21:3.3": " ",
    "mn21:3.4": " ",
    "mn21:3.5": " ",
    "mn21:3.6": " ",
    "mn21:4.1": "So the Auspicious One addressed one of the bhikkhus, ",
    "mn21:4.2": "“Please, bhikkhu, in my name tell the bhikkhu Phagguna of the Top-Knot that ",
    "mn21:4.3": "the teacher summons him.” ",
    "mn21:4.4": "“Yes, venerable sir,” that bhikkhu replied. He went to Venerable Phagguna of the Top-Knot and said to him, ",
    "mn21:4.5": "“Venerable Phagguna, the teacher summons you.” ",
    "mn21:4.6": "“Yes, venerable,” Venerable Phagguna replied. He went to the Auspicious One, bowed, and sat down to one side. The Auspicious One said to him: ",
    "mn21:5.1": "“Is it really true, Phagguna, that you have been excessively mingling with some nuns? ",
    "mn21:5.2": "So much so that ",
    "mn21:5.3": "if any bhikkhu criticizes those nuns in your presence, you become angry and displeased, and even instigate disciplinary proceedings? ",
    "mn21:5.4": "And if any bhikkhu criticizes you in those nuns’ presence, they become angry and displeased, and even instigate disciplinary proceedings? ",
    "mn21:5.5": "Is that how close you have become with those nuns?” ",
    "mn21:5.6": "“Yes, venerable sir.” ",
    "mn21:5.7": "“Phagguna, are you not a clansman who has gone forth from the lay life to homelessness?” ",
    "mn21:5.8": "“Yes, venerable sir.” ",
    "mn21:6.1": "“As such, it is not appropriate for you to be excessively mingling with nuns. ",
    "mn21:6.2": "So if anyone criticizes those nuns in your presence, you should give up any worldly desires and thoughts. ",
    "mn21:6.3": "Even in that case, you should train like this: ",
    "mn21:6.4": "‘My mind will be unaffected, and I will utter no hateful words. I will remain compassionate for [the criticizer’s] welfare with a mind of friendliness and no inner hate.’ ",
    "mn21:6.5": "That is how you should train. ",
    "mn21:6.6": "So even if someone strikes those nuns with fists, stones, rods, and swords in your presence, you should give up any worldly desires and thoughts. ",
    "mn21:6.7": "Even in that case, you should train like this: ",
    "mn21:6.8": "‘My mind will be unaffected, and I will utter no hateful words. I will remain compassionate for [the attacker’s] welfare with a mind of friendliness and no inner hate.’ ",
    "mn21:6.9": "That is how you should train. ",
    "mn21:6.10": "So, even if someone criticizes you in your presence, you should give up any worldly desires and thoughts. ",
    "mn21:6.11": "Even in that case, you should train like this: ‘My mind will be unaffected, and I will utter no hateful words. I will remain compassionate for [the criticizer’s] welfare, with a mind of friendliness and no inner hate.’ ",
    "mn21:6.12": "That is how you should train. ",
    "mn21:6.13": "Phagguna, even if someone strikes you with fists, stones, rods, and swords, you should give up any worldly desires and thoughts. ",
    "mn21:6.14": "Even in that case, you should train like this: ‘My mind will be unaffected, and I will utter no hateful words. I will remain compassionate for [the attacker’s] welfare, with a mind of friendliness and no inner hate.’ ",
    "mn21:6.15": "That is how you should train.” ",
    "mn21:7.1": "Then the Auspicious One said to the bhikkhus: ",
    "mn21:7.2": "“Bhikkhus, I used to be pleased with the bhikkhus. ",
    "mn21:7.3": "Once, I addressed them: ",
    "mn21:7.4": "‘I eat my food in one sitting per day. ",
    "mn21:7.5": "Doing so, I find that I am healthy and well, nimble, strong, and living comfortably. ",
    "mn21:7.6": "You too should eat your food in one sitting per day. ",
    "mn21:7.7": "Doing so, you will find that you are healthy and well, nimble, strong, and living comfortably.’ ",
    "mn21:7.8": "I did not have to keep on instructing those bhikkhus; ",
    "mn21:7.9": "I just had to prompt their recollectedness. ",
    "mn21:7.10": "Suppose a chariot stood harnessed to thoroughbreds at a level crossroads, with a goad ready. ",
    "mn21:7.11": "Then a skilled horse trainer, a master charioteer, might mount the chariot, taking the reins in his right hand and goad in the left. He would drive out and back wherever he wishes, whenever he wishes. ",
    "mn21:7.12": "In the same way, I did not have to keep on instructing those bhikkhus; ",
    "mn21:7.13": "I just had to prompt their recollectedness. ",
    "mn21:7.14": "So, bhikkhus, you too should give up what is unbeneficial and devote yourselves to beneficial qualities. ",
    "mn21:7.15": "In this way you will achieve growth, improvement, and maturity in this teaching-and-discipline. ",
    "mn21:8.1": "Suppose that not far from a town or village there was a large grove of sal trees ",
    "mn21:8.2": "that was choked with castor-oil weeds. ",
    "mn21:8.3": "Then along comes a man who wants to help protect and nurture that grove. ",
    "mn21:8.4": "He would cut down the crooked sal saplings that were robbing the sap, and throw them out. He would clean up the interior of the grove, ",
    "mn21:8.5": "and properly care for the straight, well-formed sal saplings. ",
    "mn21:8.6": "In this way, in due course, that sal grove would grow, increase, and mature. ",
    "mn21:8.7": "In the same way, bhikkhus, you too should give up what is unbeneficial and devote yourselves to beneficial qualities. ",
    "mn21:8.8": "In this way you will achieve growth, improvement, and maturity in this teaching-and-discipline. ",
    "mn21:9.1": "Once upon a time, bhikkhus, right here in Sāvatthī there was a housewife named Vedehikā. ",
    "mn21:9.2": "She had this good reputation: ",
    "mn21:9.3": "‘The housewife Vedehikā is gentle, even-tempered, and calm.’ ",
    "mn21:9.4": "Now, Vedehikā had a slave named Kāḷī who was skilled, tireless, and well-organized in her work. ",
    "mn21:9.5": "Then Kāḷī thought, ",
    "mn21:9.6": "‘My mistress has a good reputation as being ",
    "mn21:9.7": "gentle, even-tempered, and calm. ",
    "mn21:9.8": "But does she actually have anger in her and just not show it? Or does she have no anger? ",
    "mn21:9.9": "Or is it just because my work is well-organized that she does not show anger, even though she still has it inside? ",
    "mn21:9.10": "Why don’t I test my mistress?’ ",
    "mn21:9.11": "So Kāḷī got up during the day. ",
    "mn21:9.12": "Vedehikā said to her, ",
    "mn21:9.13": "‘Kāḷī, you wench!’ ",
    "mn21:9.14": "‘What is it, ma’am?’ ",
    "mn21:9.15": "‘Why are you getting up in the day, wench?’ ",
    "mn21:9.16": "‘It is nothing, ma’am.’ ",
    "mn21:9.17": "‘Oh, so it is nothing, you awful slave, but you get up in the day!’ Angry and displeased, she scowled. ",
    "mn21:9.18": "Then Kāḷī thought, ",
    "mn21:9.19": "‘My mistress actually has anger in her and just does not show it; it is not that she has no anger. ",
    "mn21:9.20": "It is just because my work is well-organized that she does not show anger, even though she still has it inside. ",
    "mn21:9.21": "Why don’t I test my mistress further?’ ",
    "mn21:9.22": "So Kāḷī got up later in the day. ",
    "mn21:9.23": "Vedehikā said to her, ",
    "mn21:9.24": "‘Kāḷī, you wench!’ ",
    "mn21:9.25": "‘What is it, ma’am?’ ",
    "mn21:9.26": "‘Why are you getting up [even] later in the day, wench?’ ",
    "mn21:9.27": "‘It is nothing, ma’am.’ ",
    "mn21:9.28": "‘Oh, so it is nothing, you awful slave, but you get up [even] later in the day!’ Angry and displeased, she uttered words of displeasure. ",
    "mn21:9.29": "Then Kāḷī thought, ",
    "mn21:9.30": "‘My mistress actually has anger in her and just does not show it; it is not that she has no anger. ",
    "mn21:9.31": "It is just because my work is well-organized that she does not show anger, even though she still has it inside. ",
    "mn21:9.32": "Why don’t I test my mistress further?’ ",
    "mn21:9.33": "So Kāḷī got up even later in the day. ",
    "mn21:9.34": "Vedehikā said to her, ",
    "mn21:9.35": "‘Kāḷī, you wench!’ ",
    "mn21:9.36": "‘What is it, ma’am?’ ",
    "mn21:9.37": "‘Why are you getting up [even] later in the day, wench?’ ",
    "mn21:9.38": "‘It is nothing, ma’am.’ ",
    "mn21:9.39": "‘Oh, so it is nothing, you awful slave, but you get up [even] later in the day!’ Angry and displeased, she grabbed a bolt-pin and hit Kāḷī on the head, cracking it open. ",
    "mn21:9.40": "Then Kāḷī, with blood pouring from her cracked skull, denounced her mistress to the neighbors, ",
    "mn21:9.41": "‘See, ladies, what the gentle one did! ",
    "mn21:9.42": "See what the even-tempered one did! See what the calm one did! ",
    "mn21:9.43": "How in the world can she grab a bolt-pin and hit her only slave on the head, cracking it open, just for getting up late?’ ",
    "mn21:9.44": "Then, after some time, the housewife Vedehikā got this bad reputation: ",
    "mn21:9.45": "‘The housewife Vedehikā is fierce, ill-tempered, and not calm.’ ",
    "mn21:10.1": "In the same way, a bhikkhu may be the gentlest of the gentle, the most even-tempered of the even-tempered, the calmest of the calm, so long as he is not touched by disagreeable speech. ",
    "mn21:10.2": "But it is when he is touched by disagreeable speech that it can be known whether he is gentle, even-tempered, and calm. ",
    "mn21:10.3": "I do not say that a bhikkhu is easy to admonish if he makes himself easy to admonish only for the sake of robes, almsfood, lodgings, and medicines and supplies for the sick. ",
    "mn21:10.4": "Why is that? ",
    "mn21:10.5": "Because when he does not get robes, almsfood, lodgings, and medicines and supplies for the sick, he is no longer easy to admonish. ",
    "mn21:10.6": "But when a bhikkhu is easy to admonish purely because he honors, respects, reveres, worships, and venerates the Dhamma, then I say that he is easy to admonish. ",
    "mn21:10.7": "So, bhikkhus, you should train yourselves: ‘We will be easy to admonish purely because we honor, respect, revere, worship, and venerate the Dhamma.’ ",
    "mn21:10.8": "That is how you should train. ",
    "mn21:11.1": "Bhikkhus, there are these five modes of speech with which others might address you: ",
    "mn21:11.2": "Timely or untimely, ",
    "mn21:11.3": "factual or false, ",
    "mn21:11.4": "gentle or harsh, ",
    "mn21:11.5": "beneficial or unbeneficial, ",
    "mn21:11.6": "from a mind of friendliness or with inner hate. ",
    "mn21:11.7": "When others address you, they may do so in a timely or untimely manner, ",
    "mn21:11.8": "in a factual or false manner, ",
    "mn21:11.9": "in a gentle or harsh manner, ",
    "mn21:11.10": "in a beneficial or unbeneficial manner, ",
    "mn21:11.11": "and from a mind of friendliness or with inner hate. ",
    "mn21:11.12": "Even in that case, you should train like this: ",
    "mn21:11.13": "‘Our minds will remain unaffected, and we will utter no hateful words. We will remain compassionate for [the other’s] welfare, with a mind of friendliness and no inner hate. ",
    "mn21:11.14": "We will abide having pervaded that individual with a mind of friendliness. And with him as a basis, we will abide having pervaded the whole world with a mind of friendliness—abundant, expansive, immeasurable, free of enmity and ill will.’ ",
    "mn21:11.15": "That is how you should train. ",
    "mn21:12.1": "Suppose a man were to come along carrying a spade and basket ",
    "mn21:12.2": "and say, ",
    "mn21:12.3": "‘I shall make this great earth be without earth!’ ",
    "mn21:12.4": "And he would dig all over, scatter all over, spit all over, and urinate all over, saying, ",
    "mn21:12.5": "‘Be without earth! Be without earth!’ ",
    "mn21:12.6": "What do you think, bhikkhus? ",
    "mn21:12.7": "Could that man make this great earth be without earth?” ",
    "mn21:12.8": "“No, venerable sir. ",
    "mn21:12.9": "Why is that? ",
    "mn21:12.10": "Because this great earth is deep and immeasurable. ",
    "mn21:12.11": "It is not easy to make it be without earth. ",
    "mn21:12.12": "That man will eventually get weary and frustrated.” ",
    "mn21:13.1": "“In the same way, bhikkhus, there are these five modes of speech with which others might address you: ",
    "mn21:13.2": "Timely or untimely, ",
    "mn21:13.3": "factual or false, ",
    "mn21:13.4": "gentle or harsh, ",
    "mn21:13.5": "beneficial or unbeneficial, ",
    "mn21:13.6": "from a mind of friendliness or with inner hate. ",
    "mn21:13.7": "When others criticize you, they may do so in a timely or untimely manner … ",
    "mn21:13.8": " ",
    "mn21:13.9": " ",
    "mn21:13.10": " ",
    "mn21:13.11": "and from a mind of friendliness or with inner hate. ",
    "mn21:13.12": "Even then, you should train like this: ",
    "mn21:13.13": "‘Our minds will remain unaffected, and we will utter no hateful words. We will remain compassionate for [the other’s] welfare, with a mind of friendliness and no inner hate. ",
    "mn21:13.14": "We will abide having pervaded that individual with a mind of friendliness. And with him as a basis, we will abide having pervaded the whole world with a mind of friendliness—abundant, expansive, immeasurable, free of enmity and ill will.’ ",
    "mn21:13.15": "That is how you should train. ",
    "mn21:14.1": "Suppose a man was to come along with dye such as red lac, turmeric, indigo, or rose madder, ",
    "mn21:14.2": "and say, ",
    "mn21:14.3": "‘I shall draw pictures in space, making pictures appear there.’ ",
    "mn21:14.4": "What do you think, bhikkhus? ",
    "mn21:14.5": "Could that man draw pictures in space?” ",
    "mn21:14.6": "“No, venerable sir. ",
    "mn21:14.7": "Why is that? ",
    "mn21:14.8": "Because space has no form or appearance. ",
    "mn21:14.9": "It is not easy to draw pictures there. ",
    "mn21:14.10": "That man will eventually become weary and frustrated.” ",
    "mn21:15.1": "“In the same way, there are these five modes of speech with which others might address you … you should train like this: ",
    "mn21:15.2": "‘… we will abide having pervaded the whole world with a mind of friendliness—abundant, expansive, immeasurable, free of enmity and ill will.’ ",
    "mn21:15.3": "That is how you should train. ",
    "mn21:16.1": "Suppose a man was to come along carrying a blazing grass torch, ",
    "mn21:16.2": "and say, ",
    "mn21:16.3": "‘I shall burn and scorch the river Ganges with this blazing grass torch.’ ",
    "mn21:16.4": "What do you think, bhikkhus? ",
    "mn21:16.5": "Could that man burn and scorch the river Ganges with a blazing grass torch?” ",
    "mn21:16.6": "“No, venerable sir. ",
    "mn21:16.7": "Why is that? ",
    "mn21:16.8": "Because the river Ganges is deep and immeasurable. ",
    "mn21:16.9": "It is not easy to burn and scorch it with a blazing grass torch. ",
    "mn21:16.10": "That man will eventually become weary and frustrated.” ",
    "mn21:17.1": "“In the same way, there are these five aspects of speech … you should train like this: ",
    "mn21:17.2": "‘… we will abide having pervaded the whole world with a mind of friendliness—abundant, expansive, immeasurable, free of enmity and ill will.’ ",
    "mn21:17.3": "That is how you should train. ",
    "mn21:18.1": "Suppose there was a catskin bag that was rubbed, well-rubbed, very well-rubbed—soft, silky, rid of rustling and crackling. ",
    "mn21:18.2": "Then a man comes along carrying a stick or a stone, ",
    "mn21:18.3": "and says, ",
    "mn21:18.4": "‘I shall make this soft catskin bag rustle and crackle with this stick or stone.’ ",
    "mn21:18.5": "What do you think, bhikkhus? ",
    "mn21:18.6": "Could that man make that soft catskin bag rustle and crackle with that stick or stone?” ",
    "mn21:18.7": "“No, venerable sir. ",
    "mn21:18.8": "Why is that? ",
    "mn21:18.9": "Because that catskin bag is rubbed, well-rubbed, very well-rubbed, soft, silky, rid of rustling and crackling. ",
    "mn21:18.10": "It is not easy to make it rustle or crackle with a stick or stone. ",
    "mn21:18.11": "That man will eventually become weary and frustrated.” ",
    "mn21:19.1": "“In the same way, bhikkhus, there are these five modes of speech with which others might address you: ",
    "mn21:19.2": "Timely or untimely, ",
    "mn21:19.3": "factual or false, ",
    "mn21:19.4": "gentle or harsh, ",
    "mn21:19.5": "beneficial or unbeneficial, ",
    "mn21:19.6": "from a mind of friendliness or from inner hate. ",
    "mn21:19.7": "When others address you, they may do so in a timely or untimely manner, ",
    "mn21:19.8": "in a factual or false manner, ",
    "mn21:19.9": "in a gentle or harsh manner, ",
    "mn21:19.10": "in a beneficial or unbeneficial manner, ",
    "mn21:19.11": "and from a mind of friendliness or with inner hate. ",
    "mn21:19.12": "Even in that case, you should train like this: ",
    "mn21:19.13": "‘Our minds will remain unaffected, and we will utter no hateful words. We will remain compassionate for [the other’s] welfare, with a mind of friendliness and no inner hate. ",
    "mn21:19.14": "We will abide having pervaded that individual with a mind of friendliness. And with him as a basis, we will abide having pervaded the whole world with a mind of friendliness—abundant, expansive, immeasurable, free of enmity and ill will.’ ",
    "mn21:19.15": "That is how you should train. ",
    "mn21:20.1": "Even if low-down bandits were to sever him limb from limb with a two-handled saw, whoever corrupts his mind on that account would not be following my instructions. ",
    "mn21:20.2": "Even in that case, you should train like this: ",
    "mn21:20.3": "‘Our minds will remain unaffected, and we will utter no hateful words. We will remain compassionate for their welfare, with a mind of friendliness and no inner hate. ",
    "mn21:20.4": "We will abide having pervaded them with a mind of friendliness. And with them as a basis, we will abide having pervaded the whole world with a mind of friendliness—abundant, expansive, immeasurable, free of enmity and ill will.’ ",
    "mn21:20.5": "That is how you should train. ",
    "mn21:21.1": "If you frequently apply your mind to this advice on the simile of the saw, ",
    "mn21:21.2": "do you see any manner of speech, subtle or coarse, that you could not bear?” ",
    "mn21:21.3": "“No, venerable sir.” ",
    "mn21:21.4": "“So, bhikkhus, you should frequently apply your mind to this advice on the simile of the saw. ",
    "mn21:21.5": "This will be for your lasting welfare and happiness.” ",
    "mn21:21.6": "That is what the Auspicious One said. ",
    "mn21:21.7": "Pleased, the bhikkhus delighted in what the Auspicious One said. "
}
