{
  "mn22:0.1": "Middle Discourses 22 ",
  "mn22:0.2": "The Simile of the Venomous Snake ",
  "mn22:1.1": "So I have heard. ",
  "mn22:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
  "mn22:2.1": "Now at that time a bhikkhu called Ariṭṭha, who had previously been a vulture trapper, had the following pernicious view: ",
  "mn22:2.2": "“As I understand the Buddha’s teaching, the acts that he says are obstructions are not really obstructions for the one who performs them.” ",
  "mn22:2.3": "Several bhikkhus heard about this. ",
  "mn22:2.4": " ",
  "mn22:2.5": " ",
  "mn22:3.1": "They went up to Ariṭṭha and said to him, ",
  "mn22:3.2": "“Is it really true, Friend Ariṭṭha, that you have such a pernicious view: ",
  "mn22:3.3": "‘As I understand the Buddha’s teaching, the acts that he says are obstructions are not really obstructions for the one who performs them’?” ",
  "mn22:3.4": "“Absolutely, friends. As I understand the Buddha’s teaching, the acts that he says are obstructions are not really obstructions for the one who performs them.” ",
  "mn22:3.5": "Then, wishing to dissuade Ariṭṭha from his view, the bhikkhus pursued, pressed, and grilled him, ",
  "mn22:3.6": "“Do not say that, Ariṭṭha! Do not misrepresent the Buddha, for misrepresentation of the Buddha is not good. And the Buddha would not say that. ",
  "mn22:3.7": "In many ways the Buddha has said that obstructive acts are obstructive, and that they really do obstruct the one who performs them. ",
  "mn22:3.8": "The Buddha says that sensuality gives little gratification and much suffering and distress, and the peril there is what is greater. ",
  "mn22:3.9": "With the similes of a skeleton … ",
  "mn22:3.10": "a scrap of meat … ",
  "mn22:3.11": "a grass torch … ",
  "mn22:3.12": "a pit of glowing coals … ",
  "mn22:3.13": "a dream … ",
  "mn22:3.14": "borrowed goods … ",
  "mn22:3.15": "fruit on a tree … ",
  "mn22:3.16": "a butcher’s knife and chopping block … ",
  "mn22:3.17": "a staking sword … ",
  "mn22:3.18": "a snake’s head, the Buddha says that sensuality gives little gratification and much suffering and distress, and the peril there is what is greater.” ",
  "mn22:3.19": "But even though the bhikkhus pursued, pressed, and grilled him in this way, Ariṭṭha obstinately stuck to his pernicious view and insisted on stating it. ",
  "mn22:3.20": "When they were not able to dissuade Ariṭṭha from his view, the bhikkhus went to the Buddha, bowed, sat down to one side, and told him what had happened. ",
  "mn22:3.21": " ",
  "mn22:3.22": " ",
  "mn22:3.23": " ",
  "mn22:3.24": " ",
  "mn22:3.25": " ",
  "mn22:3.26": " ",
  "mn22:3.27": " ",
  "mn22:3.28": " ",
  "mn22:3.29": " ",
  "mn22:3.30": " ",
  "mn22:3.31": " ",
  "mn22:3.32": " ",
  "mn22:3.33": " ",
  "mn22:3.34": " ",
  "mn22:3.35": " ",
  "mn22:3.36": " ",
  "mn22:3.37": " ",
  "mn22:3.38": " ",
  "mn22:3.39": " ",
  "mn22:4.1": " ",
  "mn22:5.1": "So the Buddha addressed one of the bhikkhus, ",
  "mn22:5.2": "“Please, bhikkhu, in my name tell the bhikkhu Ariṭṭha, formerly a vulture trapper, that ",
  "mn22:5.3": "the teacher summons him.” ",
  "mn22:5.4": "“Yes, Bhante,” that bhikkhu replied. He went to Ariṭṭha and said to him, ",
  "mn22:5.5": "“Friend Ariṭṭha, the teacher summons you.” ",
  "mn22:5.6": "“Yes, friend,” Ariṭṭha replied. He went to the Buddha, bowed, and sat down to one side. The Buddha said to him, ",
  "mn22:5.7": "“Is it really true, Ariṭṭha, that you have such a pernicious view: ",
  "mn22:5.8": "‘As I understand the Buddha’s teaching, the acts that he says are obstructions are not really obstructions for the one who performs them’?” ",
  "mn22:5.9": "“Absolutely, Bhante. As I understand the Buddha’s teaching, the acts that he says are obstructions are not really obstructions for the one who performs them.” ",
  "mn22:6.1": "“Inept man, who on earth have you ever known me to teach the Dhamma in that way? ",
  "mn22:6.2": "Inept man, have I not said in many ways that obstructive acts are obstructive, and that they really do obstruct the one who performs them? ",
  "mn22:6.3": "I have said that sensuality gives little gratification and much suffering and distress, and the peril there is what is greater. ",
  "mn22:6.4": "With the similes of a skeleton … ",
  "mn22:6.5": "a scrap of meat … ",
  "mn22:6.6": "a grass torch … ",
  "mn22:6.7": "a pit of glowing coals … ",
  "mn22:6.8": "a dream … ",
  "mn22:6.9": "borrowed goods … ",
  "mn22:6.10": "fruit on a tree … ",
  "mn22:6.11": "a butcher’s knife and chopping block … ",
  "mn22:6.12": "a staking sword … ",
  "mn22:6.13": "a snake’s head, I have said that sensuality gives little gratification and much suffering and distress, and the peril there is what is greater. ",
  "mn22:6.14": "But still, inept man, you misrepresent me by your wrong grasp, harm yourself, and create much demerit. ",
  "mn22:6.15": "This will be for your lasting harm and suffering.” ",
  "mn22:7.1": "Then the Buddha said to the bhikkhus, ",
  "mn22:7.2": "“What do you think, bhikkhus? ",
  "mn22:7.3": "Is this bhikkhu Ariṭṭha even warmed up in this teaching-and-discipline?” ",
  "mn22:7.4": "“How could that be? ",
  "mn22:7.5": "No, Bhante.” ",
  "mn22:7.6": "When this was said, Ariṭṭha sat silent, dismayed, shoulders drooping, downcast, depressed, with nothing to say. ",
  "mn22:7.7": "Knowing this, the Buddha said, ",
  "mn22:7.8": "“Inept man, you will be known by your own harmful view. ",
  "mn22:7.9": "I will question the bhikkhus about this.” ",
  "mn22:8.1": "Then the Buddha said to the bhikkhus, ",
  "mn22:8.2": "“Bhikkhus, do you understand my teaching as Ariṭṭha does, when he misrepresents me by his own wrong grasp, harms himself, and creates much demerit?” ",
  "mn22:8.3": "“No, Bhante. ",
  "mn22:8.4": "For in many ways the Buddha has told us that obstructive acts are obstructive, and that they really do obstruct the one who performs them. ",
  "mn22:8.5": " ",
  "mn22:8.6": "The Buddha has said that sensuality gives little gratification and much suffering and distress, and the peril there is what is greater. ",
  "mn22:8.7": "With the similes of a skeleton … ",
  "mn22:8.8": "a snake’s head, the Buddha has said that sensuality gives little gratification and much suffering and distress, and the peril there is what is greater.” ",
  "mn22:8.9": "“Good, good, bhikkhus! It is good that you understand my teaching like this. ",
  "mn22:8.10": "For in many ways I have said that obstructive acts are obstructive … ",
  "mn22:8.11": " ",
  "mn22:8.12": " ",
  "mn22:8.13": "I have said that sensuality gives little gratification and much suffering and distress, and the peril there is what is greater. ",
  "mn22:8.14": "But still this Ariṭṭha misrepresents me by his wrong grasp, harms himself, and creates much demerit. ",
  "mn22:8.15": "This will be for this inept man’s lasting harm and suffering. ",
  "mn22:9.1": "Truly, bhikkhus, it is quite impossible to engage in sensual acts without sensual desire, and without perceptions and thoughts of sensuality. ",
  "mn22:10.1": "Here, bhikkhus, some inept men memorize the teachings— ",
  "mn22:10.2": "statements, mixed prose & verse, discussions, verses, inspired exclamations, sayings, stories of past lives, amazing stories, and questions-and-answers. ",
  "mn22:10.3": "But they do not examine the meaning of those teachings with understanding, ",
  "mn22:10.4": "and so do not come to a considered acceptance of them. ",
  "mn22:10.5": "They memorize the Dhamma for the sake of finding fault and winning debates. ",
  "mn22:10.6": "They do not realize the goal for which they memorized the Dhamma. ",
  "mn22:10.7": "Because they are wrongly grasped, those teachings lead to their lasting harm and suffering. ",
  "mn22:10.8": "Why is that? ",
  "mn22:10.9": "Because of their wrong grasp of the teachings. ",
  "mn22:10.10": "Suppose there was a man in need of a venomous snake. And while wandering in search of a venomous snake, ",
  "mn22:10.11": "he would see a big venomous snake, ",
  "mn22:10.12": "and grasp it by the coil or the tail. ",
  "mn22:10.13": "But that venomous snake would twist back and bite him on the hand or the arm or limb, ",
  "mn22:10.14": "resulting in death or deadly suffering. ",
  "mn22:10.15": "Why is that? ",
  "mn22:10.16": "Because of his wrong grasp of the venomous snake. ",
  "mn22:10.17": "In the same way, some inept men memorize the teachings … ",
  "mn22:10.18": " ",
  "mn22:10.19": " ",
  "mn22:10.20": " ",
  "mn22:10.21": " ",
  "mn22:10.22": " ",
  "mn22:10.23": "and those teachings lead to their lasting harm and suffering. ",
  "mn22:10.24": "Why is that? ",
  "mn22:10.25": "Because of their wrong grasp of the teachings. ",
  "mn22:11.1": "But here, bhikkhus, some clansmen memorize the teachings— ",
  "mn22:11.2": "statements, mixed prose & verse, discussions, verses, inspired exclamations, sayings, stories of past lives, amazing stories, and questions-and-answers. ",
  "mn22:11.3": "And once they have memorized them, they examine the meaning of those teachings with understanding, ",
  "mn22:11.4": "and come to a considered acceptance of them. ",
  "mn22:11.5": "They do not memorize the Dhamma for the sake of finding fault and winning debates. ",
  "mn22:11.6": "They realize the goal for which they memorized the Dhamma. ",
  "mn22:11.7": "Because they are correctly grasped, those teachings lead to their lasting welfare and happiness. ",
  "mn22:11.8": "Why is that? ",
  "mn22:11.9": "Because of their correct grasp of the teachings. ",
  "mn22:11.10": "Suppose there was a man in need of a venomous snake. And while wandering in search of a venomous snake, ",
  "mn22:11.11": "he would see a big venomous snake, ",
  "mn22:11.12": "and hold it down firmly with a cleft stick. ",
  "mn22:11.13": "Only then would he correctly grasp it by the neck. ",
  "mn22:11.14": "And even though that venomous snake might wrap its coils around that man’s hand or arm or some other limb, that would not result in his death or deadly suffering. ",
  "mn22:11.15": "Why is that? ",
  "mn22:11.16": "Because of his correct grasp of the venomous snake. ",
  "mn22:11.17": "In the same way, some clansmen memorize the teachings … ",
  "mn22:11.18": " ",
  "mn22:11.19": " ",
  "mn22:11.20": " ",
  "mn22:11.21": " ",
  "mn22:11.22": " ",
  "mn22:11.23": "and those teachings lead to their lasting welfare and happiness. ",
  "mn22:11.24": "Why is that? ",
  "mn22:11.25": "Because of their correct grasp of the teachings. ",
  "mn22:12.1": "So, bhikkhus, when you understand what I have said, you should remember it accordingly. ",
  "mn22:12.2": "But if I have said anything that you do not understand, you should ask me about it, or some competent bhikkhus. ",
  "mn22:13.1": "Bhikkhus, I will teach you a simile of the Dhamma as a raft: for crossing over, not for holding on. ",
  "mn22:13.2": "Listen and apply your mind well, I will speak.” ",
  "mn22:13.3": "“Yes, Bhante,” they replied. ",
  "mn22:13.4": "The Buddha said this: ",
  "mn22:13.5": "“Suppose there was a man traveling along the road. ",
  "mn22:13.6": "He would see a large body of water, whose near shore was dubious and perilous, while the far shore was a sanctuary free of peril. ",
  "mn22:13.7": "But there was no ferryboat or bridge for crossing over. ",
  "mn22:13.8": "He would think, ",
  "mn22:13.9": " ",
  "mn22:13.10": " ",
  "mn22:13.11": "‘Why do not I gather grass, sticks, branches, and leaves and make a raft? Riding on the raft, and paddling with my hands and feet, I can safely reach the far shore.’ ",
  "mn22:13.12": "And so he would do exactly that. ",
  "mn22:13.13": "And when he would crossed over to the far shore, he would think, ",
  "mn22:13.14": "‘This raft has been very helpful to me. ",
  "mn22:13.15": "Riding on the raft, and paddling with my hands and feet, I have safely crossed over to the far shore. ",
  "mn22:13.16": "Why do not I hoist it on my head or pick it up on my shoulder and go wherever I want?’ ",
  "mn22:13.17": "What do you think, bhikkhus? ",
  "mn22:13.18": "Would that man be doing what should be done with that raft?” ",
  "mn22:13.19": "“No, Bhante.” ",
  "mn22:13.20": "“And what, bhikkhus, should that man do with the raft? ",
  "mn22:13.21": "When he would crossed over he should think, ",
  "mn22:13.22": "‘This raft has been very helpful to me. … ",
  "mn22:13.23": " ",
  "mn22:13.24": "Why do not I beach it on dry land or set it adrift on the water and go wherever I want?’ ",
  "mn22:13.25": "That is what that man should do with the raft. ",
  "mn22:13.26": "In the same way, the Dhamma has been taught by me similar to a raft: for crossing over, not for holding on. ",
  "mn22:14.1": "By understanding the simile of the raft, you will even give up the teachings, let alone what is against the teachings. ",
  "mn22:15.1": "Bhikkhus, there are these six grounds for views. ",
  "mn22:15.2": "What six? ",
  "mn22:15.3": "Take an unlearned ordinary person who has not seen the noble ones, and is neither skilled nor trained in the teaching of the noble ones. They have not seen true persons, and are neither skilled nor trained in the teaching of the true persons. ",
  "mn22:15.4": "They regard form as: ‘This is mine, I am this, this is my self.’ ",
  "mn22:15.5": "They also regard feeling … ",
  "mn22:15.6": "perception … ",
  "mn22:15.7": "activities … ",
  "mn22:15.8": "whatever is seen, heard, thought, cognized, come to, sought, and explored by the mind as: ‘This is mine, I am this, this is my self.’ ",
  "mn22:15.9": "And as for this ground for views: ",
  "mn22:15.10": "‘The world and the self are one and the same. After death I will be permanent, everlasting, eternal, imperishable, and will last forever and ever.’ ",
  "mn22:15.11": "They regard this also as: ‘This is mine, I am this, this is my self.’ ",
  "mn22:16.1": "But a trained noble disciple has seen the noble ones, and is skilled and trained in the teaching of the noble ones. They have seen true persons, and are skilled and trained in the teaching of the true persons. ",
  "mn22:16.2": "They regard form like this: ‘This is not mine, I am not this, this is not my self.’ ",
  "mn22:16.3": "They also regard feeling … ",
  "mn22:16.4": "perception … ",
  "mn22:16.5": "activities … ",
  "mn22:16.6": "whatever is seen, heard, thought, cognized, come to, sought, and explored by the mind like this: ‘This is not mine, I am not this, this is not my self.’ ",
  "mn22:16.7": "And the same for this ground for views: ",
  "mn22:16.8": "‘The world and the self are one and the same. After death I will be permanent, everlasting, eternal, imperishable, and will last forever and ever.’ ",
  "mn22:16.9": "They also regard like this: ‘This is not mine, I am not this, this is not my self.’ ",
  "mn22:17.1": "Seeing in this way, they are not anxious about what is not there.”",
  "mn22:18.1": "When he said this, one of the bhikkhus asked the Buddha, ",
  "mn22:18.2": "“Bhante, can there be anxiety about what is not there externally?” ",
  "mn22:18.3": "“There can, bhikkhu,” said the Buddha. ",
  "mn22:18.4": "“It is when someone thinks, ",
  "mn22:18.5": "‘Oh, it once was mine but is mine no more. ",
  "mn22:18.6": "Oh, it could be mine but I do not get it.’ ",
  "mn22:18.7": "They sorrow and wail and lament, beating their breast and falling into a muddle. ",
  "mn22:18.8": "That is how there is anxiety about what is not there externally.” ",
  "mn22:19.1": "“But can there be no anxiety about what is not there externally?” ",
  "mn22:19.2": "“There can, bhikkhu,” said the Buddha. ",
  "mn22:19.3": "“It is when someone does not think, ",
  "mn22:19.4": "‘Oh, it once was mine but is mine no more. ",
  "mn22:19.5": "Oh, it could be mine but I do not get it.’ ",
  "mn22:19.6": "They do not sorrow and wail and lament, beating their breast and falling into a muddle. ",
  "mn22:19.7": "That is how there is no anxiety about what is not there externally.” ",
  "mn22:20.1": "“But can there be anxiety about what is not there internally?” ",
  "mn22:20.2": "“There can, bhikkhu,” said the Buddha. ",
  "mn22:20.3": "“It is when someone has such a view: ",
  "mn22:20.4": "‘The world and the self are one and the same. After death I will be permanent, everlasting, eternal, imperishable, and will last forever and ever.’ ",
  "mn22:20.5": "They hear the Realized One or their disciple teaching the Dhamma for the uprooting of all grounds for views, standpoints, obsessions, insistences, and underlying tendencies; for the calming of all activities, the letting go of all appropriation, the ending of craving, dispassion, cessation, Nibbāna. ",
  "mn22:20.6": "They think, ",
  "mn22:20.7": "‘I am going to be annihilated and destroyed! I will not even exist any more!’ ",
  "mn22:20.8": "They sorrow and wail and lament, beating their breast and falling into a muddle. ",
  "mn22:20.9": "That is how there is anxiety about what is not there internally.” ",
  "mn22:21.1": "“But can there be no anxiety about what is not there internally?” ",
  "mn22:21.2": "“There can,” said the Buddha. ",
  "mn22:21.3": "“It is when someone does not have such a view: ",
  "mn22:21.4": "‘The world and the self are one and the same. After death I will be permanent, everlasting, eternal, imperishable, and will last forever and ever.’ ",
  "mn22:21.5": "They hear the Realized One or their disciple teaching the Dhamma for the uprooting of all grounds for views, standpoints, obsessions, insistences, and underlying tendencies; for the calming of all activities, the letting go of all appropriation, the ending of craving, dispassion, cessation, Nibbāna. ",
  "mn22:21.6": "They do not think, ",
  "mn22:21.7": "‘I am going to be annihilated and destroyed! I will not even exist any more!’ ",
  "mn22:21.8": "They do not sorrow and wail and lament, beating their breast and falling into a muddle. ",
  "mn22:21.9": "That is how there is no anxiety about what is not there internally. ",
  "mn22:22.1": "Bhikkhus, it would make sense to be possessive about something that is permanent, everlasting, eternal, imperishable, and will last forever and ever. ",
  "mn22:22.2": "But do you see any such possession?” ",
  "mn22:22.3": "“No, Bhante.” ",
  "mn22:22.4": "“Good, bhikkhus! ",
  "mn22:22.5": "I also cannot see any such possession. ",
  "mn22:23.1": "It would make sense to grasp at a view of self that did not give rise to sorrow, lamentation, displeasure, sadness, and distress. ",
  "mn22:23.2": "But do you see any such view of self?” ",
  "mn22:23.3": "“No, Bhante.” ",
  "mn22:23.4": "“Good, bhikkhus! ",
  "mn22:23.5": "I also cannot see any such view of self. ",
  "mn22:24.1": "It would make sense to rely on a view that did not give rise to sorrow, lamentation, displeasure, sadness, and distress. ",
  "mn22:24.2": "But do you see any such view to rely on?” ",
  "mn22:24.3": "“No, Bhante.” ",
  "mn22:24.4": "“Good, bhikkhus! ",
  "mn22:24.5": "I also cannot see any such view to rely on. ",
  "mn22:25.1": "Bhikkhus, were there to be a self, would there be the thought, ‘What belongs to my self’?” ",
  "mn22:25.2": "“Yes, Bhante.” ",
  "mn22:25.3": "“Were there to be what belongs to a self, would there be the thought, ‘My self’?” ",
  "mn22:25.4": "“Yes, Bhante.” ",
  "mn22:25.5": "“But since a self and what belongs to a self are not actually found, is not the following a totally foolish teaching: ",
  "mn22:25.6": "‘The world and the self are one and the same. After death I will be permanent, everlasting, eternal, imperishable, and will last forever and ever’?” ",
  "mn22:25.7": " ",
  "mn22:25.8": "“How could it not, Bhante? It is a totally foolish teaching.” ",
  "mn22:26.1": "“What do you think, bhikkhus? ",
  "mn22:26.2": "Is form permanent or impermanent?” ",
  "mn22:26.3": "“Impermanent, Bhante.” ",
  "mn22:26.4": "“But if it is impermanent, is it suffering or happiness?” ",
  "mn22:26.5": "“Suffering, Bhante.” ",
  "mn22:26.6": "“But if it is impermanent, suffering, and perishable, is it fit to be regarded thus: ",
  "mn22:26.7": "‘This is mine, I am this, this is my self’?” ",
  "mn22:26.8": "“No, Bhante.” ",
  "mn22:26.9": "“What do you think, bhikkhus? ",
  "mn22:26.10": "Is feeling … ",
  "mn22:26.11": "perception … ",
  "mn22:26.12": "activities … ",
  "mn22:26.13": "consciousness permanent or impermanent?” ",
  "mn22:26.14": "“Impermanent, Bhante.” ",
  "mn22:26.15": "“But if it is impermanent, is it suffering or happiness?” ",
  "mn22:26.16": "“Suffering, Bhante.” ",
  "mn22:26.17": "“But if it is impermanent, suffering, and perishable, is it fit to be regarded thus: ",
  "mn22:26.18": "‘This is mine, I am this, this is my self’?” ",
  "mn22:26.19": "“No, Bhante.” ",
  "mn22:27.1": "“So, bhikkhus, you should see any kind of form at all—past, future, or present; internal or external; coarse or fine; inferior or superior; far or near:  all form—as it is with right understanding: ‘This is not mine, I am not this, this is not my self.’ ",
  "mn22:27.2": "You should see any kind of feeling … ",
  "mn22:27.3": "perception … ",
  "mn22:27.4": "activities … ",
  "mn22:27.5": "consciousness at all—past, future, or present; internal or external; coarse or fine; inferior or superior; far or near: all consciousness—as it is with right understanding: ‘This is not mine, I am not this, this is not my self.’ ",
  "mn22:28.1": "Seeing this, a trained noble disciple grows disenchanted with form, feeling, perception, activities, and consciousness. ",
  "mn22:29.1": "Being disenchanted, he is dispassionate. With dispassion, he is liberated. When he is liberated, he knows he is liberated. ",
  "mn22:29.2": "He understands: ‘Birth is destroyed, the renunciate life has been lived, what had to be done has been done, there will be no more of this.’ ",
  "mn22:30.1": "Such a bhikkhu is one who is called ‘one who has lifted the cross-bar’, ‘one who has filled in the moat’, ‘one who has pulled up the pillar’, ‘one who is unbarred’, and also ‘a noble one with banner lowered and burden dropped, detached’. ",
  "mn22:31.1": "And how has a bhikkhu raised the cross-bar? ",
  "mn22:31.2": "It is when for a bhikkhu ignorance has been given up, cut off at the root, made like a palm stump, obliterated, and is unable to arise in the future. ",
  "mn22:31.3": "That is how a bhikkhu has lifted the cross-bar. ",
  "mn22:32.1": "And how has a bhikkhu filled in the moat? ",
  "mn22:32.2": "It is when for a bhikkhu the roaming through births involving repeated being has been given up, cut off at the root, made like a palm stump, obliterated, and is unable to arise in the future. ",
  "mn22:32.3": "That is how a bhikkhu has filled in the moat. ",
  "mn22:33.1": "And how has a bhikkhu pulled up the pillar? ",
  "mn22:33.2": "It is when for a bhikkhu craving has been given up, cut off at the root, made like a palm stump, obliterated, and is unable to arise in the future. ",
  "mn22:33.3": "That is how a bhikkhu has pulled up the pillar. ",
  "mn22:34.1": "And how is a bhikkhu unimpeded? ",
  "mn22:34.2": "It is when for a bhikkhu the five lower fetters have been given up, cut off at the root, made like a palm stump, obliterated, and is unable to arise in the future. ",
  "mn22:34.3": "That is how a bhikkhu is unimpeded. ",
  "mn22:35.1": "And how is a bhikkhu a noble one with banner lowered and burden dropped, detached? ",
  "mn22:35.2": "It is when for a bhikkhu the conceit ‘I am’ has been given up, cut off at the root, made like a palm stump, obliterated, and is unable to arise in the future. ",
  "mn22:35.3": "That is how a bhikkhu is a noble one with banner lowered and burden dropped, detached. ",
  "mn22:36.1": "When a bhikkhu’s mind is liberated like this, the gods together with Indra, Brahmā, and the Progenitor, search as they may, will not find: ",
  "mn22:36.2": "‘That realized one’s consciousness is dependent on this.’ ",
  "mn22:36.3": "Why is that?",
  "mn22:36.4": "Because that realized one is not to be found even amidst the present experience, I say.",
  "mn22:37.1": "Though I state and assert this, certain ascetics and brahmins misrepresent me with the false, hollow, lying, untruthful claim:",
  "mn22:37.2": "‘The ascetic Gotama is an exterminator. He advocates the annihilation, eradication, and obliteration of a being that exists.’",
  "mn22:37.3": "I have been falsely misrepresented as what I am not, and saying what I do not say.",
  "mn22:37.4": " ",
  "mn22:37.5": "In the past, as today, what I describe is suffering and the cessation of suffering.",
  "mn22:37.6": "This being so, if others abuse, attack, harass, and trouble the Realized One, he does not get irritated, bitter, or annoyed.",
  "mn22:38.1": "If others honor, respect, revere, or venerate him, he does not become delighted, happy, or elated.",
  "mn22:38.2": "If others honor, respect, revere, or venerate him, he thinks:",
  "mn22:38.3": "‘Such acts are done to me at that [domain] which was completely understood beforehand.’",
  "mn22:39.1": "So, bhikkhus, if others abuse, attack, harass, and trouble you, do not become irritated, bitter, or annoyed.",
  "mn22:39.2": "Or if others honor, respect, revere, or venerate you, do not become delighted, happy, or elated.",
  "mn22:39.3": "If they praise you, you should think:",
  "mn22:39.4": "‘Such acts are done to me at that [domain] which was completely understood beforehand.’",
  "mn22:40.1": "So, bhikkhus, relinquish what is not yours.",
  "mn22:40.2": "Relinquishing it will be for your lasting welfare and happiness.",
  "mn22:41.1": "And what is not yours?",
  "mn22:41.2": "Form is not yours: relinquish it.",
  "mn22:41.3": "Relinquishing it will be for your lasting welfare and happiness.",
  "mn22:41.4": "Feeling …",
  "mn22:41.5": " ",
  "mn22:41.6": "perception … ",
  "mn22:41.7": " ",
  "mn22:41.8": "activities … ",
  "mn22:41.9": " ",
  "mn22:41.10": "consciousness is not yours: give it up. ",
  "mn22:41.11": "Giving it up will be for your lasting welfare and happiness. ",
  "mn22:41.12": "What do you think, bhikkhus? ",
  "mn22:41.13": "Suppose a man was to carry off the grass, sticks, branches, and leaves in this Jeta’s Grove, or burn them, or do what they want with them. ",
  "mn22:41.14": "Would you think, ",
  "mn22:41.15": "‘This man is carrying us off, burning us, or doing what they want with us’?” ",
  "mn22:41.16": "“No, Bhante. ",
  "mn22:41.17": "Why is that? ",
  "mn22:41.18": "Because to us that is neither self nor belonging to self.” ",
  "mn22:41.19": "“In the same way, bhikkhus, give up what is not yours. ",
  "mn22:41.20": "Giving it up will be for your lasting welfare and happiness. ",
  "mn22:41.21": "And what is not yours? ",
  "mn22:41.22": "Form … ",
  "mn22:41.23": " ",
  "mn22:41.24": "feeling … ",
  "mn22:41.25": "perception … ",
  "mn22:41.26": "activities … ",
  "mn22:41.27": "consciousness is not yours: give it up. ",
  "mn22:41.28": "Giving it up will be for your lasting welfare and happiness. ",
  "mn22:42.1": "Thus the teaching has been well explained by me, made clear, opened, illuminated, and stripped of patchwork. ",
  "mn22:42.2": "In this teaching, there are bhikkhus who are Arahants, who have destroyed the influxes, completed the renunciate journey, done what had to be done, laid down the burden, arrived at the highest goal, utterly destroyed the fetters of being, and are liberated by right understanding. For them, there is no round of existence to be found. … ",
  "mn22:43.1": " ",
  "mn22:43.2": "In this teaching, there are bhikkhus who have given up the five lower fetters. All of them reappear spontaneously. They are extinguished there, and are not liable to return from that world. … ",
  "mn22:44.1": " ",
  "mn22:44.2": "In this teaching, there are bhikkhus who, having given up three fetters, and weakened passion, aversion, and muddledness, are once-returners. All of them come back to this world once only, then make an end of suffering. … ",
  "mn22:45.1": " ",
  "mn22:45.2": "In this teaching, there are bhikkhus who have given up the three fetters. All of them are stream-enterers, not liable to the underworld, bound for awakening. … ",
  "mn22:46.1": " ",
  "mn22:46.2": "In this teaching, there are bhikkhus who are Dhamma-followers or faith-followers. All of them are bound for awakening. ",
  "mn22:47.1": "Thus the teaching has been well explained by me, made clear, opened, illuminated, and stripped of patchwork. ",
  "mn22:47.2": "In this teaching, there are those who have a degree of faith and fondness for me. All of them are bound for heaven.” ",
  "mn22:47.3": "That is what the Buddha said. ",
  "mn22:47.4": "Pleased, the bhikkhus delighted in what the Buddha said. "
}