{
  "mn25:0.1": "Middle Discourses 25 ",
  "mn25:0.2": "The Bait ",
  "mn25:1.1": "So I have heard. ",
  "mn25:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
  "mn25:1.3": "There the Buddha addressed the bhikkhus, ",
  "mn25:1.4": "“Bhikkhus!” ",
  "mn25:1.5": "“Bhante,” they replied. ",
  "mn25:1.6": "The Buddha said this: ",
  "mn25:2.1": "“Bhikkhus, a trapper does not lay down bait for deer thinking, ",
  "mn25:2.2": "‘May the deer, enjoying this bait, be healthy and in good condition. May they live long and prosper!’ ",
  "mn25:2.3": "A trapper lays down bait for deer thinking, ",
  "mn25:2.4": "‘These deer will, having leapt at the bait I laid down, eat the food with infatuation. They’ll become indulgent; as they’re indulgent, they’ll become careless, and then I’ll be able to do what I want with them on account of this bait.’ ",
  "mn25:3.1": "And indeed, the first herd of deer, having leapt at the bait laid down by the trapper, ate the food with infatuation. As they were indulgent, they became careless, and then the trapper was able to do what he wanted with them on account of that bait. ",
  "mn25:3.2": "And that’s how the first herd of deer failed to get free from the trapper’s power. ",
  "mn25:4.1": "So then a second herd of deer thought up a plan, ",
  "mn25:4.2": "‘The first herd of deer, having leapt at the bait laid down by the trapper … ",
  "mn25:4.3": "",
  "mn25:4.4": "and failed to get free of the trapper’s power. ",
  "mn25:4.5": "Why don’t we avoid eating the bait altogether? Avoiding the dangerous food, we can venture deep into a wilderness region and live there.’ ",
  "mn25:4.6": "And that’s just what they did. ",
  "mn25:4.7": "But when it came to the last month of summer, the grass and water ran out. Their bodies became much too thin, ",
  "mn25:4.8": "and they lost their strength and energy. ",
  "mn25:4.9": "So they returned to where the trapper had laid down the bait. ",
  "mn25:4.10": "They, having leapt at it, ate it with infatuation … ",
  "mn25:4.11": "",
  "mn25:4.12": "And that’s how the second herd of deer failed to get free from the trapper’s power. ",
  "mn25:5.1": "So then a third herd of deer thought up a plan, ",
  "mn25:5.2": "‘The first … ",
  "mn25:5.3": "",
  "mn25:5.4": "and second herds of deer … ",
  "mn25:5.5": "",
  "mn25:5.6": "",
  "mn25:5.7": "",
  "mn25:5.8": "",
  "mn25:5.9": "",
  "mn25:5.10": "",
  "mn25:5.11": "",
  "mn25:5.12": "",
  "mn25:5.13": "",
  "mn25:5.14": "failed to get free of the trapper’s power. ",
  "mn25:5.15": "Why don’t we set up our lair close by where the trapper has laid down the bait? ",
  "mn25:5.16": "Then we can, without leaping at the bait laid down by the trapper, eat the food without infatuation. We won’t become indulgent, and therefore we won’t become careless. Not being careless, the trapper won’t be able to do what he wants with us on account of that bait.’ ",
  "mn25:5.17": "And that’s just what they did. ",
  "mn25:5.18": "",
  "mn25:5.19": "So the trapper and his helpers thought, ",
  "mn25:5.20": "‘This third herd of deer is so sneaky and devious! They must be powerful supernatural beings! ",
  "mn25:5.21": "For they eat the bait we’ve laid down without us knowing how they come and go. ",
  "mn25:5.22": "Why don’t we surround the bait we laid down on all sides by staking out large nets with sticks? Hopefully we might get to see the lair where they go to hide out.’ ",
  "mn25:5.23": "And that’s just what they did. ",
  "mn25:5.24": "And they saw the lair where the third herd of deer went to hide out. ",
  "mn25:5.25": "And that’s how the third herd failed to get free from the trapper’s power. ",
  "mn25:6.1": "So then a fourth herd of deer thought up a plan, ",
  "mn25:6.2": "‘The first … ",
  "mn25:6.3": "",
  "mn25:6.4": "second … ",
  "mn25:6.5": "",
  "mn25:6.6": "",
  "mn25:6.7": "",
  "mn25:6.8": "",
  "mn25:6.9": "",
  "mn25:6.10": "and third herds of deer … ",
  "mn25:6.11": "",
  "mn25:6.12": "",
  "mn25:6.13": "",
  "mn25:6.14": "",
  "mn25:6.15": "",
  "mn25:6.16": "",
  "mn25:6.17": "",
  "mn25:6.18": "",
  "mn25:6.19": "",
  "mn25:6.20": "",
  "mn25:6.21": "",
  "mn25:6.22": "",
  "mn25:6.23": "",
  "mn25:6.24": "",
  "mn25:6.25": "",
  "mn25:6.26": "",
  "mn25:6.27": "failed to get free of the trapper’s power. ",
  "mn25:6.28": "Why don’t we set up our lair somewhere the trapper and his helpers can’t go? Then we can, without leaping at the bait laid down by the trapper, eat the food without infatuation. We won’t become indulgent, and therefore we won’t become careless. Not being careless, the trapper won’t be able to do what he wants with us on account of that bait.’ ",
  "mn25:6.29": "And that’s just what they did. ",
  "mn25:6.30": "",
  "mn25:6.31": "So the trapper and his helpers thought, ",
  "mn25:6.32": "‘This fourth herd of deer is so sneaky and devious! They must be powerful supernatural beings! ",
  "mn25:6.33": "For they eat the bait we’ve laid down without us knowing how they come and go. ",
  "mn25:6.34": "Why don’t we surround the bait we laid down on all sides by staking out large nets with sticks? Hopefully we might get to see the lair where they go to hide out.’ ",
  "mn25:6.35": "And that’s just what they did. ",
  "mn25:6.36": "But they couldn’t see the lair where the fourth herd of deer went to hide out. ",
  "mn25:6.37": "So the trapper and his helpers thought, ",
  "mn25:6.38": "‘If we startle this fourth herd of deer, they’ll startle others, who in turn will startle even more. ",
  "mn25:6.39": "Then all of the deer will escape this bait we’ve laid down. ",
  "mn25:6.40": "Why don’t we just keep an eye on that fourth herd?’ ",
  "mn25:6.41": "And that’s just what they did. ",
  "mn25:6.42": "And that’s how the fourth herd of deer escaped the trapper’s power. ",
  "mn25:7.1": "I’ve made up this simile to make a point. ",
  "mn25:7.2": "And this is what it means. ",
  "mn25:7.3": "‘Bait’ is a term for the five strands of sensuality. ",
  "mn25:7.4": "‘Trapper’ is a term for Māra the Wicked. ",
  "mn25:7.5": "‘Trapper’s helpers’ is a term for Māra’s assembly. ",
  "mn25:7.6": "‘Deer’ is a term for ascetics and brahmins. ",
  "mn25:8.1": "Now, the first group of ascetics and brahmins, having leapt at that bait and those worldly pleasures laid down by Māra, ate it with infatuation. ",
  "mn25:8.2": "They became indulgent; as they were indulgent, they became careless, and then Māra was able to do what he wanted with them on account of that bait and those worldly pleasures. ",
  "mn25:8.3": "And that’s how the first group of ascetics and brahmins failed to get free from Māra’s power. ",
  "mn25:8.4": "This first group of ascetics and brahmins is just like the first herd of deer, I say. ",
  "mn25:9.1": "So then a second group of ascetics and brahmins thought up a plan, ",
  "mn25:9.2": "‘The first group of ascetics and brahmins became indulgent … ",
  "mn25:9.3": "",
  "mn25:9.4": "and failed to get free of Māra’s power. ",
  "mn25:9.5": "Why don’t we avoid eating the bait and the worldly pleasures altogether? Avoiding dangerous food, we can venture deep into a wilderness region and live there.’ ",
  "mn25:9.6": "",
  "mn25:9.7": "And that’s just what they did. ",
  "mn25:9.8": "They ate herbs, millet, wild rice, poor rice, water lettuce, rice bran, scum from boiling rice, sesame flour, grass, or cow dung. They survived on forest roots and fruits, or eating fallen fruit. ",
  "mn25:9.9": "But when it came to the last month of summer, the grass and water ran out. Their bodies became much too thin, ",
  "mn25:9.10": "and they lost their strength and energy. ",
  "mn25:9.11": "Because of this, they lost their liberation of mind, ",
  "mn25:9.12": "so they went back to where Māra had laid down the bait and those worldly pleasures. ",
  "mn25:9.13": "Leaping at that place, they ate the food with infatuation … ",
  "mn25:9.14": "",
  "mn25:9.15": "And that’s how the second group of ascetics and brahmins failed to get free from Māra’s power. ",
  "mn25:9.16": "This second group of ascetics and brahmins is just like the second herd of deer, I say. ",
  "mn25:10.1": "So then a third group of ascetics and brahmins thought up a plan, ",
  "mn25:10.2": "‘The first … ",
  "mn25:10.3": "",
  "mn25:10.4": "and second groups of ascetics and brahmins … ",
  "mn25:10.5": "",
  "mn25:10.6": "",
  "mn25:10.7": "",
  "mn25:10.8": "",
  "mn25:10.9": "",
  "mn25:10.10": "",
  "mn25:10.11": "",
  "mn25:10.12": "",
  "mn25:10.13": "",
  "mn25:10.14": "",
  "mn25:10.15": "failed to get free of Māra’s power. ",
  "mn25:10.16": "Why don’t we set up our lair close by where Māra has laid down the bait and those worldly pleasures? Then we can, without leaping at the bait laid down by Māra, eat the food without infatuation. We won’t become indulgent, and therefore we won’t become careless. Not being careless, Māra won’t be able to do what he wants with us on account of that bait and those worldly pleasures.’ ",
  "mn25:10.17": "And that’s just what they did. ",
  "mn25:10.18": "",
  "mn25:10.19": "",
  "mn25:10.20": "Still, they had such views as these: ",
  "mn25:10.21": "‘The world is eternal’ or ‘The world is not eternal’; ",
  "mn25:10.22": "‘The world is finite’ or ‘The world is infinite’; ",
  "mn25:10.23": "‘The soul and the body are the same thing’ or ‘The soul and the body are different things’; ",
  "mn25:10.24": "or that after death, a Realized One still exists, or no longer exists, or both still exists and no longer exists, or neither still exists nor no longer exists. ",
  "mn25:10.25": "And that’s how the third group of ascetics and brahmins failed to get free from Māra’s power. ",
  "mn25:10.26": "This third group of ascetics and brahmins is just like the third herd of deer, I say. ",
  "mn25:11.1": "So then a fourth group of ascetics and brahmins thought up a plan, ",
  "mn25:11.2": "‘The first … ",
  "mn25:11.3": "",
  "mn25:11.4": "second … ",
  "mn25:11.5": "",
  "mn25:11.6": "",
  "mn25:11.7": "",
  "mn25:11.8": "",
  "mn25:11.9": "",
  "mn25:11.10": "and third groups of ascetics and brahmins … ",
  "mn25:11.11": "",
  "mn25:11.12": "",
  "mn25:11.13": "",
  "mn25:11.14": "",
  "mn25:11.15": "",
  "mn25:11.16": "",
  "mn25:11.17": "",
  "mn25:11.18": "",
  "mn25:11.19": "",
  "mn25:11.20": "",
  "mn25:11.21": "",
  "mn25:11.22": "",
  "mn25:11.23": "",
  "mn25:11.24": "",
  "mn25:11.25": "",
  "mn25:11.26": "failed to get free of Māra’s power. ",
  "mn25:11.27": "Why don’t we set up our lair where Māra and his assembly can’t go? ",
  "mn25:11.28": "Then we can, without leaping at the bait laid down by Māra, eat the food without infatuation. We won’t become indulgent, and therefore we won’t become careless. Not being careless, Māra won’t be able to do what he wants with us on account of that bait and those worldly pleasures.’ ",
  "mn25:11.29": "And that’s just what they did. ",
  "mn25:11.30": "",
  "mn25:11.31": "And that’s how the fourth group of ascetics and brahmins got free from Māra’s power. ",
  "mn25:11.32": "This fourth group of ascetics and brahmins is just like the fourth herd of deer, I say. ",
  "mn25:12.1": "And where is it that Māra and his assembly can’t go? ",
  "mn25:12.2": "It’s when a bhikkhu, quite disjoined from sensuality, disjoined from unbeneficial phenomena, with thinking and with pondering, with joy and ease born of separation, abides having entered upon the first jhāna. ",
  "mn25:12.3": "This is called a bhikkhu who has blinded Māra, put out his eyes without a trace, and gone where the Wicked One cannot see. ",
  "mn25:13.1": "Furthermore, with the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and ease born of composure, a bhikkhu abides having entered upon the second jhāna. ",
  "mn25:13.2": "This is called a bhikkhu who has blinded Māra … ",
  "mn25:14.1": "Furthermore, with the fading of joy, a bhikkhu abides equanimous, recollected, and aware, experiencing ease with the body. He abides having entered upon the third jhāna, with regard to which the noble ones say “one abides equanimous, recollected, and at ease.”  ",
  "mn25:14.2": "This is called a bhikkhu who has blinded Māra … ",
  "mn25:15.1": "Furthermore, with the giving up of ease and unease—and with the ending of joys and upsets beforehand—without ease or unease, with purity of equanimity and recollection, a bhikkhu abides having entered upon the fourth jhāna.   ",
  "mn25:15.2": "This is called a bhikkhu who has blinded Māra … ",
  "mn25:16.1": "Furthermore, a bhikkhu, having fully surmounted perceptions of form, with the ending of perceptions of resistance, not attending to perceptions of multiplicity, aware that ‘space is infinite’, abides having entered upon the extent of infinite space. ",
  "mn25:16.2": "This is called a bhikkhu who has blinded Māra … ",
  "mn25:17.1": "Furthermore, a bhikkhu, having fully surmounted the extent of infinite space, aware that ‘consciousness is infinite’, abides having entered upon the extent of infinite consciousness. ",
  "mn25:17.2": "This is called a bhikkhu who has blinded Māra … ",
  "mn25:18.1": "Furthermore, a bhikkhu, having fully surmounted the extent of infinite consciousness, aware that ‘there is nothing’, abides having entered upon the extent of nothingness. ",
  "mn25:18.2": "This is called a bhikkhu who has blinded Māra … ",
  "mn25:19.1": "Furthermore, a bhikkhu, having fully surmounted the extent of nothingness, abides having entered upon the extent of neither-perception-nor-non-perception. ",
  "mn25:19.2": "This is called a bhikkhu who has blinded Māra … ",
  "mn25:20.1": "Furthermore, a bhikkhu, having fully surmounted the extent of neither-perception-nor-non-perception, abides having entered upon the cessation of perception-and-feeling. And, having seen with understanding, his influxes are destroyed. ",
  "mn25:20.2": "This is called a bhikkhu who has blinded Māra, put out his eyes without a trace, and gone where the Wicked One cannot see. He's crossed over attachment to the world.” ",
  "mn25:20.3": "That is what the Buddha said. ",
  "mn25:20.4": "Pleased, the bhikkhus delighted in what the Buddha said. "
}
