{
  "mn26:0.1": "Middle Discourses 26 ",
  "mn26:0.2": "The Heap of Snares ",
  "mn26:1.1": "So I have heard. ",
  "mn26:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
  "mn26:2.1": "Then the Buddha robed up in the morning and, taking his bowl and robe, entered Sāvatthī for alms. ",
  "mn26:2.2": "Then several bhikkhus went up to Venerable Ānanda and said to him, ",
  "mn26:2.3": "“Friend, it’s been a long time since we’ve heard a Dhamma talk from the Buddha. ",
  "mn26:2.4": "It would be good if we got to hear a Dhamma talk from the Buddha.” ",
  "mn26:2.5": "“Well then, friends, go to the brahmin Rammaka’s hermitage. ",
  "mn26:2.6": "Hopefully you’ll get to hear a Dhamma talk from the Buddha.” ",
  "mn26:2.7": "“Yes, friend,” they replied. ",
  "mn26:3.1": "Then, after the meal, on his return from almsround, the Buddha addressed Venerable Ānanda, ",
  "mn26:3.2": "“Come, Ānanda, let’s go to the Eastern Monastery, the stilt longhouse of Migāra’s mother for the day’s abiding.” ",
  "mn26:3.3": "“Yes, Bhante,” Ānanda replied. ",
  "mn26:3.4": "So the Buddha went with Ānanda to the Eastern Monastery. ",
  "mn26:3.5": "In the late afternoon the Buddha came out of retreat and addressed Ānanda, ",
  "mn26:3.6": "“Come, Ānanda, let’s go to the eastern gate to bathe.” ",
  "mn26:3.7": "“Yes, Bhante,” Ānanda replied. ",
  "mn26:3.8": "So the Buddha went with Ānanda to the eastern gate to bathe. ",
  "mn26:3.9": "When he had bathed and emerged from the water he stood in one robe drying himself. ",
  "mn26:3.10": "Then Ānanda said to the Buddha, ",
  "mn26:3.11": "“Bhante, the hermitage of the brahmin Rammaka is nearby. ",
  "mn26:3.12": "It’s delightful ",
  "mn26:3.13": "and pleasing. ",
  "mn26:3.14": "It would be good if the Blessed One went to the hermitage of the brahmin Rammaka out of compassion.” ",
  "mn26:3.15": "The Buddha consented with silence. ",
  "mn26:4.1": "He went to the brahmin Rammaka’s hermitage. ",
  "mn26:4.2": "Now at that time several bhikkhus were sitting together in the hermitage talking about the Dhamma. ",
  "mn26:4.3": "The Buddha stood outside the door waiting for the talk to end. ",
  "mn26:4.4": "When he knew the talk had ended he cleared his throat and knocked with the latch. ",
  "mn26:4.5": "The bhikkhus opened the door for the Buddha, ",
  "mn26:4.6": "and he entered the hermitage, where he sat on the seat spread out ",
  "mn26:4.7": "and addressed the bhikkhus, ",
  "mn26:4.8": "“Bhikkhus, what were you sitting talking about just now? What conversation was left unfinished?” ",
  "mn26:4.9": "“Sir, our unfinished discussion on the Dhamma was about the Buddha himself when the Buddha arrived.” ",
  "mn26:4.10": "“Good, bhikkhus! ",
  "mn26:4.11": "It’s appropriate for clansmen like you, who have gone forth in faith from the lay life to homelessness, to sit together and talk about the Dhamma. ",
  "mn26:4.12": "When you’ve gathered, you should do one of two things: ",
  "mn26:4.13": "discuss the Dhamma, or keep noble silence. ",
  "mn26:5.1": "Bhikkhus, there are these two quests: ",
  "mn26:5.2": "the noble quest and the ignoble quest. ",
  "mn26:5.3": "And what is the ignoble quest? ",
  "mn26:5.4": "It’s when someone who is themselves subject to birth seeks what is also subject to birth. Themselves subject to aging, they seek what is also subject to aging. Themselves subject to illness, they seek what is also subject to illness. Themselves subject to death, they seek what is also subject to death. Themselves subject to sorrow, they seek what is also subject to sorrow. Themselves subject to defilement, they seek what is also subject to defilement. ",
  "mn26:6.1": "And what should be described as subject to birth? ",
  "mn26:6.2": "Partners and children, male and female bondservants, goats and sheep, chickens and pigs, elephants and cattle, and gold and money are subject to birth. ",
  "mn26:6.3": "These acquisitions are subject to birth. ",
  "mn26:6.4": "Someone who is tied to, infatuated with, and has fallen for such things, themselves subject to birth, seeks what is also subject to birth. ",
  "mn26:7.1": "And what should be described as subject to aging? ",
  "mn26:7.2": "Partners and children, male and female bondservants, goats and sheep, chickens and pigs, elephants and cattle, and gold and money are subject to aging. ",
  "mn26:7.3": "These acquisitions are subject to aging. ",
  "mn26:7.4": "Someone who is tied to, infatuated with, and has fallen for such things, themselves subject to aging, seeks what is also subject to aging. ",
  "mn26:8.1": "And what should be described as subject to illness? ",
  "mn26:8.2": "Partners and children, male and female bondservants, goats and sheep, chickens and pigs, and elephants and cattle are subject to illness. ",
  "mn26:8.3": "These acquisitions are subject to illness. ",
  "mn26:8.4": "Someone who is tied to, infatuated with, and has fallen for such things, themselves subject to illness, seeks what is also subject to illness. ",
  "mn26:9.1": "And what should be described as subject to death? ",
  "mn26:9.2": "Partners and children, male and female bondservants, goats and sheep, chickens and pigs, and elephants and cattle are subject to death. ",
  "mn26:9.3": "These acquisitions are subject to death. ",
  "mn26:9.4": "Someone who is tied to, infatuated with, and has fallen for such things, themselves subject to death, seeks what is also subject to death. ",
  "mn26:10.1": "And what should be described as subject to sorrow? ",
  "mn26:10.2": "Partners and children, male and female bondservants, goats and sheep, chickens and pigs, and elephants and cattle are subject to sorrow. ",
  "mn26:10.3": "These acquisitions are subject to sorrow. ",
  "mn26:10.4": "Someone who is tied to, infatuated with, and has fallen for such things, themselves subject to sorrow, seeks what is also subject to sorrow. ",
  "mn26:11.1": "And what should be described as subject to defilement? ",
  "mn26:11.2": "Partners and children, male and female bondservants, goats and sheep, chickens and pigs, elephants and cattle, and gold and money are subject to defilement. ",
  "mn26:11.3": "These acquisitions are subject to defilement. ",
  "mn26:11.4": "Someone who is tied to, infatuated with, and has fallen for such things, themselves subject to defilement, seeks what is also subject to defilement. ",
  "mn26:11.5": "This is the ignoble quest. ",
  "mn26:12.1": "And what is the noble quest? ",
  "mn26:12.2": "It’s when someone who is themselves subject to birth, understanding the woe in being subject to birth, seeks that which is birthless, the supreme safety from the yoke, Nibbāna. Themselves subject to aging, illness, death, sorrow, and defilement, understanding the woe in being subject to these things, they seek that which is ageless, free from illness, deathless, sorrowless, and free from defilement, the supreme safety from the yoke, Nibbāna. ",
  "mn26:12.3": "This is the noble quest. ",
  "mn26:13.1": "Bhikkhus, before my awakening—when I was still unawakened but intent on awakening—I too, being subject to birth, sought what is also subject to birth. Myself subject to aging, illness, death, sorrow, and defilement, I sought what is also subject to these things. ",
  "mn26:13.2": "Then it occurred to me: ",
  "mn26:13.3": "‘Why do I, being subject to birth, aging, illness, death, sorrow, and defilement seek things of the same nature? ",
  "mn26:13.4": "Why don’t I seek that which is birthless, ageless, free from illness, deathless, sorrowless, and free from defilement, the supreme safety from the yoke, Nibbāna?’ ",
  "mn26:14.1": "Some time later, while still with pristine black hair, blessed with youth, in the prime of life—though my mother and father wished otherwise, weeping with tearful faces—I shaved off my hair and beard, dressed in ocher robes, and went forth from the lay life to homelessness. ",
  "mn26:15.1": "Once I had gone forth I set out seeking what is good, seeking the supreme state of sublime peace. I approached Āḷāra Kālāma and said to him, ",
  "mn26:15.2": "‘Friend Kālāma, I wish to lead the renunciate life in this teaching and training.’ ",
  "mn26:15.3": "Āḷāra Kālāma replied, ",
  "mn26:15.4": "‘You may do so, venerable. ",
  "mn26:15.5": "This Dhamma is such that a sensible person can soon abide having personally comprehended, realized, and entered upon their own teacher’s knowledge.’ ",
  "mn26:15.6": "I quickly learned that Dhamma. ",
  "mn26:15.7": "As far as lip-recital and oral recitation went, I spoke the doctrine of knowledge, the elder doctrine. I claimed to know and see, and so did others. ",
  "mn26:15.8": "Then it occurred to me, ",
  "mn26:15.9": "‘Not solely through faith does Āḷāra Kālāma declare that he abides having comprehended, realized, and entered upon this Dhamma. ",
  "mn26:15.10": "Surely he abides knowing and seeing this Dhamma.’ ",
  "mn26:15.11": "So I approached Āḷāra Kālāma and said to him, ",
  "mn26:15.12": "‘Friend Kālāma, to what extent do you declare that you abide having personally comprehended, realized, and entered upon this Dhamma ?’ ",
  "mn26:15.13": "When I said this, he described the field of nothingness. ",
  "mn26:15.14": "Then it occurred to me, ",
  "mn26:15.15": "‘It’s not just Āḷāra Kālāma who has faith, ",
  "mn26:15.16": "effort, ",
  "mn26:15.17": "recollection, ",
  "mn26:15.18": "composure, ",
  "mn26:15.19": "and understanding; I too have these things. ",
  "mn26:15.20": "Why don’t I make an effort to realize the same Dhamma that Āḷāra Kālāma declares that he abides having personally comprehended, realized, and entered upon? ",
  "mn26:15.21": "I quickly abided having personally comprehended, realized, and entered upon that Dhamma. ",
  "mn26:15.22": "So I approached Āḷāra Kālāma and said to him, ",
  "mn26:15.23": "‘Friend Kālāma, is it to this extent that you declare that you abide having personally comprehended, realized, and entered upon this Dhamma?’ ",
  "mn26:15.24": "‘Yes, friend.’ ",
  "mn26:15.25": "‘I too, friend, abide having personally comprehended, realized, and entered upon this Dhamma to that extent.’ ",
  "mn26:15.26": "‘We are fortunate, friend, so very fortunate ",
  "mn26:15.27": "to see a venerable such as yourself as one of our fellow renunciates! ",
  "mn26:15.28": "So the same Dhamma that I proclaim, having personally comprehended, realized, and entered upon it, you abide having personally comprehended, realized, and entered upon. ",
  "mn26:15.29": "The same Dhamma that you abide having personally comprehended, realized, and entered upon, I proclaim, having personally comprehended, realized, and entered upon it. ",
  "mn26:15.30": "So the Dhamma that I know, you know, and the Dhamma that you know, I know. ",
  "mn26:15.31": "I am like you and you are like me. ",
  "mn26:15.32": "Come now, friend! We should both lead this group together.’ ",
  "mn26:15.33": "And that is how my teacher Āḷāra Kālāma placed me, his student, on the same position as him, and honored me highly. ",
  "mn26:15.34": "Then it occurred to me, ",
  "mn26:15.35": "‘This Dhamma doesn’t lead to disenchantment, dispassion, cessation, peace, comprehension, awakening, and Nibbāna. It only leads as far as reappearance in the field of nothingness.’ ",
  "mn26:15.36": "Realizing that that Dhamma was inadequate, I left disappointed. ",
  "mn26:16.1": "I set out seeking what is good, seeking the supreme state of sublime peace. I approached Uddaka son of Rāma and said to him, ",
  "mn26:16.2": "‘Friend, I wish to lead the renunciate life in this teaching and training.’ ",
  "mn26:16.3": "Uddaka replied, ",
  "mn26:16.4": "‘You may do so, venerable. ",
  "mn26:16.5": "This Dhamma is such that a sensible person can soon abide having personally comprehended, realized, and entered upon their own teacher’s knowledge.’ ",
  "mn26:16.6": "I quickly learned that Dhamma. ",
  "mn26:16.7": "As far as lip-recital and oral recitation went, I spoke the doctrine of knowledge, the elder doctrine. I claimed to know and see, and so did others. ",
  "mn26:16.8": "Then it occurred to me, ",
  "mn26:16.9": "‘Not solely through faith did Rāma declare that he abided having comprehended, realized, and entered upon this Dhamma. ",
  "mn26:16.10": "Surely he abided knowing and seeing this Dhamma.’ ",
  "mn26:16.11": "So I approached Uddaka son of Rāma and said to him, ",
  "mn26:16.12": "‘Friend, to what extent did Rāma declare that he abided having personally comprehended, realized, and entered upon this Dhamma ?’ ",
  "mn26:16.13": "When I said this, Uddaka son of Rāma described the field of neither perception nor non-perception. ",
  "mn26:16.14": "Then it occurred to me, ",
  "mn26:16.15": "‘It’s not just Rāma who had faith, ",
  "mn26:16.16": "effort, ",
  "mn26:16.17": "recollection, ",
  "mn26:16.18": "composure, ",
  "mn26:16.19": "and understanding; I too have these things. ",
  "mn26:16.20": "Why don’t I make an effort to realize the same Dhamma that Rāma declared that he abided having personally comprehended, realized, and entered upon?’ ",
  "mn26:16.21": "I quickly abided having personally comprehended, realized, and entered upon that Dhamma. ",
  "mn26:16.22": "So I approached Uddaka son of Rāma and said to him, ",
  "mn26:16.23": "‘Friend, is it to this extent that Rāma declared that he abided having personally comprehended, realized, and entered upon this Dhamma?’ ",
  "mn26:16.24": "‘Yes, friend.’ ",
  "mn26:16.25": "‘I too, friend, abide having personally comprehended, realized, and entered upon this Dhamma to that extent.’ ",
  "mn26:16.26": "‘We are fortunate, friend, so very fortunate ",
  "mn26:16.27": "to see a venerable such as yourself as one of our fellow renunciates! ",
  "mn26:16.28": "So the same Dhamma that Rāma proclaimed, having personally comprehended, realized, and entered upon it, you abide having personally comprehended, realized, and entered upon. ",
  "mn26:16.29": "The same Dhamma that you abide having comprehended, realized, and entered upon, Rāma proclaimed, having personally comprehended, realized, and entered upon it. ",
  "mn26:16.30": "So the Dhamma that Rāma comprehended, you know, and the Dhamma you know, Rāma comprehended. ",
  "mn26:16.31": "Rāma was like you and you are like Rāma. ",
  "mn26:16.32": "Come now, friend! You should lead this group.’ ",
  "mn26:16.33": "And that is how my fellow renunciate Uddaka son of Rāma placed me in the position of a teacher and honored me highly. ",
  "mn26:16.34": "Then it occurred to me, ",
  "mn26:16.35": "‘This Dhamma doesn’t lead to disenchantment, dispassion, cessation, peace, comprehension, awakening, and Nibbāna. It only leads as far as reappearance in the field of neither-perception-nor-non-perception.’ ",
  "mn26:16.36": "Realizing that this Dhamma was inadequate, I left disappointed. ",
  "mn26:17.1": "I set out seeking what is good, seeking the supreme state of sublime peace. Traveling stage by stage in the Magadhan lands, I arrived at Senānigama in Uruvelā. ",
  "mn26:17.2": "There I saw a delightful park, a pleasant grove with a flowing river that was clean and charming, with smooth banks. And nearby was a village for alms. ",
  "mn26:17.3": "Then it occurred to me, ",
  "mn26:17.4": "‘This park is truly delightful, a pleasant grove with a flowing river that’s clean and charming, with smooth banks. And nearby there’s a village to go for alms. ",
  "mn26:17.5": "This is good enough for the striving of a clansman wanting to strive.’ ",
  "mn26:17.6": "So I sat down right there, thinking, ",
  "mn26:17.7": "‘This is good enough for striving.’ ",
  "mn26:18.1": "And so, being myself subject to birth, understanding the woe in being subject to birth, I sought that which is birthless, the supreme safety from the yoke, Nibbāna—and I achieved it. Being myself subject to aging, illness, death, sorrow, and defilement, understanding the woe in being subject to these things, I sought that which is birthless, free from illness, deathless, sorrowless, and free from defilement, the supreme safety from the yoke, Nibbāna—and I achieved it. ",
  "mn26:18.2": "knowledge-and-vision arose in me: ",
  "mn26:18.3": "‘My liberation is unshakable; this is my last birth; now there will be no renewal of being.’ ",
  "mn26:19.1": "Then it occurred to me, ",
  "mn26:19.2": "‘This Dhamma I have achieved is deep, hard to see, hard to understand, peaceful, sublime, beyond the scope of logic, subtle, to be experienced by the wise. ",
  "mn26:19.3": "But these people like attachment, they enjoy it and are happy with it. ",
  "mn26:19.4": "For these people, who like, enjoy and are happy with attachment, it is hard to see this principle; that is, dependence-upon-something, dependent origination. ",
  "mn26:19.5": "It’s also hard for them to see this principle; that is, the appeasement of all activities, the letting go of all attachments, the ending of craving, dispassion,  cessation, Nibbāna. ",
  "mn26:19.6": "And if I were to teach the Dhamma, others might not understand me, which would be wearying and troublesome for me.’ ",
  "mn26:19.7": "And then these verses, which were neither supernaturally inspired, nor learned before in the past, occurred to me: ",
  "mn26:19.8": "‘I’ve struggled hard to realize this, ",
  "mn26:19.9": "enough with trying to explain it! ",
  "mn26:19.10": "For those mired in passion and aversion ",
  "mn26:19.11": "this Dhamma is not easy to understand. ",
  "mn26:19.12": "It goes against the stream, subtle, ",
  "mn26:19.13": "deep, hard to see, and refined. ",
  "mn26:19.14": "Those besotted by passion cannot see, ",
  "mn26:19.15": "for they’re shrouded in a mass of darkness.’ ",
  "mn26:19.16": "So, as I reflected like this, my mind inclined to remaining passive, not to teaching the Dhamma. ",
  "mn26:20.1": "Then Brahmā Sahampati, knowing what I was thinking, thought, ",
  "mn26:20.2": "‘Alas! The world will be lost, the world will perish! For the mind of the Realized One, the Arahant, the fully awakened Buddha, inclines to remaining passive, not to teaching the Dhamma.’ ",
  "mn26:20.3": "Then, as easily as a strong person would extend or contract their arm, he vanished from the Brahmā realm and reappeared in front of the Buddha. ",
  "mn26:20.4": "He arranged his robe over one shoulder, raised his joined palms toward the Buddha, and said, ",
  "mn26:20.5": "‘Sir, let the Blessed One teach the Dhamma! Let the Holy One teach the Dhamma! ",
  "mn26:20.6": "There are beings with little dust in their eyes. They’re in decline because they haven’t heard the Dhamma. ",
  "mn26:20.7": "There will be those who understand the Dhamma!’ ",
  "mn26:20.8": "That’s what Brahmā Sahampati said. ",
  "mn26:20.9": "Then he went on to say: ",
  "mn26:20.10": "‘Among the Magadhans there appeared in the past ",
  "mn26:20.11": "an impure Dhamma thought up by those still stained. ",
  "mn26:20.12": "Fling open the door to the Deathless! ",
  "mn26:20.13": "Let them hear the Dhamma the immaculate one discovered. ",
  "mn26:20.14": "Just as, standing high on a rocky mountain, ",
  "mn26:20.15": "one would see the people all around, ",
  "mn26:20.16": "so too, All-seer, wise one, ",
  "mn26:20.17": "having ascended to the Palace of Truth, ",
  "mn26:20.18": "rid of sorrow, look upon the people ",
  "mn26:20.19": "swamped with sorrow,  overcome by birth and old age. ",
  "mn26:20.20": "Rise, hero! Victor in battle, ",
  "mn26:20.21": "leader of the caravan, wander the world free of debt. ",
  "mn26:20.22": "Let the Blessed One teach the Dhamma! ",
  "mn26:20.23": "There will be those who understand!’ ",
  "mn26:21.1": "Then, knowing Brahmā’s invitation, and out of compassion for beings, I surveyed the world with the Buddha-eye. ",
  "mn26:21.2": "And I saw sentient beings with little dust in their eyes, and some with much dust in their eyes; with sharp faculties and with weak faculties, with good qualities and with bad qualities, easy to teach and hard to teach. And some of them lived seeing the danger and fault related to the next world, and others not. ",
  "mn26:21.3": "It’s like a pool with blue water lilies, or pink or white lotuses. Some of them sprout and grow in the water without rising above it, thriving underwater. Some of them sprout and grow in the water reaching the water’s surface. And some of them sprout and grow in the water but rise up above the water and stand with no water clinging to them. ",
  "mn26:21.4": "In the same way, I saw sentient beings with little dust in their eyes, and some with much dust in their eyes. ",
  "mn26:21.5": "Then I replied in verse to Brahmā Sahampati: ",
  "mn26:21.6": "‘Flung open are the doors to the Deathless! ",
  "mn26:21.7": "Let those with ears to hear show faith. ",
  "mn26:21.8": "Perceiving trouble, Brahmā, I did not teach ",
  "mn26:21.9": "the excellent, sublime Dhamma among humans.’ ",
  "mn26:21.10": "Then Brahmā Sahampati, knowing that his request for me to teach the Dhamma had been granted, bowed and respectfully circled me, keeping me on his right, before vanishing right there. ",
  "mn26:22.1": "Then I thought, ",
  "mn26:22.2": "‘Who should I teach first of all? ",
  "mn26:22.3": "Who will quickly understand this Dhamma?’ ",
  "mn26:22.4": "Then it occurred to me, ",
  "mn26:22.5": "‘That Āḷāra Kālāma is wise, competent, clever, and has long had little dust in his eyes. ",
  "mn26:22.6": "Why don’t I teach him first of all? ",
  "mn26:22.7": "He’ll very quickly understand this Dhamma.’ ",
  "mn26:22.8": "But a deity came to me and said, ",
  "mn26:22.9": "‘Sir, Āḷāra Kālāma passed away seven days ago.’ ",
  "mn26:22.10": "And knowledge-and-vision arose in me, ",
  "mn26:22.11": "‘Āḷāra Kālāma passed away seven days ago.’ ",
  "mn26:22.12": "I thought, ",
  "mn26:22.13": "‘This is a great loss for Āḷāra Kālāma. ",
  "mn26:22.14": "If he had heard the Dhamma, he would have understood it very quickly.’ ",
  "mn26:23.1": "Then I thought, ",
  "mn26:23.2": "‘Who should I teach first of all? ",
  "mn26:23.3": "Who will quickly understand this Dhamma?’ ",
  "mn26:23.4": "Then it occurred to me, ",
  "mn26:23.5": "‘That Uddaka son of Rāma is wise, competent, clever, and has long had little dust in his eyes. ",
  "mn26:23.6": "Why don’t I teach him first of all? ",
  "mn26:23.7": "He’ll very quickly understand the Dhamma.’ ",
  "mn26:23.8": "But a deity came to me and said, ",
  "mn26:23.9": "‘Sir, Uddaka son of Rāma passed away just last night.’ ",
  "mn26:23.10": "And knowledge-and-vision arose in me, ",
  "mn26:23.11": "‘Uddaka son of Rāma passed away just last night.’ ",
  "mn26:23.12": "I thought, ",
  "mn26:23.13": "‘This is a great loss for Uddaka. ",
  "mn26:23.14": "If he had heard the Dhamma, he would have understood it very quickly.’ ",
  "mn26:24.1": "Then I thought, ",
  "mn26:24.2": "‘Who should I teach first of all? ",
  "mn26:24.3": "Who will quickly understand this Dhamma?’ ",
  "mn26:24.4": "Then it occurred to me, ",
  "mn26:24.5": "‘The group of five bhikkhus were very helpful to me. They looked after me during my time of resolute striving. ",
  "mn26:24.6": "Why don’t I teach them first of all?’ ",
  "mn26:24.7": "Then I thought, ",
  "mn26:24.8": "‘Where are the group of five bhikkhus staying these days?’ ",
  "mn26:24.9": "With the divine eye that is purified and superhuman I saw that the group of five bhikkhus were staying near Varanasi, in the deer park at Isipatana. ",
  "mn26:24.10": "So, when I had stayed in Uruvelā as long as I pleased, I set out for Varanasi. ",
  "mn26:25.1": "While I was traveling along the road between Gayā and Bodhgaya, the Ājīvaka ascetic Upaka saw me ",
  "mn26:25.2": "and said, ",
  "mn26:25.3": "‘Friend, your faculties are so very clear, and your complexion is pure and bright. ",
  "mn26:25.4": "In whose name have you gone forth, friend? Who is your Teacher? Whose Dhamma do you approve of?’ ",
  "mn26:25.5": "I replied to Upaka in verse: ",
  "mn26:25.6": "‘I am the champion, the knower of all, ",
  "mn26:25.7": "unsullied in the midst of all phenomena. ",
  "mn26:25.8": "I’ve given up all, freed through the ending of craving. ",
  "mn26:25.9": "Since I have understood for myself, whose follower should I be? ",
  "mn26:25.10": "I have no teacher. ",
  "mn26:25.11": "There is no-one like me. ",
  "mn26:25.12": "In the world with its gods, ",
  "mn26:25.13": "I have no rival. ",
  "mn26:25.14": "For in this world, I am the Arahant; ",
  "mn26:25.15": "I am the supreme Teacher. ",
  "mn26:25.16": "I alone am fully awakened, ",
  "mn26:25.17": "cooled, quenched. ",
  "mn26:25.18": "I am going to the city of Kāsi ",
  "mn26:25.19": "to roll forth the Wheel of Dhamma. ",
  "mn26:25.20": "In this world that is so blind, ",
  "mn26:25.21": "I’ll beat the drum of the Deathless!’ ",
  "mn26:25.22": "‘According to what you claim, friend, you ought to be the Infinite Victor.’ ",
  "mn26:25.23": "‘The victors are those who, like me, ",
  "mn26:25.24": "have reached the exhaustion of influxes. ",
  "mn26:25.25": "I have defeated evil things, Upaka—",
  "mn26:25.26": "that’s why I’m a victor.’ ",
  "mn26:25.27": "When I had spoken, Upaka said: ‘If you say so, friend.’ Shaking his head, he took a wrong path and left. ",
  "mn26:26.1": "Traveling stage by stage, I arrived at Varanasi, and went to see the group of five bhikkhus in the deer park at Isipatana. ",
  "mn26:26.2": "The group of five bhikkhus saw me coming off in the distance ",
  "mn26:26.3": "and stopped each other, saying, ",
  "mn26:26.4": "‘Here comes the ascetic Gotama who is indulgent, who strayed from striving and returned to indulgence. ",
  "mn26:26.5": "We shouldn’t bow to him or rise for him or receive his bowl and robe. ",
  "mn26:26.6": "But we can set out a seat; he can sit if he likes.’ ",
  "mn26:26.7": "Yet as I drew closer, the group of five bhikkhus were unable to stop themselves as they had agreed. ",
  "mn26:26.8": "Some came out to greet me and receive my bowl and robe, some spread out a seat, while others set out water for washing my feet. ",
  "mn26:26.9": "But they still addressed me by name and as ‘friend’. ",
  "mn26:27.1": "So I said to them, ",
  "mn26:27.2": "‘Bhikkhus, don’t address me by name and as ‘friend’. ",
  "mn26:27.3": "The Realized One is perfected, a fully awakened Buddha. ",
  "mn26:27.4": "Listen, bhikkhus: the Deathless has been achieved. I shall instruct you, I will teach you the Dhamma. ",
  "mn26:27.5": "By practicing as instructed you will soon abide having personally comprehended, realized, and entered upon right in the present experience the supreme goal of the renunciate life for which clansmen rightly go forth from the lay life into to homelessness.’ ",
  "mn26:27.6": "But they said to me, ",
  "mn26:27.7": "‘Friend Gotama, even by that conduct, that way, that grueling practice you did not achieve any superhuman distinction in knowledge-and-vision worthy of the noble ones. How could you have achieved such a state now that you’ve become indulgent, strayed from striving and returned to indulgence?’ ",
  "mn26:27.8": "So I said to them, ",
  "mn26:27.9": "‘The Realized One has not become indulgent, strayed from striving and returned to indulgence. ",
  "mn26:27.10": "The Realized One is an Arahant, a fully awakened Buddha. ",
  "mn26:27.11": "Listen, bhikkhus: the Deathless has been achieved. I shall instruct you, I will teach you the Dhamma. ",
  "mn26:27.12": "By practicing as instructed you will soon abide having personally comprehended, realized, and entered upon right in the present experience the supreme goal of the renunciate life for which clansmen rightly go forth from the lay life into to homelessness.’ ",
  "mn26:27.13": "But for a second time they said to me, ",
  "mn26:27.14": "‘Friend Gotama … you’ve returned to indulgence.’ ",
  "mn26:27.15": "So for a second time I said to them, ",
  "mn26:27.16": "‘The Realized One has not become indulgent …’ ",
  "mn26:27.17": "",
  "mn26:27.18": "But for a third time they said to me, ",
  "mn26:27.19": "‘Friend Gotama, even by that conduct, that way, that grueling practice you did not achieve any superhuman distinction in knowledge-and-vision worthy of the noble ones. How could you have achieved such a state now that you’ve become indulgent, strayed from striving and returned to indulgence?’ ",
  "mn26:28.1": "So I said to them, ",
  "mn26:28.2": "‘Bhikkhus, have you ever known me to speak like this before?’ ",
  "mn26:28.3": "‘No, Bhante, we have not.’ ",
  "mn26:28.4": "‘The Realized One is perfected, a fully awakened Buddha. ",
  "mn26:28.5": "Listen, bhikkhus: the Deathless has been achieved. I shall instruct you, I will teach you the Dhamma. ",
  "mn26:28.6": "By practicing as instructed you will soon abide having personally comprehended, realized, and entered upon right in the present experience the supreme goal of the renunciate life for which clansmen rightly go forth from the lay life into to homelessness.’ ",
  "mn26:29.1": "I was able to persuade the group of five bhikkhus. ",
  "mn26:29.2": "Then sometimes I advised two bhikkhus, while the other three went for alms. ",
  "mn26:29.3": "Then those three would feed all six of us with what they brought back. ",
  "mn26:29.4": "Sometimes I advised three bhikkhus, while the other two went for alms. ",
  "mn26:29.5": "Then those two would feed all six of us with what they brought back. ",
  "mn26:30.1": "As the group of five bhikkhus were being advised and instructed by me like this, being themselves subject to birth , understanding the woe in being subject to birth, they sought that which is birthless, the supreme safety from the yoke, Nibbāna—and they achieved it. Being themselves subject to aging, illness, death, sorrow, and defilement, understanding the woe in being subject to these things, they sought that which is ageless, free from illness, deathless, sorrowless, and free from defilement, the supreme safety from the yoke, Nibbāna—and they achieved it. ",
  "mn26:30.2": "knowledge-and-vision arose in them: ",
  "mn26:30.3": "‘Our liberation is unshakable; this is our last birth; now there will be no renewal of being.’ ",
  "mn26:31.1": "Bhikkhus, there are these five strands of sensuality. ",
  "mn26:31.2": "What five? ",
  "mn26:31.3": "Forms cognizable by the eye that are likable, desirable, agreeable, pleasing, sensual, and enticing. ",
  "mn26:31.4": "Sounds known by the ear … ",
  "mn26:31.5": "Smells known by the nose … ",
  "mn26:31.6": "Tastes known by the tongue … ",
  "mn26:31.7": "Touches known by the body that are likable, desirable, agreeable, pleasant, sensual, and enticing. ",
  "mn26:31.8": "These are the five kinds of sensual stimulation. ",
  "mn26:32.1": "There are ascetics and brahmins who partake in these five strands of sensuality tied, infatuated, having fallen for them, not seeing their woe, and not understanding the escape. You should understand that they ",
  "mn26:32.2": "have met with calamity and disaster, and the Wicked One can do with them what he wants. ",
  "mn26:32.3": "Suppose a deer in the wilderness was lying caught on a heap of snares. ",
  "mn26:32.4": "You’d know that it ",
  "mn26:32.5": "has met with calamity and disaster, and the hunter can do with it what he wants. ",
  "mn26:32.6": "And when the hunter comes, it cannot flee where it wants. ",
  "mn26:32.7": "In the same way, there are ascetics and brahmins who partake in these five strands of sensuality tied to them, infatuated with them, and having fallen for them, not seeing their woe, and not understanding the escape. You should understand that they ",
  "mn26:32.8": "have met with calamity and disaster, and the Wicked One can do with them what he wants. ",
  "mn26:33.1": "There are ascetics and brahmins who partake in these five strands of sensuality without being tied to them, infatuated with them, or having fallen for them, seeing their woe, and understanding the escape. You should understand that they ",
  "mn26:33.2": "haven’t met with calamity and disaster, and the Wicked One cannot do what he wants with them. ",
  "mn26:33.3": "Suppose a deer in the wilderness was lying on a heap of snares without being caught. ",
  "mn26:33.4": "You’d know that it ",
  "mn26:33.5": "hasn’t met with calamity and disaster, and the hunter cannot do what he wants with it. ",
  "mn26:33.6": "And when the hunter comes, it can flee where it wants. ",
  "mn26:33.7": "In the same way, there are ascetics and brahmins who partake in these five strands of sensuality without being tied to them, infatuated with them, or having fallen for them, seeing their woe, and understanding the escape. You should understand that they ",
  "mn26:33.8": "haven’t met with calamity and disaster, and the Wicked One cannot do what he wants with them. ",
  "mn26:34.1": "Suppose there was a wild deer wandering in the forest that walked, stood, sat, and laid down in confidence. ",
  "mn26:34.2": "Why is that? ",
  "mn26:34.3": "Because it’s out of the hunter’s range. ",
  "mn26:34.4": "In the same way, a bhikkhu, quite separated from sensuality, separated from detrimental phenomena, with thinking and with pondering, with joy and ease born of separation, abides having entered upon the first jhāna. ",
  "mn26:34.5": "This is called a bhikkhu who has blinded Māra, put out his eyes without a trace, and gone where the Wicked One cannot see. ",
  "mn26:35.1": "Furthermore, with the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and ease born of composure, a bhikkhu abides having entered upon second jhāna. ",
  "mn26:35.2": "This is called a bhikkhu who has blinded Māra … ",
  "mn26:36.1": "Furthermore, with the fading of joy, a bhikkhu abides equanimous, recollected, and aware, and experiencing ease with the body. He abides having entered upon the third jhāna, regarding which the noble ones say “one abides equanimous, recollected and at ease.” ",
  "mn26:36.2": "This is called a bhikkhu who has blinded Māra … ",
  "mn26:37.1": "Furthermore, with the giving up of ease and unease—and with the ending of happiness and sadness beforehand—without ease or unease, with purity of equanimity and recollection, a bhikkhu abides having entered upon the fourth jhāna. ",
  "mn26:37.2": "This is called a bhikkhu who has blinded Māra … ",
  "mn26:38.1": "Furthermore, a bhikkhu, having fully surmounted perceptions of form, with the ending of perceptions of resistance, not attending to perceptions of diversity, aware that ‘space is infinite’, abides having entered upon the field of infinite space. ",
  "mn26:38.2": "This is called a bhikkhu who has blinded Māra … ",
  "mn26:39.1": "Furthermore, a bhikkhu, having fully surmounted the field of infinite space, aware that ‘consciousness is infinite’, abides having entered upon the field of infinite consciousness. ",
  "mn26:39.2": "This is called a bhikkhu who has blinded Māra … ",
  "mn26:40.1": "Furthermore, a bhikkhu, having fully surmounted the field of infinite consciousness, aware that ‘there is nothing at all’, abides having entered upon the field of nothingness. ",
  "mn26:40.2": "This is called a bhikkhu who has blinded Māra … ",
  "mn26:41.1": "Furthermore, a bhikkhu, having fully surmounted the field of nothingness, abides having entered upon the field of neither perception nor non-perception. ",
  "mn26:41.2": "This is called a bhikkhu who has blinded Māra … ",
  "mn26:42.1": "Furthermore, a bhikkhu, having fully surmounted the field of neither perception nor non-perception, abides having entered upon the cessation of perception-and-feeling. And, having seen with understanding, his influxes are exhausted. ",
  "mn26:42.2": "This is called a bhikkhu who has blinded Māra, put out his eyes without a trace, and gone where the Wicked One cannot see. ",
  "mn26:42.3": "He’s crossed over attachment to the world. And he walks, stands, sit, and lies down in confidence. ",
  "mn26:42.4": "Why is that? ",
  "mn26:42.5": "Because he’s out of the Wicked One’s range.” ",
  "mn26:42.6": "That is what the Buddha said. ",
  "mn26:42.7": "Pleased, the bhikkhus delighted in what the Buddha said. "
}