{
    "mn27:0.1": "Middle Discourses 27 ",
    "mn27:0.2": "The Shorter Simile of the Elephant’s Footprint ",
    "mn27:1.1": "So I have heard. ",
    "mn27:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
    "mn27:2.1": "Now at that time the brahmin Jānussoṇi drove out from Sāvatthī in the middle of the day in an all-white chariot drawn by mares. ",
    "mn27:2.2": "He saw the wanderer Pilotika coming off in the distance, ",
    "mn27:2.3": "and said to him, ",
    "mn27:2.4": "“So, Master Vacchāyana, where are you coming from in the middle of the day?” ",
    "mn27:2.5": "“Just now, good sir, I’ve come from the presence of the ascetic Gotama.” ",
    "mn27:2.6": "“What do you think of the ascetic Gotama’s lucidity of understanding? Do you think he’s wise?” ",
    "mn27:2.7": "“My good man, who am I to judge the ascetic Gotama’s lucidity of understanding? ",
    "mn27:2.8": "You’d really have to be on the same level to judge his lucidity of understanding.” ",
    "mn27:2.9": "“Master Vacchāyana praises the ascetic Gotama with lofty praise indeed.” ",
    "mn27:2.10": "“Who am I to praise the ascetic Gotama? ",
    "mn27:2.11": "He is praised by the praised as the first among gods and humans.” ",
    "mn27:2.12": "“But for what reason are you so devoted to the ascetic Gotama?” ",
    "mn27:3.1": "“Suppose that a skilled bull elephant tracker was to enter a bull elephant wood. ",
    "mn27:3.2": "There he’d see a large elephant’s footprint, long and broad. ",
    "mn27:3.3": "He would come to the conclusion, ",
    "mn27:3.4": "‘This must be a big bull elephant.’ ",
    "mn27:3.5": "In the same way, because I saw four footprints of the ascetic Gotama I came to the conclusion, ",
    "mn27:3.6": "‘The Blessed One is a fully awakened Buddha. The teaching is well explained. The Saṅgha is practicing well.’ ",
    "mn27:4.1": "What four? ",
    "mn27:4.2": "Firstly, I see some wise aristocrats who are astute, accomplished in the doctrines of others, hair-splitters. You’d think they live to demolish views with their understanding. ",
    "mn27:4.3": "They hear, ",
    "mn27:4.4": "‘So, gentlemen, that ascetic Gotama will come down to such and such village or town.’ ",
    "mn27:4.5": "They formulate a question, thinking, ",
    "mn27:4.6": "‘We’ll approach the ascetic Gotama and ask him this question. ",
    "mn27:4.7": "If he answers like this, we’ll refute him like that; ",
    "mn27:4.8": "and if he answers like that, we’ll refute him like this.’ ",
    "mn27:4.9": "When they hear that ",
    "mn27:4.10": "he has come down ",
    "mn27:4.11": "they approach him. ",
    "mn27:4.12": "The ascetic Gotama instructs, encourages, fires up, and inspires them with a Dhamma talk. ",
    "mn27:4.13": "They don’t even get around to asking their question to the ascetic Gotama, so how could they refute his answer? ",
    "mn27:4.14": "Invariably, they become his disciples. ",
    "mn27:4.15": "When I saw this first footprint of the ascetic Gotama, I came to the conclusion, ",
    "mn27:4.16": "‘The Blessed One is a fully awakened Buddha. The teaching is well explained. The Saṅgha is practicing well.’ ",
    "mn27:5.1": "Furthermore, I see some wise brahmins … ",
    "mn27:6.1": "some wise householders … ",
    "mn27:6.2": "they become his disciples. ",
    "mn27:7.1": "Furthermore, I see some wise ascetics who are astute, accomplished in the doctrines of others, hair-splitters … ",
    "mn27:7.2": " ",
    "mn27:7.3": " ",
    "mn27:7.4": " ",
    "mn27:7.5": " ",
    "mn27:7.6": " ",
    "mn27:7.7": " ",
    "mn27:7.8": " ",
    "mn27:7.9": " ",
    "mn27:7.10": "They don’t even get around to asking their question to the ascetic Gotama, so how could they refute his answer? ",
    "mn27:7.11": "Invariably, they ask the ascetic Gotama for the chance to go forth. ",
    "mn27:7.12": "And he gives them the going-forth. ",
    "mn27:7.13": "Soon after going forth, abiding withdrawn, heedful, diligent, and resolute, they abide having entered upon the supreme goal of the renunciate life  for which clansmen rightly go forth from the lay life to homelessness, having personally comprehended and realized it right in the present experience. ",
    "mn27:7.14": "They say, ",
    "mn27:7.15": "‘We were almost lost! We almost perished! ",
    "mn27:7.16": "For we used to claim that we were ascetics, brahmins, and Arahants, but we were none of these things. ",
    "mn27:7.17": "But now we really are ascetics, brahmins, and Arahants!’ ",
    "mn27:7.18": "When I saw this fourth footprint of the ascetic Gotama, I came to the conclusion, ",
    "mn27:7.19": "‘The Blessed One is a fully awakened Buddha. The teaching is well explained. The Saṅgha is practicing well.’ ",
    "mn27:7.20": "It’s because I saw these four footprints of the ascetic Gotama that I came to the conclusion, ",
    "mn27:7.21": "‘The Blessed One is a fully awakened Buddha. The teaching is well explained. The Saṅgha is practicing well.’” ",
    "mn27:8.1": "When he had spoken, Jānussoṇi got down from his chariot, arranged his robe over one shoulder, raised his joined palms towards the Buddha, and expressed this heartfelt sentiment three times: ",
    "mn27:8.2": "“Homage to that Blessed One, the Arahant, the fully awakened Buddha! ",
    "mn27:8.3": "Homage to that Blessed One, the Arahant, the fully awakened Buddha! ",
    "mn27:8.4": "Homage to that Blessed One, the Arahant, the fully awakened Buddha! ",
    "mn27:8.5": "Hopefully, some time or other I’ll get to meet Master Gotama, and we can have a discussion.” ",
    "mn27:9.1": "Then the brahmin Jānussoṇi went up to the Buddha, and exchanged pleasantries with him. ",
    "mn27:9.2": "When the amicable and cordial talk was over, he sat down to one side, ",
    "mn27:9.3": "and informed the Buddha of all he had discussed with the wanderer Pilotika. ",
    "mn27:9.4": "When he had spoken, the Buddha said to him, ",
    "mn27:9.5": "“Brahmin, the simile of the elephant’s footprint is not yet completed in detail. ",
    "mn27:9.6": "As to how it is completed in detail, ",
    "mn27:9.7": "listen and apply your mind well, I will speak.” ",
    "mn27:9.8": "“Yes sir,” Jānussoṇi replied. ",
    "mn27:9.9": "The Buddha said this: ",
    "mn27:10.1": "“Suppose a bull elephant tracker were to enter a bull elephant wood. ",
    "mn27:10.2": "There he’d see a large elephant’s footprint, long and broad. ",
    "mn27:10.3": "A skilled bull elephant tracker does not yet come to the conclusion, ",
    "mn27:10.4": "‘This must be a big bull elephant.’ ",
    "mn27:10.5": "Why not? ",
    "mn27:10.6": "Because in an elephant wood there are dwarf cow elephants with big footprints, and this footprint might be one of theirs. ",
    "mn27:10.7": " ",
    "mn27:10.8": "he keeps following the track until he sees a big footprint, long and broad, and traces high up. ",
    "mn27:10.9": "A skilled bull elephant tracker does not yet come to the conclusion, ",
    "mn27:10.10": "‘This must be a big bull elephant.’ ",
    "mn27:10.11": "Why not? ",
    "mn27:10.12": "Because in an elephant wood, there are tall lofty cow elephants with big footprints, and this footprint might be one of theirs. ",
    "mn27:10.13": " ",
    "mn27:10.14": "he keeps following the track until he sees a big footprint, long and broad, and traces and tusk-marks high up. ",
    "mn27:10.15": "A skilled bull elephant tracker does not yet come to the conclusion, ",
    "mn27:10.16": "‘This must be a big bull elephant.’ ",
    "mn27:10.17": "Why not? ",
    "mn27:10.18": "Because in an elephant wood, there are tall matriarch cow elephants with big footprints, and this footprint might be one of theirs. ",
    "mn27:10.19": " ",
    "mn27:10.20": "he keeps following the track until he sees a big footprint, long and broad, and traces, tusk-marks, and broken branches high up. ",
    "mn27:10.21": "And he sees that bull elephant walking, standing, sitting, or lying down at the root of a tree or in the open. ",
    "mn27:10.22": "Then he’d come to the conclusion, ",
    "mn27:10.23": "‘This is that big bull elephant.’ ",
    "mn27:11.1": "In the same way, brahmin, a Realized One arises in the world, an Arahant, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed. ",
    "mn27:11.2": "Having personally comprehended and realized this world—with its gods, Māras and Brahmās, this population with its ascetics and brahmins, gods and humans—he makes it known to others. ",
    "mn27:11.3": "He teaches Dhamma that’s good in the beginning, good in the middle, and good in the end, meaningful and well-phrased. And he reveals a renunciate life that’s entirely complete and pure. ",
    "mn27:12.1": "A householder hears that teaching, or a householder’s son, or someone born in a good family. ",
    "mn27:12.2": "he gains faith in the Realized One, ",
    "mn27:12.3": "and considers, ",
    "mn27:12.4": "‘Household life is confined and dusty, but the life of one gone forth is wide open. ",
    "mn27:12.5": "It’s not easy for someone living at home to lead the renunciate life utterly full and pure, like a polished shell. ",
    "mn27:12.6": "Why don’t I shave off my hair and beard, dress in ocher robes, and go forth from the lay life to homelessness?’ ",
    "mn27:12.7": "After some time, he gives up a large or small fortune and a large or small family circle. He shaves off hair and beard, dresses in ocher robes, and goes forth from the lay life to homelessness. ",
    "mn27:13.1": "Once he’s gone forth, he takes up the training and livelihood of the bhikkhus. He gives up killing living creatures, renouncing the rod and the sword. He’s scrupulous and kind, living  compassionate for the welfare of all creatures and beings. ",
    "mn27:13.2": "He gives up stealing. He takes only what’s given, and expects only what’s given. He keeps himself clean by not thieving. ",
    "mn27:13.3": "He gives up incelibacy. He is celibate, set apart, avoiding the vulgar act of sex. ",
    "mn27:13.4": "He gives up lying. He speaks the truth and sticks to the truth. He’s honest and trustworthy, and doesn’t trick the world with his words. ",
    "mn27:13.5": "He gives up divisive speech. He doesn’t repeat in one place what he heard in another to divide people against each other. Instead, he reconciles those who are divided, supporting unity, delighting in harmony, loving harmony, and speaking words that promote harmony. ",
    "mn27:13.6": "He gives up harsh speech. He speaks in a way that’s gentle, pleasing to the ear, affectionate, going to the heart, polite, likable, and agreeable to the people. ",
    "mn27:13.7": "He gives up frivolous speech. His words are timely, true, and meaningful, in line with the teaching and training. He says things at the right time which are valuable, reasonable, succinct, and beneficial. ",
    "mn27:13.8": "He avoids violence towards plants and seeds. ",
    "mn27:13.9": "He eats in one part of the day, abstaining from eating at night and at the wrong time. ",
    "mn27:13.10": "He avoids seeing shows of dancing, singing, and music. ",
    "mn27:13.11": "He avoids beautifying and adorning themselves with garlands, perfumes, and makeup. ",
    "mn27:13.12": "He avoids high and luxurious beds. ",
    "mn27:13.13": "He avoids receiving gold and money, ",
    "mn27:13.14": "raw grains, ",
    "mn27:13.15": "raw meat, ",
    "mn27:13.16": "women and girls, ",
    "mn27:13.17": "male and female bondservants, ",
    "mn27:13.18": "goats and sheep, ",
    "mn27:13.19": "chickens and pigs, ",
    "mn27:13.20": "elephants, cows, horses, and mares, ",
    "mn27:13.21": "and fields and land. ",
    "mn27:13.22": "He avoids running errands and messages; ",
    "mn27:13.23": "buying and selling; ",
    "mn27:13.24": "falsifying weights, metals, or measures; ",
    "mn27:13.25": "bribery, fraud, cheating, and duplicity; ",
    "mn27:13.26": "mutilation, murder, abduction, banditry, plunder, and violence. ",
    "mn27:14.1": "He’s content with robes to look after the body and almsfood to look after the belly. Wherever he goes, he sets out taking only these things. ",
    "mn27:14.2": "He’s like a bird: wherever it flies, wings are its only burden. ",
    "mn27:14.3": "In the same way, a bhikkhu is content with robes to look after the body and almsfood to look after the belly. Wherever he goes, he sets out taking only these things. ",
    "mn27:14.4": "When he has this noble aggregate of virtue, he experiences a blameless ease internally. ",
    "mn27:15.1": "Having seen a sight with the eye, he doesn’t grasp at signs and features of it ",
    "mn27:15.2": "on account of which—due to abiding with the eye faculty unrestrained—harmful, detrimental phenomena of longing and upset would flow in on him. He practices to restrain that; he guards the eye faculty and brings about the restraint of the eye faculty. ",
    "mn27:15.3": "Having heard a sound with the ear … ",
    "mn27:15.4": "Having smelled an odor with the nose … ",
    "mn27:15.5": "Having tasted a flavor with the tongue … ",
    "mn27:15.6": "Having touched a touch with the body … ",
    "mn27:15.7": "Having cognized a phenomenon with the mind-sense, he doesn’t grasp at signs and features of it ",
    "mn27:15.8": "on account of which—due to abiding with the mind-sense faculty unrestrained—harmful, detrimental phenomena of longing and upset would flow in on him. He practices to restrain that; he guards the mind-sense faculty and brings about the restraint of the mind-sense faculty. ",
    "mn27:15.9": "When he has this noble sense restraint, he experiences an unsullied ease internally. ",
    "mn27:16.1": "He acts with comprehension when going out and coming back; when looking ahead and aside; when bending and extending the limbs; when bearing the outer robe, bowl and robes; when eating, drinking, chewing, and tasting; when urinating and defecating; when walking, standing, sitting, sleeping, waking, speaking, and keeping silent. ",
    "mn27:17.1": "When he has this noble aggregate of virtue, this noble contentment, this noble sense restraint, and this noble recollection and comprehension, ",
    "mn27:17.2": "he frequents a secluded lodging—a wilderness, the root of a tree, a hill, a ravine, a mountain cave, a charnel ground, a forest, the open air, a heap of straw. ",
    "mn27:18.1": "After the meal, he returns from almsround, sits down cross-legged, sets his body straight, and establishes recollection at the fore. ",
    "mn27:18.2": "Giving up longing with regard to the world, he abides with a mind rid of longing; he cleanses the mind of longing. ",
    "mn27:18.3": "Giving up aversion and hatred, he abides with a mind rid of aversion, compassionate for the welfare of all creatures and beings; he cleanses the mind of aversion and hatred. ",
    "mn27:18.4": "Giving up indolence and lethargy, he abides with a mind rid of indolence and lethargy, perceiving light, recollected, and comprehending; he cleanses the mind of indolence and lethargy. ",
    "mn27:18.5": "Giving up restlessness and anxiety, he abides without restlessness, his mind internally appeased; he cleanses the mind of restlessness and anxiety. ",
    "mn27:18.6": "Giving up doubt, he abides having gone beyond doubt, not uncertain about beneficial qualities; he cleanses the mind of doubt. ",
    "mn27:19.1": "He gives up these five hindrances, defilements of the mind that weaken understanding. ",
    "mn27:19.2": "Then, quite separated from sensuality, separated from detrimental phenomena, with thinking and with pondering, with joy and ease born of separation, he abides having entered upon the first jhāna. ",
    "mn27:19.3": "This, brahmin, is that which is called ‘a footprint of the Realized One’ and also ‘a trace of the Realized One’ and also ‘a mark of the Realized One’. ",
    "mn27:19.4": "But a noble disciple does not yet come to the conclusion, ",
    "mn27:19.5": "‘The Blessed One is a fully awakened Buddha. The teaching is well explained. The Saṅgha is practicing well.’ ",
    "mn27:20.1": "Furthermore, with the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and ease born of composure, a bhikkhu abides having entered upon the second jhāna. ",
    "mn27:20.2": "This too is what is called ‘a footprint of the Realized One’ … ",
    "mn27:20.3": " ",
    "mn27:21.1": "Furthermore, with the fading of joy, he abides equanimous, recollected and comprehending, and experiencing ease with the body. The bhikkhu abides having entered upon the third jhāna, regarding which the noble ones say “one abides equanimous, recollected and at ease.’ ",
    "mn27:21.2": "This too is what is called ‘a footprint of the Realized One’ … ",
    "mn27:21.3": " ",
    "mn27:22.1": "Furthermore, with the giving up of ease and unease—and with the ending of happiness and sadness beforehand—without ease or unease, with purity of equanimity and recollection, a bhikkhu abides having entered upon the fourth jhāna. ",
    "mn27:22.2": "This too is what is called ‘a footprint of the Realized One’ … ",
    "mn27:22.3": "",
    "mn27:22.4": "",
    "mn27:23.1": "When his mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he extends it towards the recollection of past lives. ",
    "mn27:23.2": "He recollects many kinds of past lives, that is, one, two, three, four, five, ten, twenty, thirty, forty, fifty, a hundred, a thousand, a hundred thousand births; many eons of the world contracting, many eons of the world expanding, many eons of the world contracting and expanding … He recollects his many kinds of past lives, with features and details. ",
    "mn27:23.3": "This too is what is called ‘a footprint of the Realized One’ … ",
    "mn27:23.4": " ",
    "mn27:23.5": " ",
    "mn27:24.1": "When his mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he extends it towards the knowledge of the passing away and reappearance of beings. ",
    "mn27:24.2": "With divine eye that is purified and superhuman... he understands how sentient beings are reborn according to their deeds. ",
    "mn27:24.3": "This too is what is called ‘a footprint of the Realized One’ … ",
    "mn27:24.4": " ",
    "mn27:24.5": " ",
    "mn27:25.1": "When his mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he extends it towards the knowledge of the exhaustion of the influxes. ",
    "mn27:25.2": "He understands as it is: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering.’ ",
    "mn27:25.3": "He understands as it is: ‘These are influxes’ … ‘This is the origin of influxes’ … ‘This is the cessation of influxes’ … ‘This is the practice that leads to the cessation of influxes.’ ",
    "mn27:25.4": "This, brahmin, is what is called ‘a footprint of the Realized One’ and also ‘a trace of the Realized One’ and also ‘a mark of the Realized One’. ",
    "mn27:25.5": "At this point a noble disciple has not yet come to a conclusion, but they are coming to the conclusion, ",
    "mn27:25.6": "‘The Blessed One is a fully awakened Buddha. The teaching is well explained. The Saṅgha is practicing well.’ ",
    "mn27:26.1": "Knowing and seeing like this, his mind is liberated from the influxes of sensuality, being, and ignorance. ",
    "mn27:26.2": "When it’s liberated, he knows it’s liberated. ",
    "mn27:26.3": "He understands: ‘Birth is exhausted, the renunciate life has been lived, what had to be done has been done, there will be no more of this.’ ",
    "mn27:26.4": "This, brahmin, is what is called ‘a footprint of the Realized One’ and also ‘a trace of the Realized One’ and also ‘a mark of the Realized One’. ",
    "mn27:26.5": "At this point a noble disciple has come to the conclusion, ",
    "mn27:26.6": "‘The Blessed One is a fully awakened Buddha. The teaching is well explained. The Saṅgha is practicing well.’ ",
    "mn27:26.7": "And it is at this point that the simile of the elephant’s footprint has been completed in detail.” ",
    "mn27:27.1": "When he had spoken, the brahmin Jānussoṇi said to the Buddha, ",
    "mn27:27.2": "“Excellent, Master Gotama! Excellent! ",
    "mn27:27.3": "As if he were righting the overturned, or revealing the hidden, or pointing out the path to the lost, or lighting a lamp in the dark so people with good eyesight can see what’s there, Master Gotama has made the teaching clear in many ways. ",
    "mn27:27.4": "I go for refuge to Master Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. ",
    "mn27:27.5": "From this day forth, may Master Gotama remember me as a lay follower who has gone for refuge for life.” "
}