{
  "mn28:0.1": "Middle Discourses 28 ",
  "mn28:0.2": "The Longer Simile of the Elephant’s Footprint ",
  "mn28:1.1": "So I have heard. ",
  "mn28:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
  "mn28:1.3": "There Venerable Sāriputta addressed the bhikkhus, ",
  "mn28:1.4": "“Friends, bhikkhus!” ",
  "mn28:1.5": "“Friend,” they replied. ",
  "mn28:1.6": "Venerable Sāriputta said this: ",
  "mn28:2.1": "“The footprints of all creatures that walk can fit inside an elephant’s footprint, so an elephant’s footprint is said to be the biggest of them all. ",
  "mn28:2.2": "In the same way, all beneficial things are included in the four noble truths. ",
  "mn28:2.3": "What four? ",
  "mn28:2.4": "The noble truths of suffering, the origin of suffering, the cessation of suffering, and the practice that leads to the cessation of suffering. ",
  "mn28:3.1": "And what is the noble truth of suffering? ",
  "mn28:3.2": "Birth is suffering; aging is suffering; death is suffering; sorrow, lamentation, displeasure, sadness, and distress are suffering; not getting what you wish for is suffering. In brief, the five-assumption-aggregates are suffering. ",
  "mn28:3.3": "And what are the five-assumption-aggregates? ",
  "mn28:3.4": "They are as follows: the assumption-aggregates of form, feeling, perception, activities, and consciousness. ",
  "mn28:4.1": "And what is the assumption-aggregate of form? ",
  "mn28:4.2": "The four primary elements, and form derived from the four primary elements. ",
  "mn28:5.1": "And what are the four primary elements? ",
  "mn28:5.2": "The elements of earth, water, fire, and air. ",
  "mn28:6.1": "And what is the earth element? ",
  "mn28:6.2": "The earth element may be internal or external. ",
  "mn28:6.3": "And what is the internal earth element? ",
  "mn28:6.4": "Anything internal and individual that’s hard, solid, and appropriated. This includes: ",
  "mn28:6.5": "head hair, body hair, nails, teeth, skin, flesh, sinews, bones, bone marrow, kidneys, heart, liver, diaphragm, spleen, lungs, intestines, mesentery, undigested food, feces, or anything else internal and individual that’s hard, solid, and appropriated ",
  "mn28:6.6": "This is called the internal earth element. ",
  "mn28:6.7": "Both the internal earth element and the external earth element are just the earth element. ",
  "mn28:6.8": "This should be seen as it is with right understanding like this: ‘This is not mine, I am not this, this is not my self.’ ",
  "mn28:6.9": "Having seen as it is with right understanding, he grows disenchanted with the earth element; he makes the mind dispassionate for the earth element. ",
  "mn28:7.1": "There comes a time when the external water element flares up. ",
  "mn28:7.2": "At that time the external earth element vanishes. ",
  "mn28:7.3": "So for all its great age, the earth element will reveal its nature of impermanence, wearing out, fading, and changing. ",
  "mn28:7.4": "What then of this ephemeral body assumed by craving as ‘I’ or ‘mine’ or ‘I am’? He considers it to be none of these things. ",
  "mn28:8.1": "If others abuse, attack, harass, and trouble that bhikkhu, he understands: ",
  "mn28:8.2": "‘This unpleasant feeling born of ear pressure has arisen in me. ",
  "mn28:8.3": "That’s dependent, not independent. ",
  "mn28:8.4": "Dependent on what? ",
  "mn28:8.5": "Dependent on pressure.’ ",
  "mn28:8.6": "He sees that pressure, feeling, perception, activities, and consciousness are impermanent. ",
  "mn28:8.7": "Based on that element alone, their mind becomes secure, confident, settled, and decided. ",
  "mn28:9.1": "Others might treat that bhikkhu with disliking, loathing, and detestation, ",
  "mn28:9.2": "striking them with fists, stones, sticks, and swords. ",
  "mn28:9.3": "He understands: ",
  "mn28:9.4": "‘This body is such that fists, stones, sticks, and swords strike it. ",
  "mn28:9.5": "But the Buddha has said in the Advice on the Simile of the Saw: ",
  "mn28:9.6": "“Even if low-down bandits were to sever one limb from limb, anyone who pollutes their mind on that account would not be following my instructions.” ",
  "mn28:9.7": "My effort shall be roused up and steadfast, my recollection established and lucid, my body calm and undisturbed, and my mind composed. ",
  "mn28:9.8": "Gladly now, let fists, stones, sticks, and swords strike this body! For this is how the instructions of the Buddhas are followed.’ ",
  "mn28:10.1": "While recollecting the Buddha, the teaching, and the Saṅgha in this way, equanimity based on the beneficial may not become stabilized in him. ",
  "mn28:10.2": "In that case, he stirs up a sense of urgency: ",
  "mn28:10.3": "‘It’s my loss, my misfortune, ",
  "mn28:10.4": "that while recollecting the Buddha, the teaching, and the Saṅgha in this way, equanimity based on the beneficial does not become stabilized in me.’ ",
  "mn28:10.5": "He's like a daughter-in-law who stirs up a sense of urgency when she sees her father-in-law. ",
  "mn28:10.6": " ",
  "mn28:10.7": " ",
  "mn28:10.8": "But if, while recollecting the Buddha, the teaching, and the Saṅgha in this way, equanimity based on the beneficial does become stabilized in him, he’s pleased about that. ",
  "mn28:10.9": "At this point, much has been done by that bhikkhu. ",
  "mn28:11.1": "And what is the water element? ",
  "mn28:11.2": "The water element may be internal or external. ",
  "mn28:11.3": "And what is the internal water element? ",
  "mn28:11.4": "Anything internal and individual that’s water, watery, and appropriated. That includes: ",
  "mn28:11.5": "bile, phlegm, pus, blood, sweat, fat, tears, grease, saliva, snot, synovial fluid, urine, or anything else internal and individual that’s water, watery, and appropriated. ",
  "mn28:11.6": "This is called the internal water element. ",
  "mn28:11.7": "Both the internal water element and the external water element are just the water element. ",
  "mn28:11.8": "This should be seen as it is with right understanding like this: ‘This is not mine, I am not this, this is not my self.’ ",
  "mn28:11.9": "Having seen as it is with right understanding, he grows disenchanted with the water element; he makes the mind dispassionate for the water element. ",
  "mn28:12.1": "There comes a time when the external water element flares up. ",
  "mn28:12.2": "It sweeps away villages, towns, cities, countries, and regions. ",
  "mn28:12.3": "There comes a time when the water in the ocean sinks a hundred leagues, or two, three, four, five, six, up to seven hundred leagues. ",
  "mn28:12.4": "There comes a time when the water in the ocean stands just seven palm trees deep, or six, five, four, three, two, or even just one palm tree deep. ",
  "mn28:12.5": "There comes a time when the water in the ocean stands just seven fathoms deep, or six, five, four, three, two, or even just one fathom deep. ",
  "mn28:12.6": "There comes a time when the water in the ocean stands just half a fathom deep, or waist deep, or knee deep, or even just ankle deep. ",
  "mn28:12.7": "There comes a time when there isn’t enough water in the ocean even to wet the tip of your finger. ",
  "mn28:12.8": "So for all its great age, the water element will reveal its nature of impermanence, wearing out, fading, and changing. ",
  "mn28:13.1": "What then of this ephemeral body assumed by craving as ‘I’ or ‘mine’ or ‘I am’? He considers it to be none of these things. ",
  "mn28:14.1": "If, while recollecting the Buddha, the Dhamma, and the Saṅgha in this way, equanimity based on the beneficial does become stabilized in him, he’s pleased about that. ",
  "mn28:15.1": "At this point, much has been done by that bhikkhu. ",
  "mn28:16.1": "And what is the fire element? ",
  "mn28:16.2": "The fire element may be internal or external. ",
  "mn28:16.3": "And what is the internal fire element? ",
  "mn28:16.4": "Anything internal and individual that’s fire, fiery, and appropriated. This includes: ",
  "mn28:16.5": "that which warms, that which ages, that which heats one when feverish, that which properly digests food and drink, or anything else internal and individual that’s fire, fiery, and appropriated. ",
  "mn28:16.6": "This is called the internal fire element. ",
  "mn28:16.7": "Both the internal fire element and the external fire element are just the fire element. ",
  "mn28:16.8": "This should be seen as it is with right understanding like this: ‘This is not mine, I am not this, this is not my self.’ ",
  "mn28:16.9": "Having seen as it is with right understanding, he grows disenchanted with the fire element; he makes the mind dispassionate for the fire element. ",
  "mn28:17.1": "There comes a time when the external fire element flares up. ",
  "mn28:17.2": "It burns up villages, towns, cities, countries, and regions until ",
  "mn28:17.3": "it reaches a green field, a roadside, a cliff’s edge, a body of water, or cleared parkland, where it’s extinguished for lack of fuel. ",
  "mn28:17.4": "There comes a time when they go looking for a fire, taking just a chicken feather or a scrap of sinew as kindling. ",
  "mn28:17.5": "So for all its great age, the fire element will reveal its nature of impermanence, wearing out, fading, and changing. ",
  "mn28:17.6": "What then of this ephemeral body assumed by craving as ‘I’ or ‘mine’ or ‘I am’? He considers it to be none of these things. ",
  "mn28:18-20.1": "If, while recollecting the Buddha, the Dhamma, and the Saṅgha in this way, equanimity based on the beneficial does become stabilized in him, he’s pleased about that. ",
  "mn28:18-20.2": "At this point, much has been done by that bhikkhu. ",
  "mn28:21.1": "And what is the air element? ",
  "mn28:21.2": "The air element may be internal or external. ",
  "mn28:21.3": "And what is the internal air element? ",
  "mn28:21.4": "Anything internal and individual that’s air, airy, and appropriated. This includes: ",
  "mn28:21.5": "winds that go up or down, winds in the belly or the bowels, winds that flow through the limbs, in-breaths and out-breaths, or anything else internal and individual that’s air, airy, and appropriated. ",
  "mn28:21.6": "This is called the internal air element. ",
  "mn28:21.7": "Both the internal air element and the external air element are just the air element. ",
  "mn28:21.8": "This should be seen as it is with right understanding like this: ‘This is not mine, I am not this, this is not my self.’ ",
  "mn28:21.9": "Having seen as it is with right understanding, he grows disenchanted with the air element; he makes the mind dispassionate for the air element. ",
  "mn28:22.1": "There comes a time when the external air element flares up. ",
  "mn28:22.2": "It sweeps away villages, towns, cities, countries, and regions. ",
  "mn28:22.3": "There comes a time, in the last month of summer, when they look for wind by using a palm-leaf or fan, and even the grasses in the drip-fringe of a thatch roof don’t stir. ",
  "mn28:22.4": "So for all its great age, the air element will be revealed as impermanent, liable to end, vanish, and perish. ",
  "mn28:22.5": "What then of this ephemeral body assumed by craving as ‘I’ or ‘mine’ or ‘I am’? He considers it to be none of these things. ",
  "mn28:23.1": "If others abuse, attack, harass, and trouble that bhikkhu, he understands: ",
  "mn28:23.2": "‘This unpleasant feeling born of ear pressure has arisen in me. ",
  "mn28:23.3": "That’s dependent, not independent. ",
  "mn28:23.4": "Dependent on what? ",
  "mn28:23.5": "Dependent on pressure. ",
  "mn28:23.6": "He sees that pressure, feeling, perception, activities, and consciousness are impermanent. ",
  "mn28:23.7": "Based on that element alone, their mind becomes secure, confident, settled, and decided. ",
  "mn28:24.1": "Others might treat that bhikkhu with disliking, loathing, and detestation, striking them with fists, stones, sticks, and swords. ",
  "mn28:24.2": "He understands: ‘This body is such that fists, stones, sticks, and swords strike it. ",
  "mn28:24.3": "But the Buddha has said in the Advice on the Simile of the Saw: “Even if low-down bandits were to sever you limb from limb, anyone who polluted their mind on that account would not be following my instructions.” ",
  "mn28:24.4": "My effort shall be roused up and steadfast, my recollection established and lucid, my body calm and undisturbed, and my mind composed. ",
  "mn28:24.5": "Gladly now, let fists, stones, sticks, and swords strike this body! For this is how the instructions of the Buddhas are followed.’ ",
  "mn28:25.1": "While recollecting the Buddha, the Dhamma, and the Saṅgha in this way, equanimity based on the beneficial may not become stabilized in him. ",
  "mn28:25.2": "In that case, he stirs up a sense of urgency: ",
  "mn28:25.3": "‘It’s my loss, my misfortune, ",
  "mn28:25.4": "that while recollecting the Buddha, the Dhamma, and the Saṅgha in this way, equanimity based on the beneficial does not become stabilized in me.’ ",
  "mn28:25.5": "He's like a daughter-in-law who stirs up a sense of urgency when she sees her father-in-law. ",
  "mn28:25.6": " ",
  "mn28:25.7": " ",
  "mn28:25.8": " ",
  "mn28:25.9": " ",
  "mn28:25.10": "But if, while recollecting the Buddha, the Dhamma, and the Saṅgha in this way, equanimity based on the beneficial does become stabilized in him, he’s pleased about that. ",
  "mn28:25.11": "At this point, much has been done by that bhikkhu. ",
  "mn28:26.1": "When a space is enclosed by sticks, creepers, grass, and mud it becomes known as a ‘building’. ",
  "mn28:26.2": "In the same way, when a space is enclosed by bones, sinews, flesh, and skin it becomes known as ‘form’. ",
  "mn28:27.1": "Friends, though the eye is intact internally, so long as external forms don’t come into range and there’s no corresponding engagement, there’s no manifestation of the corresponding type of consciousness. ",
  "mn28:27.2": "Though the eye is intact internally and external forms come into range, so long as there’s no corresponding engagement, there’s no manifestation of the corresponding type of consciousness. ",
  "mn28:27.3": "But when the eye is intact internally and external forms come into range and there is corresponding engagement, there is the manifestation of the corresponding type of consciousness. ",
  "mn28:28.1": "The form produced in this way is included in the assumption-aggregate of form. The feeling, perception, activities, and consciousness produced in this way are each included in the corresponding assumption-aggregate. ",
  "mn28:28.2": "He understands: ",
  "mn28:28.3": "‘So this is how there comes to be inclusion, gathering together, and joining together into these five-assumption-aggregates. ",
  "mn28:28.4": "But the Buddha has said: ",
  "mn28:28.5": "“One who sees dependent origination sees the Dhamma. ",
  "mn28:28.6": "One who sees the Dhamma sees dependent origination.” ",
  "mn28:28.7": "And these five-assumption-aggregates are indeed dependently arisen. ",
  "mn28:28.8": "The desire, clinging, attraction, and attachment for these five-assumption-aggregates is the origin of suffering. ",
  "mn28:28.9": "The dispelling and giving up of desire and passion for these five-assumption-aggregates is the cessation of suffering.’ ",
  "mn28:28.10": "At this point, much has been done by that bhikkhu. ",
  "mn28:29-30.1": "Though the ear … ",
  "mn28:31-32.1": "nose … ",
  "mn28:33-34.1": "tongue … ",
  "mn28:35-36.1": "body … ",
  "mn28:37.1": "mind-sense is intact internally, so long as external phenomena don’t come into range and there’s no corresponding engagement, there’s no manifestation of the corresponding type of consciousness. ",
  "mn28:38.1": "Though the mind-sense is intact internally and external phenomena come into range, so long as there’s no corresponding engagement, there’s no manifestation of the corresponding type of consciousness. ",
  "mn28:38.2": "But when the mind-sense is intact internally and external phenomena come into range and there is corresponding engagement, there is the manifestation of the corresponding type of consciousness. ",
  "mn28:38.3": "The form produced in this way is included in the assumption-aggregate of form. The feeling, perception, activities, and consciousness produced in this way are each included in the corresponding assumption-aggregate. ",
  "mn28:38.4": "He understands: ",
  "mn28:38.5": "‘So this is how there comes to be inclusion, gathering together, and joining together into these five-assumption-aggregates. ",
  "mn28:38.6": "But the Buddha has also said: ",
  "mn28:38.7": "“One who sees dependent origination sees the Dhamma. ",
  "mn28:38.8": "One who sees the Dhamma sees dependent origination.” ",
  "mn28:38.9": "And these five-assumption-aggregates are indeed dependently arisen. ",
  "mn28:38.10": "The desire, clinging, attraction, and attachment for these five-assumption-aggregates is the origin of suffering. ",
  "mn28:38.11": "The dispelling and giving up of desire and passion for these five-assumption-aggregates is the cessation of suffering.’ ",
  "mn28:38.12": "At this point, much has been done by that bhikkhu.” ",
  "mn28:38.13": "That’s what Venerable Sāriputta said. ",
  "mn28:38.14": "Pleased, the bhikkhus delighted in what Venerable Sāriputta said. "
}