{
    "mn2:0.1": "Middle Discourses 2 ",
    "mn2:0.2": "All the Influxes ",
    "mn2:1.1": "Thus have I heard. ",
    "mn2:1.2": "At one time, the Auspicious One was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
    "mn2:1.3": "There the Auspicious One addressed the bhikkhus, ",
    "mn2:1.4": "“Bhikkhus!” ",
    "mn2:1.5": "“Venerable sir,” they replied. ",
    "mn2:1.6": "The Auspicious One said this: ",
    "mn2:2.1": "“Bhikkhus, I will teach you the explanation of the restraint of all influxes. ",
    "mn2:2.2": "Listen and apply your mind well, I will speak.” ",
    "mn2:2.3": "“Yes, venerable sir,” they replied. ",
    "mn2:2.4": "The Auspicious One said this: ",
    "mn2:3.1": "“Bhikkhus, I say that the destruction of the influxes is for one who knows and sees, not for one who does not know or see. ",
    "mn2:3.2": "For one who knows and sees what? ",
    "mn2:3.3": "Attention in light of the origin and attention not in light of the origin. ",
    "mn2:3.4": "For one who attends not in light of the origin, unarisen influxes arise, and arisen influxes increase. ",
    "mn2:3.5": "For one who attends in light of the origin, unarisen influxes do not arise, and arisen influxes are abandoned. ",
    "mn2:4.1": "There are influxes to be abandoned 1) by seeing, 2) by restraint, 3) by using, 4) by bearing, 5) by avoiding, 6) by dispelling, and, 7) by developing. ",
    "mn2:5.0": "1. Influxes abandoned by Seeing ",
    "mn2:5.1": "And what are the influxes that should be abandoned by seeing? ",
    "mn2:5.2": "An unlearned ordinary person—who has not seen the noble ones, and is neither skilled nor trained in the teaching of the noble ones, who has not seen the righteous men, and is neither skilled nor trained in the teaching of the righteous men— ",
    "mn2:5.3": "does not understand things that should be attended to and things that should not be attended to. ",
    "mn2:5.4": "So he does not attend to things he should attend to, and attends to things he should not attend to. ",
    "mn2:6.1": "And what are the things he should not attend to that he attends to? ",
    "mn2:6.2": "They are things such that when he attends to them, the unarisen influx of sensuality arises in him, or the arisen influx of sensuality increases, ",
    "mn2:6.3": "the unarisen influx of being arises in him, or the arisen influx of being increases, ",
    "mn2:6.4": "the unarisen influx of ignorance arises in him, or the arisen influx of ignorance increases. ",
    "mn2:6.5": "These are the things that he should not attend to, but does. ",
    "mn2:6.6": "And what are the things he should attend to that he does not attend to? ",
    "mn2:6.7": "They are things such that when he attends to them, the unarisen influx of sensuality does not arise in him, or the arisen influx of sensuality is abandoned, ",
    "mn2:6.8": "the unarisen influx of being does not arise in him, or the arisen influx of being is abandoned, ",
    "mn2:6.9": "the unarisen influx of ignorance does not arise in him, or the arisen influx of ignorance is abandoned. ",
    "mn2:6.10": "These are the things that he does not attend to, but should. ",
    "mn2:7.1": "Because of attending to what he should not and not attending to what he should, unarisen influxes arise in him and arisen influxes increase. ",
    "mn2:7.2": "This is how he attends not in light of the origin: ",
    "mn2:7.3": "‘Did I exist in the past? Did I not exist in the past? What was I in the past? How was I in the past? After being what, what did I become in the past? ",
    "mn2:7.4": "Will I exist in the future? Will I not exist in the future? What will I be in the future? How will I be in the future? After being what, what will I become in the future?’ ",
    "mn2:7.5": "Or he is undecided about the present thus: ",
    "mn2:7.6": "‘Am I? Am I not? What am I? How am I? This creature—where did it originate? And where will it go?’ ",
    "mn2:8.1": "When he attends not in light of the origin in this way, one of the following six views arises for him: ",
    "mn2:8.2": "The view: ‘There is my self’ arises for him as true and factual. ",
    "mn2:8.3": "The view: ‘There is not my self’ arises for him as true and factual. ",
    "mn2:8.4": "The view: ‘I perceive self with self’ arises for him as true and factual. ",
    "mn2:8.5": "The view: ‘I perceive not-self with self’ arises for him as true and factual. ",
    "mn2:8.6": "The view: ‘I perceive self with not-self’ arises for him as true and factual. ",
    "mn2:8.7": "Or he has such a view: ",
    "mn2:8.8": "‘This self of mine is he, the speaker, the knower who experiences the results of good and bad actions in all the different realms. This self is permanent, everlasting, eternal, and imperishable, and will last forever and ever.’ ",
    "mn2:8.9": "This is called a going into views, a thicket of views, a desert of views, a contortion of views, a writhing of views, a fetter of views. ",
    "mn2:8.10": "Fettered by views, an unlearned ordinary person is not liberated from birth, aging, and death, from sorrow, lamentation, displeasure, sadness, and distress. ",
    "mn2:8.11": "He is not liberated from suffering, I say. ",
    "mn2:9.1": " ",
    "mn2:9.2": "But a trained noble disciple—who has seen the noble ones, and is skilled and trained in the teaching of the noble ones, who has seen the righteous men, and is skilled and trained in the teaching of the righteous men— ",
    "mn2:9.3": "understands things that should be attended to and things that should not be attended to. ",
    "mn2:9.4": "So, he attends to things he should and does not attend to things he should not. ",
    "mn2:10.1": "And what are the things he should not attend to that he does not attend to? ",
    "mn2:10.2": "They are things such that when he attends to them, the unarisen influx of sensuality arises in him, or the arisen influx of sensuality increases, ",
    "mn2:10.3": "the unarisen influx of being arises in him, or the arisen influx of being increases, ",
    "mn2:10.4": "the unarisen influx of ignorance arises in him, or the arisen influx of ignorance increases. ",
    "mn2:10.5": "These are the things he should not attend to that he does not attend to. ",
    "mn2:10.6": "And what are the things he should attend to that he attends to ? ",
    "mn2:10.7": "They are things such that when he attends to them, the unarisen influx of sensuality does not arise in him, or the arisen influx of sensuality is abandoned, ",
    "mn2:10.8": "the unarisen influx of being does not arise in him, or the arisen influx of being is abandoned, ",
    "mn2:10.9": "the unarisen influx of ignorance does not arise in him, or the arisen influx of ignorance is abandoned. ",
    "mn2:10.10": "These are the things he should attend to that he attends to. ",
    "mn2:10.11": "Because of not attending to what he should not and attending to what he should, unarisen influxes do not arise and arisen influxes are abandoned. ",
    "mn2:11.1": "He attends in light of the origin: ‘This is suffering’ … ‘This is the origination of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering’. ",
    "mn2:11.2": "As he attends in light of the origin thus, three fetters are abandoned: ",
    "mn2:11.3": "personality-view, doubt, and the grasping at virtue-and-duty. ",
    "mn2:11.4": "These are called the influxes that should be abandoned by seeing. ",
    "mn2:12.0": "2. Influxes Abandoned by Restraint ",
    "mn2:12.1": "And what are the influxes that should be abandoned by restraint? ",
    "mn2:12.2": "Take a bhikkhu who, reflecting in light of the origin, abides restraining the faculty of the eye. ",
    "mn2:12.3": "For the influxes, trouble, and affliction that would arise in someone who abides without restraint of the eye faculty do not arise when there is such restraint. ",
    "mn2:12.4": "Reflecting in light of the origin, he abides restraining the faculty of the ear … ",
    "mn2:12.5": "the nose … ",
    "mn2:12.6": "the tongue … ",
    "mn2:12.7": "the body … ",
    "mn2:12.8": "the mental faculty. ",
    "mn2:12.9": "For the influxes, trouble, and affliction that would arise in someone who abides without restraint of the mental faculty do not arise when there is such restraint. ",
    "mn2:12.10": "For the influxes, trouble, and affliction that would arise in someone who abides without restraint do not arise when there is such restraint. ",
    "mn2:12.11": "These are called the influxes that should be abandoned by restraint. ",
    "mn2:13.0": "3. Influxes Abandoned by Using ",
    "mn2:13.1": "And what are the influxes that should be abandoned by using? ",
    "mn2:13.2": "Take a bhikkhu who, reflecting in light of the origin, makes use of robes: ",
    "mn2:13.3": "‘Only for the sake of warding off cold and heat; for warding off the touch of flies, mosquitoes, wind, sun, and reptiles; and for covering up the private parts.’ ",
    "mn2:14.1": "Reflecting in light of the origin, he makes use of alms-food: ",
    "mn2:14.2": "‘Not for entertainment, indulgence, beautification, or adornment, but only to sustain this body, to avoid harm, and to support the renunciate life. In this way, I shall put an end to old discomfort and not give rise to new discomfort, and I will live blamelessly and at ease.’ ",
    "mn2:15.1": "Reflecting in light of the origin, he makes use of lodgings: ",
    "mn2:15.2": "‘Only for the sake of warding off cold and heat; for warding off the touch of flies, mosquitoes, wind, sun, and reptiles; to shelter from harsh weather and to enjoy retreat.’ ",
    "mn2:16.1": "Reflecting in light of the origin, he makes use of medicines and supplies for the sick: ",
    "mn2:16.2": "‘Only for the sake of warding off the pains of illness and to promote good health.’ ",
    "mn2:17.1": "For the influxes, trouble, and affliction that would arise in someone who abides without using these things do not arise when they are used. ",
    "mn2:17.2": "These are called the influxes that should be abandoned by using. ",
    "mn2:18.0": "4. Influxes Abandoned by Bearing ",
    "mn2:18.1": "And what are the influxes that should be abandoned by bearing? ",
    "mn2:18.2": "Take a bhikkhu who, reflecting in light of the origin, endures cold, heat, hunger, and thirst. He endures the touch of flies, mosquitoes, wind, sun, and reptiles. He endures rude and unwelcome criticism. And he endures bodily feelings that are painful, sharp, harsh, acute, unpleasant, disagreeable, and life-threatening. ",
    "mn2:18.3": "For the influxes, trouble, and affliction that would arise in someone who abides without bearing these things do not arise when they are endured. ",
    "mn2:18.4": "These are called the influxes that should be abandoned by bearing. ",
    "mn2:19.0": "5. Influxes Abandoned by Avoiding ",
    "mn2:19.1": "And what are the influxes that should be abandoned by avoiding? ",
    "mn2:19.2": "Take a bhikkhu who, reflecting in light of the origin, avoids a wild elephant, a wild horse, a wild ox, a wild dog, a snake, a stump, thorny ground, a pit, a cliff, a swamp, and a sewer. ",
    "mn2:19.3": "Reflecting in light of the origin, he avoids sitting on inappropriate seats, walking in inappropriate neighborhoods, and mixing with bad friends—whatever wise fellow renunciates would take to be an unsuitable setting. ",
    "mn2:19.4": "For the influxes, trouble, and affliction that would arise in someone who abides without avoiding these things do not arise when they are avoided. ",
    "mn2:19.5": "These are called the influxes that should be abandoned by avoiding. ",
    "mn2:20.0": "6. Influxes Abandoned by Dispelling ",
    "mn2:20.1": "And what are the influxes that should be abandoned by dispelling? ",
    "mn2:20.2": "A bhikkhu, reflecting in light of the origin, does not tolerate a sensual, averse, or cruel thought that has arisen, but abandones it, dispels it, eliminates it, and obliterates it. He does not tolerate any unbeneficial phenomena that have arisen, but abandons them, dispels them, eliminates them, and obliterates them. ",
    "mn2:20.3": "For the influxes, trouble, and affliction that would arise in someone who abides without dispelling these things do not arise when they are dispelled. ",
    "mn2:20.4": "These are called the influxes that should be abandoned by dispelling. ",
    "mn2:21.0": "7. Influxes Abandoned by Developing ",
    "mn2:21.1": "And what are the influxes that should be abandoned by developing? ",
    "mn2:21.2": "It is when a bhikkhu, reflecting in light of the origin, develops the awakening factors of recollectedness, ",
    "mn2:21.3": "discernment of phenomena, ",
    "mn2:21.4": "effort, ",
    "mn2:21.5": "joy, ",
    "mn2:21.6": "calm, ",
    "mn2:21.7": "composure, ",
    "mn2:21.8": "and equanimity, which rely on withdrawal, dispassion, and cessation, and ripen in relinquishment. ",
    "mn2:21.9": "For the influxes, trouble, and affliction that would arise in someone who abides without developing these things do not arise when they are developed. ",
    "mn2:21.10": "These are called the influxes that should be abandoned by developing. ",
    "mn2:22.1": "Now, consider a bhikkhu who, by seeing, has abandoned the influxes that should be abandoned by seeing. By restraint, he has abandoned the influxes that should be abandoned by restraint. By using, he has abandoned the influxes that should be abandoned by using. By bearing, he has abandoned the influxes that should be abandoned by bearing. By avoiding, he has abandoned the influxes that should be abandoned by avoiding. By dispelling, he has abandoned the influxes that should be abandoned by dispelling. By developing, he has abandoned the influxes that should be abandoned by developing. ",
    "mn2:22.2": "He is called a bhikkhu who abides having restrained all influxes, who has cut off craving, untied the fetters, and with the thorough comprehension of conceit has made an end of suffering.” ",
    "mn2:22.3": "That is what the Auspicious One said. ",
    "mn2:22.4": "Pleased, the bhikkhus delighted in what the Auspicious One said. "
}
