{
  "mn30:0.1": "Middle Discourses 30 ",
  "mn30:0.2": "The Shorter Simile of the Heartwood ",
  "mn30:1.1": "So I have heard. ",
  "mn30:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
  "mn30:2.1": "Then the brahmin Piṅgalakoccha went up to the Buddha, and exchanged pleasantries with him. ",
  "mn30:2.2": "When the amicable and cordial talk was over, he sat down to one side and said to the Buddha: ",
  "mn30:2.3": "“Master Gotama, there are those ascetics and brahmins who lead an order and a community, and teach a community. They’re well-known and famous religious founders, deemed holy by many people. ",
  "mn30:2.4": "Namely: Pūraṇa Kassapa, the bamboo-staffed ascetic Gosāla, Ajita of the hair blanket, Pakudha Kaccāyana, Sañjaya Belaṭṭhiputta, and the Jain Nāṭaputta. ",
  "mn30:2.5": "According to their own claims, did all of them come to understand [rightly], or none of them, or only some?” ",
  "mn30:2.6": "“Enough, brahmin, let this be: ",
  "mn30:2.7": "‘‘According to their own claims, did all of them come to understand [rightly], or none of them, or only some?’ ",
  "mn30:2.8": "I will teach you the Dhamma. ",
  "mn30:2.9": "Listen and apply your mind well, I will speak.” ",
  "mn30:2.10": "“Yes sir”, Piṅgalakoccha replied. ",
  "mn30:2.11": "The Buddha said this: ",
  "mn30:3.1": "“Suppose there was a man in need of heartwood. And while wandering in search of heartwood he’d come across a large tree standing with heartwood. But, passing over the heartwood, sapwood, bark, and shoots, he’d cut off the branches and leaves and depart imagining they were heartwood. ",
  "mn30:3.2": "If a man with good eyesight saw him they’d say: ",
  "mn30:3.3": "‘This gentleman doesn’t know what heartwood, sapwood, bark, shoots, or branches and leaves are. ",
  "mn30:3.4": "That’s why he passed them over, cut off the branches and leaves, and departed imagining they were heartwood. ",
  "mn30:3.5": "Whatever he needs to make from heartwood, he won’t succeed.’ ",
  "mn30:4.1": "Suppose there was another man in need of heartwood … he’d cut off the shoots and depart imagining they were heartwood … ",
  "mn30:4.2": "",
  "mn30:4.3": "",
  "mn30:4.4": "",
  "mn30:4.5": "",
  "mn30:5.1": "Suppose there was another man in need of heartwood … he’d cut off the bark and depart imagining it was heartwood … ",
  "mn30:5.2": "",
  "mn30:5.3": "",
  "mn30:5.4": "",
  "mn30:5.5": "",
  "mn30:6.1": "Suppose there was another man in need of heartwood … he’d cut out the sapwood and depart imagining it was heartwood … ",
  "mn30:6.2": "",
  "mn30:6.3": "",
  "mn30:6.4": "",
  "mn30:6.5": "",
  "mn30:7.1": "Suppose there was another man in need of heartwood. And while wandering in search of heartwood he’d come across a large tree standing with heartwood. He’d cut out just the heartwood and depart knowing it was heartwood. ",
  "mn30:7.2": "If a man with good eyesight saw him they’d say: ",
  "mn30:7.3": "‘This gentleman knows what heartwood, sapwood, bark, shoots, or branches and leaves are. ",
  "mn30:7.4": "That’s why he cut out just the heartwood and departed knowing it was heartwood. ",
  "mn30:7.5": "Whatever he needs to make from heartwood, he will succeed.’ ",
  "mn30:8.1": "In the same way, take a certain individual who goes forth from the lay life to homelessness, thinking: ",
  "mn30:8.2": "‘I’m swamped by birth, aging, and death; by sorrow, lamentation, displeasure, sadness, and distress. I’m swamped by suffering, mired in suffering. ",
  "mn30:8.3": "Hopefully I can find an end to this entire mass of suffering.’ ",
  "mn30:8.4": "When he’s gone forth he generates gain, honor, and popularity. ",
  "mn30:8.5": "He’s pleased with that, and his intention is fulfilled. ",
  "mn30:8.6": "And he glorifies himself and puts others down on account of that: ",
  "mn30:8.7": "‘I’m the one with gain, honor, and popularity. These other bhikkhus are obscure and insignificant.’ ",
  "mn30:8.8": "He does not generate desire or try to realize those things that are better and finer than gain, honor, and popularity. He becomes lazy and lax. … ",
  "mn30:8.9": "",
  "mn30:8.10": "",
  "mn30:8.11": "He’s like the man who mistakes branches and leaves for heartwood, I say. ",
  "mn30:9.1": "Next, take a gentleman who has gone forth from the lay life to homelessness … ",
  "mn30:9.2": "",
  "mn30:9.3": "",
  "mn30:9.4": "When he’s gone forth he generates gain, honor, and popularity. ",
  "mn30:9.5": "He’s not pleased with that, and his intention is not fulfilled. ",
  "mn30:9.6": "He doesn’t exalt himself and put others down on account of that. ",
  "mn30:9.7": "He generates desire and tries to realize those things that are better and finer than gain, honor, and popularity. He does not become lazy and lax. ",
  "mn30:9.8": "He achieves accomplishment in virtue. ",
  "mn30:9.9": "He’s pleased with that, and his intention is fulfilled. ",
  "mn30:9.10": "And he glorifies himself and puts others down on account of that: ",
  "mn30:9.11": "‘I’m the one who is virtuous, of good character. These other bhikkhus are unvirtuous, of bad character.’ ",
  "mn30:9.12": "He does not generate desire or trying to realize those things that are better and finer than accomplishment in virtue. He becomes lazy and lax. … ",
  "mn30:9.13": "",
  "mn30:9.14": "",
  "mn30:9.15": "He’s like the man who mistakes shoots for heartwood, I say. ",
  "mn30:10.1": "Next, take a gentleman who has gone forth from the lay life to homelessness … ",
  "mn30:10.2": "",
  "mn30:10.3": "",
  "mn30:10.4": "",
  "mn30:10.5": "",
  "mn30:10.6": "",
  "mn30:10.7": "",
  "mn30:10.8": "He achieves accomplishment in virtue … ",
  "mn30:10.9": "",
  "mn30:10.10": "",
  "mn30:10.11": "",
  "mn30:10.12": "and composure. … ",
  "mn30:10.13": "",
  "mn30:10.14": "",
  "mn30:10.15": "",
  "mn30:10.16": "He does not generate desire or try to realize those things that are better and finer than accomplishment in composure. He becomes lazy and lax … ",
  "mn30:10.17": "",
  "mn30:10.18": "",
  "mn30:10.19": "He’s like the man who mistakes bark for heartwood, I say. ",
  "mn30:11.1": "Next, take a gentleman who has gone forth from the lay life to homelessness … ",
  "mn30:11.2": "",
  "mn30:11.3": "",
  "mn30:11.4": "",
  "mn30:11.5": "",
  "mn30:11.6": "",
  "mn30:11.7": "",
  "mn30:11.8": "He acheives accomplishment in virtue … ",
  "mn30:11.9": "",
  "mn30:11.10": "",
  "mn30:11.11": "",
  "mn30:11.12": "composure … ",
  "mn30:11.13": "",
  "mn30:11.14": "",
  "mn30:11.15": "",
  "mn30:11.16": "and knowledge-and-vision. ",
  "mn30:11.17": "",
  "mn30:11.18": "",
  "mn30:11.19": "",
  "mn30:11.20": "He does not not generate desire or try to realize those things that are better and finer than knowledge-and-vision. He becomes lazy and lax. … ",
  "mn30:11.21": "",
  "mn30:11.22": "",
  "mn30:11.23": "He’s like the man who mistakes sapwood for heartwood, I say. ",
  "mn30:12.1": "Next, take a gentleman who has gone forth from the lay life to homelessness, thinking: ",
  "mn30:12.2": "‘I’m swamped by birth, aging, and death; by sorrow, lamentation, displeasure, sadness, and distress. I’m swamped by suffering, mired in suffering. ",
  "mn30:12.3": "Hopefully I can find an end to this entire mass of suffering.’ ",
  "mn30:12.4": "When he’s gone forth he generates gain, honor, and popularity. ",
  "mn30:12.5": "He’s not pleased with that, and his intention is not fulfilled. ",
  "mn30:12.6": "He doesn’t exalt himself and put others down on account of that. ",
  "mn30:12.7": "He generates desire and tries to realize those things that are better and finer than gain, honor, and popularity. He does not become lazy and lax. ",
  "mn30:12.8": "He achieves accomplishment in virtue … ",
  "mn30:12.9": "He’s pleased with that, but his intention is not fulfilled. ",
  "mn30:12.10": "He doesn’t exalt himself and put others down on account of that. ",
  "mn30:12.11": "He generates desire and tries to realize those things that are better and finer than accomplishment in virtue. He does not become lazy and lax. ",
  "mn30:12.12": "He achieves accomplishment in composure. ",
  "mn30:12.13": "He’s pleased with that, but his intention is not fulfilled. ",
  "mn30:12.14": "He doesn’t exalt himself and put others down on account of that. ",
  "mn30:12.15": "He generates desire and tries to realize those things that are better and finer than accomplishment in composure. He does not become lazy and lax. ",
  "mn30:12.16": "He achieves knowledge-and-vision. ",
  "mn30:12.17": "He’s pleased with that, but his intention is not fulfilled. ",
  "mn30:12.18": "He doesn’t exalt himself and put others down on account of that. ",
  "mn30:12.19": "He generates desire and tries to realize those things that are better and finer than knowledge-and-vision. He does not become lazy and lax. ",
  "mn30:12.20": "And what are those things that are better and finer than knowledge-and-vision? ",
  "mn30:13.1": "Take a bhikkhu who, quite disjoined from sensuality, disjoined from detrimental phenomena, with thinking and with pondering, with joy and ease born of separation, abides having entered upon the first jhāna. ",
  "mn30:13.2": "This is something better and finer than knowledge-and-vision. ",
  "mn30:14.1": "Furthermore, with the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and ease born of composure, a bhikkhu abides having entered upon the second jhāna. ",
  "mn30:14.2": "This too is something better and finer than knowledge-and-vision. ",
  "mn30:15.1": "Furthermore, with the fading of joy, a bhikkhu abides equanimous, recollected, and aware, experiencing ease with the body. He abides having entered upon the third jhāna, with regard to which the noble ones say “one abides equanimous, recollected, and at ease.” ",
  "mn30:15.2": "This too is something better and finer than knowledge-and-vision. ",
  "mn30:16.1": "Furthermore, with the giving up of ease and unease—and with the ending of joys and upsets beforehand—without pleasure or displeasure, with purity of equanimity and recollection, a bhikkhu abides having entered upon the fourth jhāna. ",
  "mn30:16.2": "This too is something better and finer than knowledge-and-vision. ",
  "mn30:17.1": "Furthermore, a bhikkhu, having fully surmounted perceptions of form, with the ending of perceptions of resistance, not attending to perceptions of diversity, aware that ‘space is infinite’, abides having entered upon the extent of infinite space. ",
  "mn30:17.2": "This too is something better and finer than knowledge-and-vision. ",
  "mn30:18.1": "Furthermore, a bhikkhu, having fully surmounted the extent of infinite space, aware that ‘consciousness is infinite’, abides having entered upon the extent of infinite consciousness. ",
  "mn30:18.2": "This too is something better and finer than knowledge-and-vision. ",
  "mn30:19.1": "Furthermore, a bhikkhu, having fully surmounted the extent of infinite consciousness, aware that ‘there is nothing at all’, abides having entered upon the extent of nothingness. ",
  "mn30:19.2": "This too is something better and finer than knowledge-and-vision. ",
  "mn30:20.1": "Furthermore, a bhikkhu, having fully surmounted the extent of nothingness, abides having entered upon the extent of neither-perception-nor-non-perception. ",
  "mn30:20.2": "This too is something better and finer than knowledge-and-vision. ",
  "mn30:21.1": "Furthermore, a bhikkhu, having fully surmounted the extent of neither-perception-nor-non-perception, abides having entered upon the cessation of perception-and-feeling. And, having seen with understanding, his influxes are destroyed. ",
  "mn30:21.2": "This too is something better and finer than knowledge-and-vision. ",
  "mn30:21.3": "These are the things that are better and finer than knowledge-and-vision. ",
  "mn30:22.1": "Suppose there was a man in need of heartwood. And while wandering in search of heartwood he’d come across a large tree standing with heartwood. He’d cut out just the heartwood and depart knowing it was heartwood. ",
  "mn30:22.2": "Whatever he needs to make from heartwood, he will succeed. ",
  "mn30:22.3": "That’s what this person is like, I say. ",
  "mn30:23.1": "And so, brahmin, this renunciate life is not lived for the sake of gain, honor, and popularity, or for accomplishment in virtue, or for accomplishment in composure, or for knowledge-and-vision. ",
  "mn30:23.2": "Rather, the goal, heartwood, and final end of the renunciate life is the unshakable liberation of the mind.” ",
  "mn30:23.3": "",
  "mn30:24.1": "When he had spoken, the brahmin Piṅgalakoccha said to the Buddha, ",
  "mn30:24.2": "“Excellent, Master Gotama! Excellent! … ",
  "mn30:24.3": "From this day forth, may Master Gotama remember me as a lay follower who has gone for refuge for life.” ",
  "mn30:24.4": "",
  "mn30:24.5": "",
  "mn30:25.1": "",
  "mn30:25.2": "",
  "mn30:25.3": ""
}