{
    "mn32:0.1": "Middle Discourses 32 ",
    "mn32:0.2": "The Longer Discourse at Gosiṅga ",
    "mn32:1.1": "Thus have I heard. ",
    "mn32:1.2": "At one time the Auspicious One was staying in the sal forest park at Gosiṅga, together with several well-known senior disciples, such as ",
    "mn32:1.3": "the venerables Sāriputta, Mahāmoggallāna, Mahākassapa, Anuruddha, Revata, Ānanda, and others. ",
    "mn32:2.1": "Then, in the late afternoon, Venerable Mahāmoggallāna came out of retreat, went to Venerable Mahākassapa, and said, ",
    "mn32:2.2": "“Come, Venerable Kassapa, let us go to Venerable Sāriputta to hear the Dhamma.” ",
    "mn32:2.3": "“Yes, venerable,” Venerable Mahākassapa replied. ",
    "mn32:2.4": "Then, together with Venerable Anuruddha, they went to Venerable Sāriputta to hear the Dhamma. ",
    "mn32:3.1": "Seeing them, Venerable Ānanda ",
    "mn32:3.2": "went to Venerable Revata, told him what was happening, ",
    "mn32:3.3": "and invited him also. ",
    "mn32:3.4": "",
    "mn32:3.5": "",
    "mn32:3.6": "",
    "mn32:4.1": "Venerable Sāriputta saw them coming off in the distance ",
    "mn32:4.2": "and said to Venerable Ānanda, ",
    "mn32:4.3": "“Come, Venerable Ānanda. ",
    "mn32:4.4": "Welcome to Venerable Ānanda, the Auspicious One’s attendant, who is so close to the Auspicious One. ",
    "mn32:4.5": "Venerable Ānanda, the sal forest park at Gosiṅga is delightful, the night is bright, the sal trees are in full blossom, and divine scents seem to float on the air. ",
    "mn32:4.6": "What kind of bhikkhu would beautify this park?” ",
    "mn32:4.7": "“Venerable Sāriputta, it is a bhikkhu who is very learned, remembering and keeping what he has learned. Those teachings that are good in the beginning, good in the middle, and good in the end, with the [right] meaning and phrasing, and which describe a renunciate life that is entirely complete and pure—such teachings he has learned much of, remembered, rehearsed verbally, investigated with the mind, and penetrated well by view. ",
    "mn32:4.8": "And he teaches the four assemblies in order to uproot the underlying tendencies with well-rounded and coherent words and phrases. ",
    "mn32:4.9": "That is the kind of bhikkhu who would beautify this park.” ",
    "mn32:5.1": "When he had spoken, Venerable Sāriputta said to Venerable Revata, ",
    "mn32:5.2": "“Venerable Revata, Venerable Ānanda has answered what occurred to him. ",
    "mn32:5.3": "And now we ask you the same question.” ",
    "mn32:5.4": "",
    "mn32:5.5": "",
    "mn32:5.6": "“Venerable Sāriputta, it is a bhikkhu who enjoys solitude and is fond of solitude, is committed to internal calm of mind, does not neglect jhāna, is endowed with insight, and frequents empty dwellings. ",
    "mn32:5.7": "That is the kind of bhikkhu who would beautify this park.” ",
    "mn32:6.1": "When he had spoken, Venerable Sāriputta said to Venerable Anuruddha, ",
    "mn32:6.2": "“Venerable Anuruddha, Venerable Revata has answered what occurred to him. ",
    "mn32:6.3": "And now we ask you the same question.” ",
    "mn32:6.4": "",
    "mn32:6.5": "",
    "mn32:6.6": "“Venerable Sāriputta, it is a bhikkhu who surveys a thousand worlds with the divine eye that is purified and superhuman, ",
    "mn32:6.7": "just as a man with good eyesight could survey a thousand wheel rims from the upper floor of a royal longhouse. ",
    "mn32:6.8": "",
    "mn32:6.9": "That is the kind of bhikkhu who would beautify this park.” ",
    "mn32:7.1": "When he had spoken, Venerable Sāriputta said to Venerable Mahākassapa, ",
    "mn32:7.2": "“Venerable Kassapa, Venerable Anuruddha has answered what occurred to him. ",
    "mn32:7.3": "And now we ask you the same question.” ",
    "mn32:7.4": "",
    "mn32:7.5": "",
    "mn32:7.6": "“Venerable Sāriputta, it is a bhikkhu who is himself a forest-dweller, and speaks in praise of forest-dwelling; he himself eats almsfood, and speaks in praise of eating alsmfood; he himself wears rag robes, and speaks in praise of wearing rag robes; he himself owns just three robes, and speaks in praise of owning just three robes. He himself is of few wishes, content, secluded, aloof, and effortful; and he speaks in praise of these things. He himself is accomplished in virtue, composure, wisdom, liberation, and the knowledge-and-vision of liberation; and he speaks in praise of accomplishment in these things. ",
    "mn32:7.7": "That is the kind of bhikkhu who would beautify this park.” ",
    "mn32:8.1": "When he had spoken, Venerable Sāriputta said to Venerable Mahāmoggallāna, ",
    "mn32:8.2": "“Venerable Moggallāna, Venerable Mahākassapa has answered what occurred to him. ",
    "mn32:8.3": "And now we ask you the same question.” ",
    "mn32:8.4": "",
    "mn32:8.5": "",
    "mn32:8.6": "“Venerable Sāriputta, it is when two bhikkhus engage in discussion about the Dhamma. They question each other and answer each other’s questions without faltering, and their discussion on the Dhamma flows on. ",
    "mn32:8.7": "That is the kind of bhikkhu who would beautify this park.” ",
    "mn32:9.1": "Then Mahāmoggallāna said to Sāriputta, ",
    "mn32:9.2": "“Each of us has answered what occurred to us. ",
    "mn32:9.3": "And now we ask you: ",
    "mn32:9.4": "Venerable Sāriputta, the sal forest park at Gosiṅga is delightful, the night is bright, the sal trees are in full blossom, and divine scents seem to float on the air. ",
    "mn32:9.5": "What kind of bhikkhu would beautify this park?” ",
    "mn32:9.6": "“Venerable Moggallāna, it is when a bhikkhu wields mastery over his mind; his mind does not wield mastery over him. ",
    "mn32:9.7": "In the morning, he abides in whatever abiding or attainment he wants. ",
    "mn32:9.8": "At midday, ",
    "mn32:9.9": "and in the evening, he abides in whatever abiding or attainment he wants. ",
    "mn32:9.10": "Suppose that a ruler or his minister had a chest full of garments of different colors. ",
    "mn32:9.11": "In the morning, he would don whatever pair of garments he wanted. ",
    "mn32:9.12": "At midday, ",
    "mn32:9.13": "and in the evening, he would don whatever pair of garments he wanted. ",
    "mn32:9.14": "In the same way, a bhikkhu wields mastery over his mind; his mind does not wield mastery over him. ",
    "mn32:9.15": "In the morning, he abides in whatever abiding or attainment he wants. ",
    "mn32:9.16": "At midday, ",
    "mn32:9.17": "and in the evening, he abides in whatever abiding or attainment he wants. ",
    "mn32:9.18": "That is the kind of bhikkhu who would beautify this park.” ",
    "mn32:10.1": "Then Venerable Sāriputta said to those venerables, ",
    "mn32:10.2": "“Each of us has answered what occurred to us. ",
    "mn32:10.3": "Come, venerables, let us go to the Auspicious One, and inform him about this. ",
    "mn32:10.4": "As he answers, so we will remember it.” ",
    "mn32:10.5": "“Yes, venerable,” they replied. ",
    "mn32:10.6": "Then those venerables went to the Auspicious One, bowed, and sat down to one side. Venerable Sāriputta told the Auspicious One of how the bhikkhus had come to see him, and how he had asked Venerable Ānanda: ",
    "mn32:11.1": "",
    "mn32:11.2": "",
    "mn32:11.3": "",
    "mn32:11.4": "",
    "mn32:11.5": "",
    "mn32:11.6": "“‘Venerable Ānanda, the sal forest park at Gosiṅga is delightful, the night is bright, the sal trees are in full blossom, and divine scents seem to float on the air. ",
    "mn32:11.7": "What kind of bhikkhu would beautify this park?’ ",
    "mn32:11.8": "When I had spoken, Venerable Ānanda said to me: ",
    "mn32:11.9": "‘Venerable Sāriputta, it is a bhikkhu who is very learned … ",
    "mn32:11.10": "",
    "mn32:11.11": "That is the kind of bhikkhu who would beautify this park.’” ",
    "mn32:11.12": "“Good, good, Sāriputta! ",
    "mn32:11.13": "That is how Ānanda would rightly answer. ",
    "mn32:11.14": "For Ānanda is very learned …” ",
    "mn32:11.15": "",
    "mn32:12.1": "“Next I asked Venerable Revata the same question. ",
    "mn32:12.2": "",
    "mn32:12.3": "",
    "mn32:12.4": "",
    "mn32:12.5": "",
    "mn32:12.6": "He said: ",
    "mn32:12.7": "‘It is a bhikkhu who enjoys solitude … ",
    "mn32:12.8": "That is the kind of bhikkhu who would beautify this park.’” ",
    "mn32:12.9": "“Good, good, Sāriputta! ",
    "mn32:12.10": "That is how Revata would rightly answer. ",
    "mn32:12.11": "For Revata enjoys solitude … ” ",
    "mn32:13.1": "“Next I asked Venerable Anuruddha the same question. ",
    "mn32:13.2": "",
    "mn32:13.3": "",
    "mn32:13.4": "He said: ",
    "mn32:13.5": "‘It is a bhikkhu who surveys a thousand worlds with the divine eye that is purified and superhuman … ",
    "mn32:13.6": "",
    "mn32:13.7": "That is the kind of bhikkhu who would beautify this park.’” ",
    "mn32:13.8": "“Good, good, Sāriputta! That is how Anuruddha would rightly answer. ",
    "mn32:13.9": "For Anuruddha surveys a thousand worlds with the divine eye that is purified and superhuman.” ",
    "mn32:14.1": "“Next I asked Mahākassapa the same question. ",
    "mn32:14.2": "",
    "mn32:14.3": "",
    "mn32:14.4": "",
    "mn32:14.5": "He said: ",
    "mn32:14.6": "‘It is a bhikkhu who lives in the wilderness … and is accomplished in the knowledge-and-vision of liberation; and he speaks in praise of these things. ",
    "mn32:14.7": "That is the kind of bhikkhu who would beautify this park.’” ",
    "mn32:14.8": "“Good, good, Sāriputta! ",
    "mn32:14.9": "That is how Kassapa would righly answer. ",
    "mn32:14.10": "For Kassapa lives in the wilderness … he is accomplished in the knowledge-and-vision of liberation; and he speaks in praise of these things.” ",
    "mn32:15.1": "“Next I asked Mahāmoggallāna the same question. ",
    "mn32:15.2": "",
    "mn32:15.3": "",
    "mn32:15.4": "",
    "mn32:15.5": "He said: ",
    "mn32:15.6": "‘It is when two bhikkhus engage in discussion about the Dhamma … ",
    "mn32:15.7": "That is the kind of bhikkhu who would beautify this park.’” ",
    "mn32:15.8": "“Good, good, Sāriputta! That is how Moggallāna would rightly answer. ",
    "mn32:15.9": "For Moggallāna is a Dhamma speaker.” ",
    "mn32:16.1": "When he had spoken, Moggallāna said to the Auspicious One, ",
    "mn32:16.2": "“Next, I asked Sāriputta: ",
    "mn32:16.3": "‘Each of us has answered what occurred to us. ",
    "mn32:16.4": "And now we ask you: ",
    "mn32:16.5": "Venerable Sāriputta, the sal forest park at Gosiṅga is delightful, the night is bright, the sal trees are in full blossom, and divine scents seem to float on the air. ",
    "mn32:16.6": "What kind of bhikkhu would beautify this park?’ ",
    "mn32:16.7": "When I had spoken, Sāriputta said to me: ",
    "mn32:16.8": "“Venerable Moggallāna, it is when a bhikkhu wields mastery over his mind; his mind does not wield mastery over him. … ",
    "mn32:16.9": "",
    "mn32:16.10": "",
    "mn32:16.11": "",
    "mn32:16.12": "",
    "mn32:16.13": "",
    "mn32:16.14": "",
    "mn32:16.15": "",
    "mn32:16.16": "",
    "mn32:16.17": "",
    "mn32:16.18": "",
    "mn32:16.19": "",
    "mn32:16.20": "That is the kind of bhikkhu who would beautify this park.’” ",
    "mn32:16.21": "“Good, good, Moggallāna! ",
    "mn32:16.22": "That is how Sāriputta would rightly answer. ",
    "mn32:16.23": "For Sāriputta wields mastery over his mind; his mind does not wield mastery over him …” ",
    "mn32:16.24": "",
    "mn32:16.25": "",
    "mn32:16.26": "",
    "mn32:17.1": "When he had spoken, Sāriputta asked the Auspicious One, ",
    "mn32:17.2": "“Venerable sir, who has spoken well?” ",
    "mn32:17.3": "“You have all spoken well in [your own] way. ",
    "mn32:17.4": "However, listen to me also as to what kind of bhikkhu would beautify this sal forest park at Gosiṅga. ",
    "mn32:17.5": "It is a bhikkhu who, after the meal, returns from almsround, sits down cross-legged, sets his body straight, and establishes recollectedness at the fore, thinking: ",
    "mn32:17.6": "‘I will not break this sitting posture until my mind is liberated from the influxes through non-assumption!’ ",
    "mn32:17.7": "That is the kind of bhikkhu who would beautify this park.” ",
    "mn32:17.8": "That is what the Auspicious One said. ",
    "mn32:17.9": "Pleased, those venerables delighted in what the Auspicious One said. "
}
