{
    "mn33:0.1": "Middle Discourses 33 ",
    "mn33:0.2": "The Longer Discourse on the Cowherd ",
    "mn33:1.1": "Thus have I heard. ",
    "mn33:1.2": "At one time the Auspicious One was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
    "mn33:1.3": "There the Auspicious One addressed the bhikkhus, ",
    "mn33:1.4": "“Bhikkhus!” ",
    "mn33:1.5": "“Venerable sir,” they replied. ",
    "mn33:1.6": "The Auspicious One said this: ",
    "mn33:2.1": "“Bhikkhus, a cowherd with eleven factors cannot maintain and expand a herd of cattle. ",
    "mn33:2.2": "What eleven? ",
    "mn33:2.3": "It is when a cowherd does not know form, is unskilled in characteristics, does not pick out flies’ eggs, does not dress wounds, does not spread smoke, does not know the ford, does not know satisfaction, does not know the trail, is not skilled in pastures, milks dry, and does not show extra respect to the bulls who are fathers and leaders of the herd. ",
    "mn33:2.4": "A cowherd with these eleven factors cannot maintain and expand a herd of cattle. ",
    "mn33:3.1": "In the same way, a bhikkhu with eleven qualities cannot achieve growth, improvement, or maturity in this teaching-and-discipline. ",
    "mn33:3.2": "What eleven? ",
    "mn33:3.3": "It is when a bhikkhu does not know form, is unskilled in characteristics, does not pick out flies’ eggs, does not dress wounds, does not spread smoke, does not know the ford, does not know satisfaction, does not know the trail, is not skilled in pastures, milks dry, and does not show extra respect to senior bhikkhus of long standing, long gone forth, fathers and leaders of the Saṅgha. ",
    "mn33:4.1": "And how does a bhikkhu not know form? ",
    "mn33:4.2": "It is when a bhikkhu does not understand as it is that all form consists of the four great elements and form derived from the four great elements. ",
    "mn33:4.3": "That is how a bhikkhu does not know form. ",
    "mn33:5.1": "And how is a bhikkhu not skilled in characteristics? ",
    "mn33:5.2": "It is when a bhikkhu does not understand that a fool is characterized by his actions, and a wise man is characterized by his actions. ",
    "mn33:5.3": "That is how a bhikkhu is not skilled in characteristics. ",
    "mn33:6.1": "And how does a bhikkhu not pick out flies’ eggs? ",
    "mn33:6.2": "It is when a bhikkhu tolerates a sensual, averse, or cruel thought that has arisen. He tolerates bad, unbeneficial thoughts that have arisen. He does not give them up, dispel them, eliminate them, and obliterate them. ",
    "mn33:6.3": "That is how a bhikkhu does not pick out flies’ eggs. ",
    "mn33:7.1": "And how does a bhikkhu not dress wounds? ",
    "mn33:7.2": "Having seen a sight with the eye, he grasps at signs and features of it ",
    "mn33:7.3": "on account of which—due to abiding with the eye faculty unrestrained—bad, unbeneficial thoughts of longing and upset would flow in on him. He does not practice to restrain that; he does not guard the eye faculty or bring about the restraint of the eye faculty. ",
    "mn33:7.4": "Having heard a sound with the ear … ",
    "mn33:7.5": "Having smelled an odor with the nose … ",
    "mn33:7.6": "Having tasted a flavor with the tongue … ",
    "mn33:7.7": "Having touched a touch with the body … ",
    "mn33:7.8": "Having cognized a phenomenon with the mental faculty, he grasps at the signs and features of it ",
    "mn33:7.9": "on account of which—due to abiding with the mental faculty unrestrained—bad, unbeneficial thoughts of longing and upset would flow in on him. He does not practice to restrain that; he does not guard the mental faculty or bring about the restraint of the mental faculty. ",
    "mn33:7.10": "That is how a bhikkhu does not dress wounds. ",
    "mn33:8.1": "And how does a bhikkhu not spread smoke? ",
    "mn33:8.2": "It is when a bhikkhu does not teach others the Dhamma in detail as he learned and memorized it. ",
    "mn33:8.3": "That is how a bhikkhu does not spread smoke. ",
    "mn33:9.1": "And how does a bhikkhu not know the ford? ",
    "mn33:9.2": "It is when a bhikkhu does not from time to time go up to those bhikkhus who are very learned—inheritors of the heritage, who have memorized the teachings, the monastic code, and the outlines—and ask them questions: ",
    "mn33:9.3": "‘Why, venerable sir, does it say this? ",
    "mn33:9.4": "What does that mean?’ ",
    "mn33:9.5": "Those venerables do not clarify what is unclear, reveal what is obscure, and dispel doubt with regard to the many doubtful matters. ",
    "mn33:9.6": "That is how a bhikkhu does not know the ford. ",
    "mn33:10.1": "And how does a bhikkhu not know satisfaction? ",
    "mn33:10.2": "It is when a bhikkhu, when the teaching-and-discipline proclaimed by the Realized One are being taught, he does not realize the Dhamma and its meaning, and does not gain gladness connected with the Dhamma. ",
    "mn33:10.3": "That is how a bhikkhu does not know satisfaction. ",
    "mn33:11.1": "And how does a bhikkhu not know the trail? ",
    "mn33:11.2": "It is when a bhikkhu does not understand the Noble Eightfold Path as it is. ",
    "mn33:11.3": "That is how a bhikkhu does not know the trail. ",
    "mn33:12.1": "And how is a bhikkhu not skilled in pastures? ",
    "mn33:12.2": "It is when a bhikkhu does not understand the four establishments of recollectedness as they are. ",
    "mn33:12.3": "That is how a bhikkhu is not skilled in pastures. ",
    "mn33:13.1": "And how does a bhikkhu milk dry? ",
    "mn33:13.2": "It is when a bhikkhu is invited by a householder to accept robes, almsfood, lodgings, and medicines and supplies for the sick, and that bhikkhu does not know moderation in accepting. ",
    "mn33:13.3": "That is how a bhikkhu milks dry. ",
    "mn33:14.1": "And how does a bhikkhu not show extra respect to senior bhikkhus of long standing, long gone forth, fathers and leaders of the Saṅgha? ",
    "mn33:14.2": "It is when a bhikkhu’s bodily, verbal, and mental actions towards senior bhikkhus of long standing—long gone forth, fathers and leaders of the Saṅgh—are not friendly, both in public and in private. ",
    "mn33:14.3": "",
    "mn33:14.4": "",
    "mn33:14.5": "That is how a bhikkhu does not show extra respect to senior bhikkhus of long standing, long gone forth, fathers and leaders of the Saṅgha. ",
    "mn33:14.6": "A bhikkhu with these eleven qualities cannot achieve growth, improvement, or maturity in this teaching-and-discipline. ",
    "mn33:15.1": "A cowherd with eleven factors can maintain and expand a herd of cattle. ",
    "mn33:15.2": "What eleven? ",
    "mn33:15.3": "It is when a cowherd knows form, is skilled in characteristics, picks out flies’ eggs, dresses wounds, spreads smoke, knows the ford, knows satisfaction, knows the trail, is skilled in pastures, does not milk dry, and shows extra respect to the bulls who are fathers and leaders of the herd. ",
    "mn33:15.4": "A cowherd with these eleven factors can maintain and expand a herd of cattle. ",
    "mn33:16.1": "In the same way, a bhikkhu with eleven qualities can achieve growth, improvement, and maturity in this teaching-and-discipline. ",
    "mn33:16.2": "What eleven? ",
    "mn33:16.3": "It is when a bhikkhu knows form, is skilled in characteristics, picks out flies’ eggs, dresses wounds, spreads smoke, knows the ford, knows satisfaction, knows the trail, is skilled in pastures, does not milk dry, and shows extra respect to senior bhikkhus of long standing, long gone forth, fathers and leaders of the Saṅgha. ",
    "mn33:17.1": "And how does a bhikkhu know form? ",
    "mn33:17.2": "It is when a bhikkhu understands as it is that all form consists of the four great elements and form derived from the four great elements. ",
    "mn33:17.3": "That is how a bhikkhu knows form. ",
    "mn33:18.1": "And how is a bhikkhu skilled in characteristics? ",
    "mn33:18.2": "It is when a bhikkhu understands that a fool is characterized by his actions, and a wise man is characterized by his actions. ",
    "mn33:18.3": "That is how a bhikkhu is skilled in characteristics. ",
    "mn33:19.1": "And how does a bhikkhu pick out flies’ eggs? ",
    "mn33:19.2": "It is when a bhikkhu does not tolerate a sensual, averse, or cruel thought that has arisen. He does not tolerate any bad, unbeneficial thoughts that have arisen, but gives them up, dispels them, eliminates them, and obliterates them. ",
    "mn33:19.3": "That is how a bhikkhu picks out flies’ eggs. ",
    "mn33:20.1": "And how does a bhikkhu dress wounds? ",
    "mn33:20.2": "Having seen a sight with the eye, he does not grasp at signs and features of it ",
    "mn33:20.3": "on account of which—due to abiding with the eye faculty unrestrained—bad, unbeneficial thoughts of longing and upset would flow in on him. He practices to restrain that; he guards the eye faculty and brings about the restraint of the eye faculty. ",
    "mn33:20.4": "Having heard a sound with the ear … ",
    "mn33:20.5": "Having smelled an odor with the nose … ",
    "mn33:20.6": "Having tasted a flavor with the tongue … ",
    "mn33:20.7": "Having touched a touch with the body … ",
    "mn33:20.8": "Having cognized a phenomenon with the mental faculty, he does not grasp at signs and features of it ",
    "mn33:20.9": "on account of which—due to abiding with the mental faculty unrestrained—bad, unbeneficial thoughts of longing and upset would flow in on him. He practices to restrain that; he guards the mental faculty and brings about the restraint of the mental faculty. ",
    "mn33:20.10": "That is how a bhikkhu dresses wounds. ",
    "mn33:21.1": "And how does a bhikkhu spread smoke? ",
    "mn33:21.2": "It is when a bhikkhu teaches others the Dhamma in detail as he learned and memorized it. ",
    "mn33:21.3": "That is how a bhikkhu spreads smoke. ",
    "mn33:22.1": "And how does a bhikkhu know the ford? ",
    "mn33:22.2": "It is when from time to time a bhikkhu goes up to those bhikkhus who are very learned—inheritors of the heritage, who have memorized the teachings, the monastic code, and the outlines—and asks them questions: ",
    "mn33:22.3": "‘Why, venerable sir, does it say this? ",
    "mn33:22.4": "What does that mean?’ ",
    "mn33:22.5": "Those venerables clarify what is unclear, reveal what is obscure, and dispel doubt with regard to the many doubtful matters. ",
    "mn33:22.6": "That is how a bhikkhu knows the ford. ",
    "mn33:23.1": "And how does a bhikkhu know satisfaction? ",
    "mn33:23.2": "It is when a bhikkhu, when the teaching-and-discipline proclaimed by the Realized One are being taught, realizes the Dhamma and its meaning, and gains gladness connected with the Dhamma. ",
    "mn33:23.3": "That is how a bhikkhu knows satisfaction. ",
    "mn33:24.1": "And how does a bhikkhu know the trail? ",
    "mn33:24.2": "It is when a bhikkhu understand the Noble Eightfold Path as it is. ",
    "mn33:24.3": "That is how a bhikkhu knows the trail. ",
    "mn33:25.1": "And how is a bhikkhu skilled in pastures? ",
    "mn33:25.2": "It is when a bhikkhu understands the four establishments of recollectedness as they are. ",
    "mn33:25.3": "That is how a bhikkhu is skilled in pastures. ",
    "mn33:26.1": "And how does a bhikkhu not milk dry? ",
    "mn33:26.2": "It is when a bhikkhu is invited by a householder to accept robes, almsfood, lodgings, and medicines and supplies for the sick, ",
    "mn33:26.3": "and that bhikkhu knows moderation in accepting. ",
    "mn33:26.4": "That is how a bhikkhu does not milk dry. ",
    "mn33:27.1": "And how does a bhikkhu show extra respect to senior bhikkhus of long standing, long gone forth, fathers and leaders of the Saṅgha? ",
    "mn33:27.2": "It is when a bhikkhu’s bodily, verbal, and mental actions towards senior bhikkhus of long standing—long gone forth, fathers and leaders of the Saṅgha—are friendly, both in public and in private. ",
    "mn33:27.3": "",
    "mn33:27.4": "",
    "mn33:27.5": "That is how a bhikkhu shows extra respect to senior bhikkhus of long standing, long gone forth, fathers and leaders of the Saṅgha. ",
    "mn33:27.6": "A bhikkhu with these eleven qualities can achieve growth, improvement, and maturity in this teaching-and-discipline.” ",
    "mn33:27.7": "That is what the Auspicious One said. ",
    "mn33:27.8": "Pleased, the bhikkhus delighted in what the Auspicious One said. "
}
