{
    "mn36:0.1": "Middle Discourses 36 ",
    "mn36:0.2": "The Longer Discourse With Saccaka ",
    "mn36:1.1": "Thus have I heard. ",
    "mn36:1.2": "At one time the Auspicious One was staying near Vesālī, at the Great Wood, in the hall with the peaked roof. ",
    "mn36:2.1": "Now at that time in the morning the Auspicious One, being properly dressed, took his bowl and robe, wishing to enter Vesālī for alms. ",
    "mn36:3.1": "Then as Saccaka, the son of Jain parents, was going for a walk he approached the hall with the peaked roof in the Great Wood. ",
    "mn36:3.2": "Venerable Ānanda saw him coming off in the distance, ",
    "mn36:3.3": "and said to the Auspicious One, ",
    "mn36:3.4": "“Venerable sir, Saccaka, the son of Jain parents, is coming. He is a debater and clever speaker respected by many people. ",
    "mn36:3.5": "He wants to discredit the Buddha, the Dhamma, and the Saṅgha. ",
    "mn36:3.6": "Please, venerable sir, sit for a moment out of compassion.” ",
    "mn36:3.7": "The Auspicious One sat on the seat spread out. ",
    "mn36:3.8": "Then Saccaka approached the Auspicious One, and exchanged pleasantries with him. When the amicable and cordial talk was over, he sat down to one side and said to the Auspicious One, ",
    "mn36:4.1": "“Master Gotama, there are some ascetics and brahmins who live committed to the practice of developing the body, but not to developing the mind. ",
    "mn36:4.2": "They are struck by painful bodily feelings. ",
    "mn36:4.3": "In the past, when one was struck by painful bodily feelings, one’s thighs would become paralyzed, one’s heart would burst, hot blood would gush from one’s mouth, and one would go mad formal and lose one’s mind. ",
    "mn36:4.4": "The mind was subject to the body, and the body wielded mastery over it. ",
    "mn36:4.5": "Why is that? ",
    "mn36:4.6": "Because the mind was not developed. ",
    "mn36:4.7": "There are some ascetics and brahmins who live committed to the practice of developing the mind, but not of developing the body. ",
    "mn36:4.8": "They are struck by unpleasant mental feelings. ",
    "mn36:4.9": "In the past, when one was struck by unpleasant mental feelings, one’s thighs would become paralyzed, one’s heart would burst, hot blood would gush from one’s mouth, and one would go mad and lose one’s mind. ",
    "mn36:4.10": "One’s body was subject to the mind, and the mind wielded mastery over it. ",
    "mn36:4.11": "Why is that? ",
    "mn36:4.12": "Because the body was not developed. ",
    "mn36:4.13": "It occurs to me that ",
    "mn36:4.14": "Master Gotama’s disciples must live committed to the practice of developing the mind, but not of developing the body.” ",
    "mn36:5.1": "“But Aggivessana, what have you heard about developing the body?” ",
    "mn36:5.2": "“Take, for example, ",
    "mn36:5.3": "Nanda Vaccha, Kisa Saṅkicca, and the bamboo-staffed ascetic Gosāla. ",
    "mn36:5.4": "They go naked, ignoring conventions. They lick their hands, and do not come or wait when called. They do not consent to food brought to them, or food prepared on their behalf, or an invitation for a meal. ",
    "mn36:5.5": "They do not receive anything from a pot or bowl; or from someone who keeps sheep, or who has a weapon or a shovel in their home; or where a couple is eating; or where there is a woman who is pregnant, breastfeeding, or who has a man in her home; or where there is a dog waiting or flies buzzing. They accept no fish or meat or liquor or wine, and drink no beer. ",
    "mn36:5.6": "They go to just one house for alms, taking just one mouthful, or two houses and two mouthfuls, up to seven houses and seven mouthfuls. ",
    "mn36:5.7": "They feed on one saucer a day, two saucers a day, up to seven saucers a day. ",
    "mn36:5.8": "They eat once a day, once every second day, up to once a week, and so on, even up to once a fortnight. They live committed to the practice of eating food at set intervals.” ",
    "mn36:6.1": "“But Aggivessana, do they get by on so little?” ",
    "mn36:6.2": "“No, Master Gotama. ",
    "mn36:6.3": "Sometimes they eat luxury fresh and cooked foods and drink a variety of luxury beverages. ",
    "mn36:6.4": "They gather their body’s strength, build it up, and become fat.” ",
    "mn36:6.5": "“What they earlier gave up, they later received back. That is how there is the increase and decrease of this body. ",
    "mn36:6.6": "But Aggivessana, what have you heard about developing the mind?” ",
    "mn36:6.7": "When Saccaka was questioned by the Auspicious One about the development of the mind, he was stumped. ",
    "mn36:7.1": "So the Auspicious One said to Saccaka, ",
    "mn36:7.2": "“The development of the body that you have described is not the legitimate development of the body in the noble one’s training. ",
    "mn36:7.3": "And since you do not even understand the development of the body, how can you possibly understand the development of the mind? ",
    "mn36:7.4": "Still, as to how one has developed neither the body nor the mind, and how one has developed both the body and the mind, ",
    "mn36:7.5": "listen and apply your mind well, I will speak.” ",
    "mn36:7.6": "“Yes, sir,” replied Saccaka. ",
    "mn36:7.7": "The Auspicious One said this: ",
    "mn36:8.1": "“And how has someone developed neither the body nor the mind? ",
    "mn36:8.2": "Take an unlearned ordinary person for whom a pleasant feeling arises. ",
    "mn36:8.3": "Struck by that pleasant feeling, he harbors passion for it. ",
    "mn36:8.4": "That pleasant feeling ceases. ",
    "mn36:8.5": "With the cessation of that pleasant feeling, an unpleasant feeling arises. ",
    "mn36:8.6": "Struck by that unpleasant feeling, he sorrows, wails, laments, beats his breast, and falls into a muddle. ",
    "mn36:8.7": "Because the body is undeveloped, that arisen pleasant feeling endures with a grip on the mind. And because the mind is undeveloped, that arisen unpleasant feeling endures with a grip on the mind. ",
    "mn36:8.8": "Anyone for whom arisen pleasant feeling endures with a grip on the mind due to the body being undeveloped, and arisen unpleasant feeling endures with a grip on the mind due to the mind being undeveloped, is said to be undeveloped in the body and undeveloped in the mind. ",
    "mn36:9.1": "And how is someone developed in the body and developed in the mind? ",
    "mn36:9.2": "Take a learned noble disciple for whom a pleasant feeling arises. ",
    "mn36:9.3": "Struck by that pleasant feeling, he does not harbor passion for it. ",
    "mn36:9.4": "That pleasant feeling ceases. ",
    "mn36:9.5": "With the cessation of that pleasant feeling, an unpleasant feeling arises. ",
    "mn36:9.6": "Struck that by unpleasant feeling, he does not sorrow, wail, lament, beat his breast, or fall into a muddle. ",
    "mn36:9.7": "Because the body is developed, that arisen pleasant feeling does not endure with a grip on the mind. And because the mind is developed, that arisen unpleasant feeling does not endure with a grip on the mind. ",
    "mn36:9.8": "Anyone for whom arisen pleasant feeling does not endure with a grip on the mind due to the body being developed, and unpleasant feeling does not endure with a grip on the mind due to the mind being developed, is said to be developed in the body and developed in the mind. ",
    "mn36:10.1": "“I am quite confident that Master Gotama ",
    "mn36:10.2": "is developed in the body and developed in the mind.” ",
    "mn36:10.3": "“Your words are clearly invasive and intrusive, Aggivessana. ",
    "mn36:10.4": "Nevertheless, I will answer you. ",
    "mn36:10.5": "Ever since I shaved off my hair and beard, dressed in ocher robes, and went forth from the lay life to homelessness, it has not been possible for any arisen pleasant or unpleasant feeling to to endure with a grip on my mind.” ",
    "mn36:11.1": "“Master Gotama must not have experienced the kind of pleasant or unpleasant feelings that would endure with a grip on the mind when they arise.” ",
    "mn36:12.1": "“How could I not, Aggivessana? ",
    "mn36:12.2": "Before my awakening—when I was still unawakened but intent on awakening—I thought: ",
    "mn36:12.3": "‘Household life is confined and dusty, but the life of one gone forth is wide open. ",
    "mn36:12.4": "It is not easy for someone living at home to lead the renunciate life utterly complete and pure, like a polished shell. ",
    "mn36:12.5": "Why don’t I shave off my hair and beard, dress in ocher robes, and go forth from the lay life to homelessness?’ ",
    "mn36:13.1": "Some time later, while still with pristine black hair, blessed with youth, in the prime of life—though my mother and father wished otherwise, weeping with tearful faces—I shaved off my hair and beard, dressed in ocher robes, and went forth from the lay life to homelessness. ",
    "mn36:13.2": "Once I had gone forth I set out seeking what is good, seeking the supreme state of sublime peace. I approached Āḷāra Kālāma and said to him, ",
    "mn36:13.3": "‘Venerable Kālāma, I wish to lead the renunciate life in this teaching-and-discipline.’ ",
    "mn36:13.4": "Āḷāra Kālāma replied, ",
    "mn36:13.5": "‘You may do so, venerable. ",
    "mn36:13.6": "This Dhamma is such that a wise man can soon abide having for himself comprehended, experienced, and entered upon his own teacher’s knowledge.’ ",
    "mn36:13.7": "I quickly learned that Dhamma. ",
    "mn36:13.8": "As far as lip-recital and oral recitation went, I spoke the doctrine of knowledge, the elder doctrine. I claimed to know and see, and so did others. ",
    "mn36:13.9": "Then it occurred to me, ",
    "mn36:13.10": "‘Not solely through faith does Āḷāra Kālāma declare that he abides having comprehended, experienced, and entered upon this Dhamma. ",
    "mn36:13.11": "Surely he abides knowing and seeing this Dhamma.’ ",
    "mn36:13.12": "So I approached Āḷāra Kālāma and said to him, ",
    "mn36:13.13": "‘Venerable Kālāma, to what extent do you declare that you abide having for yourself comprehended, experienced, and entered upon this Dhamma ?’ ",
    "mn36:13.14": "When I said this, he described the extent of nothingness. ",
    "mn36:13.15": "Then it occurred to me, ",
    "mn36:13.16": "‘It is not just Āḷāra Kālāma who has faith, ",
    "mn36:13.17": "effort, ",
    "mn36:13.18": "recollectedness, ",
    "mn36:13.19": "composure, ",
    "mn36:13.20": "and understanding; I too have these things. ",
    "mn36:13.21": "Why don’t I make an effort to realize the same Dhamma which Āḷāra Kālāma declares that he abides having for himself comprehended, experienced, and entered upon? ",
    "mn36:13.22": "I soon abided having for myself comprehended, experienced, and entered upon that Dhamma. ",
    "mn36:14.1": "So I approached Āḷāra Kālāma and said to him, ",
    "mn36:14.2": "‘Venerable Kālāma, is it to this extent that you declare that you abide having for yourself comprehended, experienced, and entered upon this Dhamma?’ ",
    "mn36:14.3": "‘Yes, venerable.’ ",
    "mn36:14.4": "‘I too, venerable, abide having for myself comprehended, experienced, and entered upon this Dhamma to that extent.’ ",
    "mn36:14.5": "‘We are fortunate, venerable, so very fortunate ",
    "mn36:14.6": "to see a venerable such as yourself as one of our fellow renunciates! ",
    "mn36:14.7": "So the same Dhamma that I proclaim, having for myself comprehended, realized, and entered upon it, you abide having for yourself comprehended, experienced, and entered upon. ",
    "mn36:14.8": "The same Dhamma that you abide having for yourself comprehended, realized, and entered upon, I proclaim, having for myself comprehended, experienced, and entered upon it. ",
    "mn36:14.9": "So the Dhamma that I know, you know, and the Dhamma that you know, I know. ",
    "mn36:14.10": "I am like you and you are like me. ",
    "mn36:14.11": "Come now, venerable! We should both lead this group together.’ ",
    "mn36:14.12": "And that is how my teacher Āḷāra Kālāma placed me, his student, on the same position as him, and honored me highly. ",
    "mn36:14.13": "Then it occurred to me, ",
    "mn36:14.14": "‘This Dhamma does not lead to disenchantment, dispassion, cessation, peace, comprehension, awakening, and Nibbāna. It only leads as far as reappearance in the extent of nothingness.’ ",
    "mn36:14.15": "Realizing that that Dhamma was inadequate, I left disappointed. ",
    "mn36:15.1": "I set out seeking what is good, seeking the supreme state of sublime peace. I approached Uddaka son of Rāma and said to him, ",
    "mn36:15.2": "‘Venerable, I wish to lead the renunciate life in this teaching-and-discipline.’ ",
    "mn36:15.3": "Uddaka replied, ",
    "mn36:15.4": "‘You may do so, venerable. ",
    "mn36:15.5": "This Dhamma is such that a wise man can soon abide having for himself comprehended, experienced, and entered upon his own teacher’s knowledge.’ ",
    "mn36:15.6": "I quickly learned that Dhamma. ",
    "mn36:15.7": "As far as lip-recital and oral recitation went, I spoke the doctrine of knowledge, the elder doctrine. I claimed to know and see, and so did others. ",
    "mn36:15.8": "Then it occurred to me, ",
    "mn36:15.9": "‘Not solely through faith did Rāma declare that he abided having comprehended, experienced, and entered upon this Dhamma. ",
    "mn36:15.10": "Surely he abided knowing and seeing this Dhamma.’ ",
    "mn36:15.11": "So I approached Uddaka son of Rāma and said to him, ",
    "mn36:15.12": "‘Venerable, to what extent did Rāma declare that he abided having for himself comprehended, experienced, and entered upon this Dhamma ?’ ",
    "mn36:15.13": "When I said this, Uddaka son of Rāma described the extent of neither-perception-nor-non-perception. ",
    "mn36:15.14": "Then it occurred to me, ",
    "mn36:15.15": "‘It is not just Rāma who had faith, ",
    "mn36:15.16": "energy, ",
    "mn36:15.17": "recollectedness, ",
    "mn36:15.18": "composure, ",
    "mn36:15.19": "and understanding; I too have these things. ",
    "mn36:15.20": "Why don’t I make an effort to realize the same Dhamma which Rāma declared that he abided having for himself comprehended, experienced, and entered upon?’ ",
    "mn36:15.21": "I soon abided having for myself comprehended, experienced, and entered upon that Dhamma. ",
    "mn36:15.22": "So I approached Uddaka son of Rāma and said to him, ",
    "mn36:15.23": "‘Venerable, is it to this extent that Rāma declared that he abided having for himself comprehended, experienced, and entered upon this Dhamma?’ ",
    "mn36:15.24": "‘Yes, venerable.’ ",
    "mn36:15.25": "‘I too, venerable, abide having for myself comprehended, experienced, and entered upon this Dhamma to that extent.’ ",
    "mn36:15.26": "‘We are fortunate, venerable, so very fortunate ",
    "mn36:15.27": "to see a venerable such as yourself as one of our fellow renunciates! ",
    "mn36:15.28": "So the same Dhamma that Rāma proclaimed, having comprehended, realized, and entered upon it for himself, you abide having for yourself comprehended, experienced, and entered upon. ",
    "mn36:15.29": "So the Dhamma that Rāma comprehended, you know, and the Dhamma you know, Rāma comprehended. ",
    "mn36:15.30": "Rāma was like you and you are like Rāma. ",
    "mn36:15.31": "Come now, venerable! You should lead this community.’ ",
    "mn36:15.32": "And that is how my fellow renunciate Uddaka son of Rāma placed me in the position of a teacher and honored me highly. ",
    "mn36:15.33": "Then it occurred to me, ",
    "mn36:15.34": "‘This Dhamma does not lead to disenchantment, dispassion, cessation, peace, comprehension, awakening, and Nibbāna. It only leads as far as reappearance in the extent of neither-perception-nor-non-perception.’ ",
    "mn36:15.35": "Realizing that this teaching was inadequate, I left disappointed. ",
    "mn36:16.1": "I set out seeking what is good, seeking the supreme state of sublime peace. Traveling stage by stage in the Magadhan lands, I arrived at Senānigama in Uruvelā. ",
    "mn36:16.2": "There I saw a delightful park, a pleasant grove with a flowing river that was clean and charming, with smooth banks. And nearby was a village for alms. ",
    "mn36:16.3": "Then it occurred to me, ",
    "mn36:16.4": "‘This park is truly delightful, a pleasant grove with a flowing river that is clean and charming, with smooth banks. And nearby there is a village to go for alms. ",
    "mn36:16.5": "This is good enough for the striving of a clansman wanting to strive.’ ",
    "mn36:16.6": "So I sat down right there, thinking: ",
    "mn36:16.7": "‘This is good enough for striving.’ ",
    "mn36:17.1": "And then these three similes, which were neither supernaturally inspired, nor learned before in the past, occurred to me. ",
    "mn36:17.2": "Suppose there was a green, sappy log, and it was lying in water. ",
    "mn36:17.3": "Then a man comes along with an upper fire stick, ",
    "mn36:17.4": "thinking to light a fire and produce heat. ",
    "mn36:17.5": "What do you think, Aggivessana? ",
    "mn36:17.6": "By drilling the stick against that green, sappy log lying in the water, could he light a fire and produce heat?” ",
    "mn36:17.7": "“No, Master Gotama. ",
    "mn36:17.8": "Why not? ",
    "mn36:17.9": "Because it is a green, sappy log, and it is lying in the water. ",
    "mn36:17.10": "That man will eventually become weary and frustrated.” ",
    "mn36:17.11": "“In the same way, there are ascetics and brahmins who do not live withdrawn in body from sensuality. They have not internally given up and allayed desire, affection, infatuation, thirst, and burning for sensuality. Regardless of whether or not they feel violent, painful, sharp, severe, acute feelings, they are incapable of knowledge-and-vision, of supreme awakening. ",
    "mn36:17.12": "",
    "mn36:17.13": "This was the first simile that occurred to me. ",
    "mn36:18.1": "Then a second simile occurred to me. ",
    "mn36:18.2": "Suppose there was a green, sappy log, and it was lying on dry land far from the water. ",
    "mn36:18.3": "Then a man comes along with an upper fire stick, ",
    "mn36:18.4": "thinking to light a fire and produce heat. ",
    "mn36:18.5": "What do you think, Aggivessana? ",
    "mn36:18.6": "By drilling the stick against that green, sappy log on dry land far from water, could he light a fire and produce heat?” ",
    "mn36:18.7": "“No, Master Gotama. ",
    "mn36:18.8": "Why not? ",
    "mn36:18.9": "Because it is still a green, sappy log, despite the fact that it is lying on dry land far from water. ",
    "mn36:18.10": "That man will eventually become weary and frustrated.” ",
    "mn36:18.11": "“In the same way, there are ascetics and brahmins who live withdrawn in body from sensuality, but they have not internally given up and allayed desire, affection, infatuation, thirst, and burning for sensuality. Regardless of whether or not they feel violent, painful, sharp, severe, acute feelings, they are incapable of knowledge-and-vision, of supreme awakening. ",
    "mn36:18.12": "This was the second simile that occurred to me. ",
    "mn36:19.1": "Then a third simile occurred to me. ",
    "mn36:19.2": "Suppose there was a dried up, withered log, and it was lying on dry land far from the water. ",
    "mn36:19.3": "Then a man comes along with an upper fire stick, ",
    "mn36:19.4": "thinking to light a fire and produce heat. ",
    "mn36:19.5": "What do you think, Aggivessana? ",
    "mn36:19.6": "By drilling the stick against that dried up, withered log on dry land far from water, could he light a fire and produce heat?” ",
    "mn36:19.7": "“Yes, Master Gotama. ",
    "mn36:19.8": "Why is that? ",
    "mn36:19.9": "Because it is a dried up, withered log, and it is lying on dry land far from water.” ",
    "mn36:19.10": "“In the same way, there are ascetics and brahmins who live withdrawn in body from sensuality, and they have internally given up and allayed desire, affection, infatuation, thirst, and burning for sensuality. Regardless of whether or not they feel violent, painful, sharp, severe, acute feelings, they are capable of knowledge-and-vision, of supreme awakening. ",
    "mn36:19.11": "This was the third simile that occurred to me. ",
    "mn36:19.12": "These are the three similes, which were neither supernaturally inspired, nor learned before in the past, that occurred to me. ",
    "mn36:20.1": "Then it occurred to me, ",
    "mn36:20.2": "‘Why don’t I, with teeth clenched and tongue pressed against the roof of my mouth, squeeze, squash, and crush mind with mind?’ ",
    "mn36:20.3": "So that is what I did, ",
    "mn36:20.4": "until sweat ran from my armpits. ",
    "mn36:20.5": "It was like when a strong man grabs a weaker man by the head or throat or shoulder and squeezes, squashes, and crushes him. ",
    "mn36:20.6": "In the same way, with teeth clenched and tongue pressed against the roof of my mouth, I squeezed, squashed, and crushed mind with mind until sweat ran from my armpits. ",
    "mn36:20.7": "My effort was roused up and steadfast, my recollectedness was established and lucid, but by body was overwrought and not calm, afflicted by that painful striving. ",
    "mn36:20.8": "But even such arisen painful feeling did not endure with a grip on my mind. ",
    "mn36:21.1": "Then it occurred to me, ",
    "mn36:21.2": "‘Why don’t I engage in the breathless practice?’ ",
    "mn36:21.3": "So I cut off my breathing through my mouth and nose. ",
    "mn36:21.4": "But then winds came out my ears making a loud noise, ",
    "mn36:21.5": "like the puffing of a blacksmith’s bellows. ",
    "mn36:21.6": "",
    "mn36:21.7": "My effort was roused up and steadfast, my recollectedness was established and lucid, but by body was overwrought and not calm, afflicted by that painful striving. ",
    "mn36:21.8": "But even such arisen painful feeling did not endure with a grip on my mind. ",
    "mn36:22.1": "Then it occurred to me, ",
    "mn36:22.2": "‘Why don’t I engage in the breathless practice further?’ ",
    "mn36:22.3": "So I cut off my breathing through my mouth and nose and ears. ",
    "mn36:22.4": "But then strong winds ground my head, ",
    "mn36:22.5": "like a strong man was drilling into my head with a sharp point. ",
    "mn36:22.6": "",
    "mn36:22.7": "My effort was roused up and steadfast, my recollectedness was established and lucid, but by body was overwrought and not calm, afflicted by that painful striving. ",
    "mn36:22.8": "But even such arisen painful feeling did not endure with a grip on my mind. ",
    "mn36:23.1": "Then it occurred to me, ",
    "mn36:23.2": "‘Why don’t I engage in the breathless practice further?’ ",
    "mn36:23.3": "So I cut off my breathing through my mouth and nose and ears. ",
    "mn36:23.4": "But then I received a severe headache, ",
    "mn36:23.5": "like a strong man was tightening a tough leather strap around my head. ",
    "mn36:23.6": "",
    "mn36:23.7": "My effort was roused up and steadfast, my recollectedness was established and lucid, but by body was overwrought and not calm, afflicted by that painful striving. ",
    "mn36:23.8": "But even such arisen painful feeling did not endure with a grip on my mind. ",
    "mn36:24.1": "Then it occurred to me, ",
    "mn36:24.2": "‘Why don’t I engage in the breathless practice further?’ ",
    "mn36:24.3": "So I cut off my breathing through my mouth and nose and ears. ",
    "mn36:24.4": "But then strong winds carved up my belly, ",
    "mn36:24.5": "like a deft butcher or his apprentice was slicing my belly open with a meat cleaver. ",
    "mn36:24.6": "",
    "mn36:24.7": "My effort was roused up and steadfast, my recollectedness was established and lucid, but by body was overwrought and not calm, afflicted by that painful striving. ",
    "mn36:24.8": "But even such arisen painful feeling did not endure with a grip on my mind. ",
    "mn36:25.1": "Then it occurred to me, ",
    "mn36:25.2": "‘Why don’t I engage in the breathless practice further?’ ",
    "mn36:25.3": "So I cut off my breathing through my mouth and nose and ears. ",
    "mn36:25.4": "But then there was an intense burning in my body, ",
    "mn36:25.5": "like two strong men grabbing a weaker man by the arms to burn and scorch him on a pit of glowing coals. ",
    "mn36:25.6": "",
    "mn36:25.7": "My effort was roused up and steadfast, my recollectedness was established and lucid, but by body was overwrought and not calm, afflicted by that painful striving. ",
    "mn36:25.8": "But even such arisen painful feeling did not endure with a grip on my mind. ",
    "mn36:26.1": "Then some deities saw me and said, ",
    "mn36:26.2": "‘The ascetic Gotama is dead.’ ",
    "mn36:26.3": "Others said, ",
    "mn36:26.4": "‘He is not dead, but he is dying.’ ",
    "mn36:26.5": "Others said, ",
    "mn36:26.6": "‘He is not dead or dying. The ascetic Gotama is an Arahant, for that is how the Arahants live.’ ",
    "mn36:27.1": "Then it occurred to me, ",
    "mn36:27.2": "‘Why don’t I practice completely cutting off food?’ ",
    "mn36:27.3": "But deities came to me and said, ",
    "mn36:27.4": "‘Good sir, do not practice totally cutting off food. ",
    "mn36:27.5": "If you do, we will infuse divine nectar into your pores and you will live on that.’ ",
    "mn36:27.6": "Then I thought, ",
    "mn36:27.7": "‘If I claim to be completely fasting while these deities are infusing divine nectar in my pores, that would be a falsehood on my part.’ ",
    "mn36:27.8": "So I dismissed those deities, saying, ‘There is no need.’ ",
    "mn36:28.1": "Then it occurred to me, ",
    "mn36:28.2": "‘Why don’t I take only a small amount of food each time, a cup of broth made from mung beans, horse gram, chickpeas, or green gram.’ ",
    "mn36:28.3": "So that is what I did, ",
    "mn36:28.4": "until my body became extremely emaciated. ",
    "mn36:28.5": "Due to eating so little, my limbs became like the joints of an eighty-year-old or a corpse, ",
    "mn36:28.6": "my bottom became like a camel’s hoof, ",
    "mn36:28.7": "my vertebrae stuck out like beads on a string, ",
    "mn36:28.8": "and my ribs were as gaunt as the broken-down rafters on an old barn. ",
    "mn36:28.9": "Due to eating so little, the gleam of my eyes sank deep in their sockets, like the gleam of water sunk deep down a well. ",
    "mn36:28.10": "Due to eating so little, my scalp shriveled and withered like a green bitter-gourd in the wind and sun. ",
    "mn36:28.11": "Due to eating so little, the skin of my belly stuck to my backbone, so that when I tried to rub the skin of my belly I grabbed my backbone, and when I tried to rub my backbone I rubbed the skin of my belly. ",
    "mn36:28.12": "Due to eating so little, when I tried to urinate or defecate I fell face down right there. ",
    "mn36:28.13": "Due to eating so little, when I tried to relieve my body by rubbing my limbs with my hands, the hair, rotted at its roots, fell out. ",
    "mn36:29.1": "Then some people saw me and said: ‘The ascetic Gotama is black.’ ",
    "mn36:29.2": "Some said: ‘He is not black, he is brown.’ ",
    "mn36:29.3": "Some said: ‘He is neither black nor brown. The ascetic Gotama has tawny skin.’ ",
    "mn36:29.4": "That is how far the pure, bright complexion of my skin had been ruined by taking so little food. ",
    "mn36:30.1": "Then I thought, ",
    "mn36:30.2": "‘Whatever ascetics and brahmins have experienced violent, painful, sharp, severe, and acute feelings—whether in the past, future, or present—this is as far as it goes, no-one has done more than this. ",
    "mn36:30.3": "",
    "mn36:30.4": "",
    "mn36:30.5": "But I have not achieved any superhuman distinction in knowledge-and-vision worthy of the noble ones by this severe, grueling practice. ",
    "mn36:30.6": "Could there be another path to awakening?’ ",
    "mn36:31.1": "Then it occurred to me, ",
    "mn36:31.2": "‘I recall that while sitting in the cool shade of the rose-apple tree while my father the Sakyan was off working—having thoroughly withdrawn from sensuality, having withdrawn from unbeneficial phenomena, with thinking and with pondering, with joy and ease born of withdrawal—I abided having entered upon the first jhāna. ",
    "mn36:31.3": "Could that be the path to awakening?’ ",
    "mn36:31.4": "Stemming from that memory came the realization: ",
    "mn36:31.5": "‘That is the path to awakening!’ ",
    "mn36:32.1": "Then it occurred to me, ",
    "mn36:32.2": "‘Why am I afraid of that pleasure that is apart from sensuality and unbeneficial qualities?’ ",
    "mn36:32.3": "Then I thought, ",
    "mn36:32.4": "‘I am not afraid of that pleasure that is apart from sensuality and unbeneficial qualities.’ ",
    "mn36:33.1": "Then I thought, ",
    "mn36:33.2": "‘I cannot achieve that pleasure with a body so excessively emaciated. Why don’t I eat some solid food, some rice and porridge?’ ",
    "mn36:33.3": "So I ate some solid food. ",
    "mn36:33.4": "Now at that time the five bhikkhus were attending on me, thinking, ",
    "mn36:33.5": "‘The ascetic Gotama will tell us of the principle he realizes.’ ",
    "mn36:33.6": "But when I ate some solid food, they left disappointed in me, saying, ",
    "mn36:33.7": "‘The ascetic Gotama has become indulgent; he has strayed from the struggle and returned to indulgence.’ ",
    "mn36:34.1": "After eating solid food and gathering my strength, having thoroughly withdrawn from sensuality, having withdrawn from unbeneficial phenomena, with thinking and with pondering, with joy and ease born of withdrawal, I abided having entered upon the first jhāna. ",
    "mn36:34.2": "But even such arisen pleasant feeling did not endure with a grip on my mind. ",
    "mn36:35-37.1": "With the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and ease born of composure, I abided having entered upon the second jhāna. ",
    "mn36:35-37.2": "But even such arisen pleasant feeling did not endure with a grip on my mind. ",
    "mn36:35-37.3": "With the fading of joy, I abided equanimous, recollected and comprehending, experiencing ease with the body. I abided having entered upon the third jhāna, with regard to which the noble ones say “one abides equanimous, recollected, and at ease.” ",
    "mn36:35-37.4": "But even such arisen pleasant feeling did not endure with a grip on my mind. ",
    "mn36:35-37.5": "With the giving up of ease and unease—and with the ending of joys and upsets beforehand—without ease or unease, with purity of equanimity and recollectedness, I abided having entered upon the fourth jhāna. ",
    "mn36:35-37.6": "But even such arisen pleasant feeling did not endure with a grip on my mind. ",
    "mn36:38.1": "When my mind had become composed like this—purified, bright, flawless, free from, pliable, workable, steady, and imperturbable—I extended it towards the knowledge of recollecting of past lives. ",
    "mn36:38.2": "I recollected many kinds of past lives, with features and details. ",
    "mn36:39.1": "This was the first knowledge, which I achieved in the first watch of the night. ",
    "mn36:39.2": "Ignorance was destroyed and knowledge arose; darkness was destroyed and light arose, as happens for a meditator who is diligent, keen, and resolute. ",
    "mn36:39.3": "But even such arisen pleasant feeling did not endure with a grip on my mind. ",
    "mn36:40.1": "When my mind had become composed like this—purified, bright, flawless, free from, pliable, workable, steady, and imperturbable—I extended it towards the knowledge of the passing away and reappearance of beings. ",
    "mn36:40.2": "With the divine eye that is purified and superhuman, I saw beings passing away and reappearing, inferior and superior, beautiful and ugly, in a good place or a bad place. I understood how beings reappear according to their actions. ",
    "mn36:41.1": "This was the second knowledge, which I achieved in the middle watch of the night. ",
    "mn36:41.2": "Ignorance was destroyed and knowledge arose; darkness was destroyed and light arose, as happens for a meditator who is diligent, keen, and resolute. ",
    "mn36:41.3": "But even such arisen pleasant feeling did not endure with a grip on my mind. ",
    "mn36:42.1": "When my mind had become composed like this—purified, bright, flawless, free from, pliable, workable, steady, and imperturbable—I extended it towards the knowledge of the destruction of the influxes. ",
    "mn36:42.2": "I understood as it is: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering.' ",
    "mn36:42.3": "I understood as it is: ‘These are influxes’ … ‘This is the origin of influxes’ … ‘This is the cessation of influxes’ … ‘This is the practice that leads to the cessation of influxes.' ",
    "mn36:43.1": "Knowing and seeing like this, my mind was liberated from the influxes of sensuality, being, and ignorance. ",
    "mn36:43.2": "When it was liberated, I knew it was liberated. ",
    "mn36:43.3": "I understood: ‘Birth is destroyed, the renunciate life has been lived, what had to be done has been done, there will be no more of this.’” ",
    "mn36:44.1": "This was the third knowledge, which I achieved in the last watch of the night. ",
    "mn36:44.2": "Ignorance was destroyed and knowledge arose; darkness was destroyed and light arose, as happens for one who lives heedful, diligent, and resolute. ",
    "mn36:44.3": "But even such arisen pleasant feeling did not endure with a grip on my mind. ",
    "mn36:45.1": "Aggivessana, I recall teaching the Dhamma to an assembly of many hundreds, ",
    "mn36:45.2": "and each person thinks: ",
    "mn36:45.3": "‘The ascetic Gotama is teaching the Dhamma especially for me.’ ",
    "mn36:45.4": "But it should not be seen like this. ",
    "mn36:45.5": "The Realized One teaches the Dhamma to others only for the sake of conveying it. ",
    "mn36:45.6": "When that talk is finished, I establish, settle, unify, and compose my internally in the same theme of composure that I used before, with which I regularly abide.” ",
    "mn36:45.7": "“I would believe that of Master Gotama, just like a perfected one, a Rightly Self-Awakened One. ",
    "mn36:45.8": "But does Master Gotama ever recall sleeping during the day?” ",
    "mn36:46.1": "“I do recall that in the last month of the summer, I have spread out my outer robe folded in four and lain down in the lion’s posture—on the right side, placing one foot on top of the other—recollected and comprehending.” ",
    "mn36:46.2": "“Some ascetics and brahmins call that a muddled abiding.” ",
    "mn36:46.3": "“That is not how to define whether someone is muddled or not. ",
    "mn36:46.4": "But as to how to define whether someone is muddled or not, ",
    "mn36:46.5": "listen and apply your mind well, I will speak.” ",
    "mn36:46.6": "“Yes, sir,” replied Saccaka. ",
    "mn36:46.7": "The Auspicious One said this: ",
    "mn36:47.1": "“Anyone who has not given up the influxes that are defiling, involving repeated being, troublesome, resulting in suffering, leading to future birth, aging, and death—him I call muddled. ",
    "mn36:47.2": "For it is due to not giving up the influxes that one is muddled. ",
    "mn36:47.3": "Anyone who has given up the influxes that are defiling, involving repeated being, troublesome, resulting in suffering, leading to future birth, aging, and death—him I call not muddled. ",
    "mn36:47.4": "For it is due to giving up the influxes that one is not muddled. ",
    "mn36:47.5": "“For the Realized One, the influxes that are defiling, involving repeated being, troublesome, resulting in suffering and leading to future birth, aging, and death are given up, cut off at the root, made like a palm stump, obliterated, and unable to arise in the future. ",
    "mn36:47.6": "Just as a palm tree with its crown cut off is incapable of further growth, ",
    "mn36:47.7": "in the same way, for the Realized One, the influxes that are defiling, involving repeated being, troublesome, resulting in suffering and leading to future birth, aging, and death are given up, cut off at the root, made like a palm stump, obliterated, and unable to arise in the future. ",
    "mn36:48.1": "When he had spoken, Saccaka said to him, ",
    "mn36:48.2": "“It is remarkable, Master Gotama, it is extraordinary! ",
    "mn36:48.3": "How when Master Gotama is repeatedly attacked with inappropriate and intrusive criticism, the complexion of his skin brightens and the color of his face becomes clear, just like a perfected one, a Rightly Self-Awakened One! ",
    "mn36:48.4": "I recall taking on Pūraṇa Kassapa in debate. ",
    "mn36:48.5": "He dodged the issue, distracting the discussion with irrelevant points, and displaying annoyance, hate, and bitterness. ",
    "mn36:48.6": "But when Master Gotama is repeatedly attacked with inappropriate and intrusive criticism, the complexion of his skin brightens and the color of his face becomes clear, just like a perfected one, a Rightly Self-Awakened One. ",
    "mn36:48.7": "I recall taking on the bamboo-staffed ascetic Gosāla, ",
    "mn36:48.8": "Ajita of the hair blanket, ",
    "mn36:48.9": "Pakudha Kaccāyana, ",
    "mn36:48.10": "Sañjaya Belaṭṭhiputta, ",
    "mn36:48.11": "and the Jain Nāṭaputta in debate. ",
    "mn36:48.12": "They all dodged the issue, distracting the discussion with irrelevant points, and displaying annoyance, ill will, and bitterness. ",
    "mn36:48.13": "But when Master Gotama is repeatedly attacked with inappropriate and intrusive criticism, the complexion of his skin brightens and the color of his face becomes clear, just like a perfected one, a Rightly Self-Awakened One. ",
    "mn36:48.14": "Well, now, Master Gotama, I must go. ",
    "mn36:48.15": "I have many duties, and much to do.” ",
    "mn36:48.16": "“Aggivessana, go at your convenience.” ",
    "mn36:48.17": "Then Saccaka, the son of Jain parents, having delighted in and expressed appreciation for what the Auspicious One said, got up from his seat and left. "
}
