{
  "mn38:0.1": "Middle Discourses 38 ",
  "mn38:0.2": "The Longer Discourse on the Exhaustion of Craving ",
  "mn38:1.1": "So I have heard. ",
  "mn38:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
  "mn38:2.1": "Now at that time a bhikkhu called Sāti, the fisherman’s son, had the following pernicious view: ",
  "mn38:2.2": "“As I understand the Buddha’s teaching, it is this very same consciousness that roams and transmigrates, not another.” ",
  "mn38:3.1": "Several bhikkhus heard about this. ",
  "mn38:3.2": "",
  "mn38:3.3": "",
  "mn38:3.4": "They went up to Sāti and said to him, ",
  "mn38:3.5": "“Is it really true, Friend Sāti, that you have such a pernicious view: ",
  "mn38:3.6": "‘As I understand the Buddha’s teaching, it is this very same consciousness that roams and transmigrates, not another’?” ",
  "mn38:3.7": "“Absolutely, friends. As I understand the Buddha’s teaching, it is this very same consciousness that roams and transmigrates, not another.” ",
  "mn38:3.8": "Then, wishing to dissuade Sāti from his view, the bhikkhus pursued, pressed, and grilled him, ",
  "mn38:3.9": "“Don’t say that, Sāti! Don’t misrepresent the Buddha, for misrepresentation of the Buddha is not good. And the Buddha would not say that. ",
  "mn38:3.10": "In many ways the Buddha has said that consciousness is dependently arisen, since without a support, consciousness cannot exist.” ",
  "mn38:3.11": "But even though the bhikkhus pressed him in this way, Sāti obstinately stuck to his pernicious view and insisted on it. ",
  "mn38:3.12": "",
  "mn38:4.1": "When they weren’t able to dissuade Sāti from his view, the bhikkhus went to the Buddha, bowed, sat down to one side, and told him what had happened. ",
  "mn38:4.2": "",
  "mn38:4.3": "",
  "mn38:4.4": "",
  "mn38:4.5": "",
  "mn38:4.6": "",
  "mn38:4.7": "",
  "mn38:4.8": "",
  "mn38:4.9": "",
  "mn38:4.10": "",
  "mn38:4.11": "",
  "mn38:4.12": "",
  "mn38:4.13": "",
  "mn38:4.14": "",
  "mn38:4.15": "",
  "mn38:4.16": "",
  "mn38:5.1": "So the Buddha addressed one of the monks, ",
  "mn38:5.2": "“Please, bhikkhu, in my name tell the bhikkhu Sāti that ",
  "mn38:5.3": "the teacher summons him.” ",
  "mn38:5.4": "“Yes, Bhante,” that monk replied. He went to Sāti and said to him, ",
  "mn38:5.5": "“Friend Sāti, the teacher summons you.” ",
  "mn38:5.6": "“Yes, friend,” Sāti replied. He went to the Buddha, bowed, and sat down to one side. The Buddha said to him, ",
  "mn38:5.7": "“Is it really true, Sāti, that you have such a pernicious view: ",
  "mn38:5.8": "‘As I understand the Buddha’s teaching, it is this very same consciousness that roams and transmigrates, not another’?” ",
  "mn38:5.9": "“Absolutely, Bhante. As I understand the Buddha’s teaching, it is this very same consciousness that roams and transmigrates, not another.” ",
  "mn38:5.10": "“Sāti, what is that consciousness?” ",
  "mn38:5.11": "“Bhante, he is the speaker, the knower who experiences the results of good and bad deeds in all the different realms.” ",
  "mn38:5.12": "“Inept man, who on earth have you ever known me to teach in that way? ",
  "mn38:5.13": "Haven’t I said in many ways that consciousness is dependently arisen, since without a support, consciousness cannot exist? ",
  "mn38:5.14": "But still you misrepresent me by your wrong grasp, harm yourself, and create much wickedness. ",
  "mn38:5.15": "This will be for your lasting harm and suffering.” ",
  "mn38:6.1": "Then the Buddha said to the bhikkhus, ",
  "mn38:6.2": "“What do you think, bhikkhus? ",
  "mn38:6.3": "Is this bhikkhu Sāti even warmed up in this teaching and training?” ",
  "mn38:6.4": "“How could that be, Bhante? ",
  "mn38:6.5": "No, Bhante.” ",
  "mn38:6.6": "When this was said, Sāti sat silent, dismayed, shoulders drooping, downcast, depressed, with nothing to say. ",
  "mn38:6.7": "Knowing this, the Buddha said, ",
  "mn38:6.8": "“Inept man, you will be known by your own pernicious view. ",
  "mn38:6.9": "I’ll question the bhikkhus about this.” ",
  "mn38:7.1": "Then the Buddha said to the bhikkhus, ",
  "mn38:7.2": "“Bhikkhus, do you understand my teaching as Sāti does, when he misrepresents me by his wrong grasp, harms himself, and creates much wickedness?” ",
  "mn38:7.3": "“No, Bhante. ",
  "mn38:7.4": "For in many ways the Buddha has told us that consciousness is dependently arisen, since without a support, consciousness cannot exist.” ",
  "mn38:7.5": "“Good, good, bhikkhus! ",
  "mn38:7.6": "It’s good that you understand my teaching like this. ",
  "mn38:7.7": "For in many ways I have told you that consciousness is dependently arisen, since without a support, consciousness cannot exist. ",
  "mn38:7.8": "But still this Sāti misrepresents me by his wrong grasp, harms himself, and creates much wickedness. ",
  "mn38:7.9": "This will be for his lasting harm and suffering. ",
  "mn38:8.1": "Consciousness is reckoned according to the very same support dependent upon which it arises. ",
  "mn38:8.2": "Consciousness that arises dependent on the eye and sights is reckoned as eye-consciousness. ",
  "mn38:8.3": "Consciousness that arises dependent on the ear and sounds is reckoned as ear-consciousness. ",
  "mn38:8.4": "Consciousness that arises dependent on the nose and smells is reckoned as nose-consciousness. ",
  "mn38:8.5": "Consciousness that arises dependent on the tongue and tastes is reckoned as tongue consciousness. ",
  "mn38:8.6": "Consciousness that arises dependent on the body and touches is reckoned as body-consciousness. ",
  "mn38:8.7": "Consciousness that arises dependent on the mind-sense and phenomena is reckoned as mind-sense-consciousness. ",
  "mn38:8.8": "It’s like fire, which is reckoned according to the very same support dependent upon which it burns. ",
  "mn38:8.9": "A fire that burns dependent on logs is reckoned as a log fire. ",
  "mn38:8.10": "A fire that burns dependent on twigs is reckoned as a twig fire. ",
  "mn38:8.11": "A fire that burns dependent on grass is reckoned as a grass fire. ",
  "mn38:8.12": "A fire that burns dependent on cow-dung is reckoned as a cow-dung fire. ",
  "mn38:8.13": "A fire that burns dependent on husks is reckoned as a husk fire. ",
  "mn38:8.14": "A fire that burns dependent on rubbish is reckoned as a rubbish fire. ",
  "mn38:8.15": "In the same way, consciousness is reckoned according to the very same support dependent upon which it arises. … ",
  "mn38:8.16": "",
  "mn38:8.17": "",
  "mn38:8.18": "",
  "mn38:8.19": "",
  "mn38:8.20": "",
  "mn38:8.21": "",
  "mn38:9.1": "Bhikkhus, do you see ‘this is’?” ",
  "mn38:9.2": "“Yes, Bhante.” ",
  "mn38:9.3": "“Do you see that it exists with that as nutriment?” ",
  "mn38:9.4": "“Yes, Bhante.” ",
  "mn38:9.5": "“Do you see that when that nutriment ceases, that which exists is of the nature to cease?” ",
  "mn38:9.6": "“Yes, Bhante.” ",
  "mn38:10.1": "“Does doubt arise when you’re uncertain whether or not ‘this is’?” ",
  "mn38:10.2": "“Yes, Bhante.” ",
  "mn38:10.3": "“Does doubt arise when you’re uncertain whether or not it exists with that as nutriment?” ",
  "mn38:10.4": "“Yes, Bhante.” ",
  "mn38:10.5": "“Does doubt arise when you’re uncertain whether or not when that nutriment ceases, that which is exists is of the nature to cease?” ",
  "mn38:10.6": "“Yes, Bhante.” ",
  "mn38:11.1": "“Is doubt given up in someone who sees as it is with right understanding that ‘this is’?” ",
  "mn38:11.2": "“Yes, Bhante.” ",
  "mn38:11.3": "“Is doubt given up in someone who sees as it is with right understanding that it exists with that as nutriment?” ",
  "mn38:11.4": "“Yes, Bhante.” ",
  "mn38:11.5": "“Is doubt given up in someone who sees as it is with right understanding that when that nutriment ceases, that which exists is of the nature to cease?” ",
  "mn38:11.6": "“Yes, Bhante.” ",
  "mn38:12.1": "“Are you free of doubt as to whether ‘this is’?” ",
  "mn38:12.2": "“Yes, Bhante.” ",
  "mn38:12.3": "“Are you free of doubt as to whether it exists with that as nutriment?” ",
  "mn38:12.4": "“Yes, Bhante.” ",
  "mn38:12.5": "“Are you free of doubt as to whether when that nutriment ceases, that which exists is of the nature to cease?” ",
  "mn38:12.6": "“Yes, Bhante.” ",
  "mn38:13.1": "“Have you seen clearly as it is with right understanding that ‘this is’?” ",
  "mn38:13.2": "“Yes, Bhante.” ",
  "mn38:13.3": "“Have you seen clearly as it is with right understanding that it exists with that as nutriment?” ",
  "mn38:13.4": "“Yes, Bhante.” ",
  "mn38:13.5": "“Have you seen clearly as it is with right understanding that when that nutriment ceases, that which exists is of the nature to cease?” ",
  "mn38:13.6": "“Yes, Bhante.” ",
  "mn38:14.1": "“Pure and bright as this view is, bhikkhus, if you cherish it, fancy it, treasure it, and treat it as ‘mine’, would you be understanding my simile of the teaching as a raft: for crossing over, not for holding on?” ",
  "mn38:14.2": "“No, Bhante.” ",
  "mn38:14.3": "“Pure and bright as this view is, bhikkhus, if you don’t cherish it, fancy it, treasure it, and treat it ‘mine’, would you be understanding my simile of the teaching as a raft: for crossing over, not for holding on?” ",
  "mn38:14.4": "“Yes, Bhante.” ",
  "mn38:15.1": "“Bhikkhus, there are these four nutriments. They maintain beings that already exist and provide a hold to those seeking existence. ",
  "mn38:15.2": "What four? ",
  "mn38:15.3": "Edible food, whether coarse or fine; pressure is the second, mental intention the third, and consciousness the fourth. ",
  "mn38:16.1": "Now, bhikkhus, what is the foundation, origin, birthplace, and source of these four nutriments? ",
  "mn38:16.2": "Craving. ",
  "mn38:16.3": "And what is the foundation, origin, birthplace, and source of craving? ",
  "mn38:16.4": "Feeling. ",
  "mn38:16.5": "And what is the foundation ... of feeling? ",
  "mn38:16.6": "Pressure. ",
  "mn38:16.7": "And what is the foundation ... of pressure? ",
  "mn38:16.8": "The six sense fields. ",
  "mn38:16.9": "And what is the foundation ... of the six sense fields? ",
  "mn38:16.10": "Name-and-form. ",
  "mn38:16.11": "And what is the foundation ... of name-and-form? ",
  "mn38:16.12": "Consciousness. ",
  "mn38:16.13": "And what is the foundation ... of consciousness? ",
  "mn38:16.14": "Activities. ",
  "mn38:16.15": "And what is the foundation, origin, birthplace, and source of activities? ",
  "mn38:16.16": "Ignorance. ",
  "mn38:17.1": "So, bhikkhus, with ignorance as support, activities. ",
  "mn38:17.2": "With activities as support, consciousness. ",
  "mn38:17.3": "With consciousness as support, name-and-form. ",
  "mn38:17.4": "With name-and-form as support, the six sense fields. ",
  "mn38:17.5": "With the six sense fields as support, pressure. ",
  "mn38:17.6": "With pressure as support, feeling. ",
  "mn38:17.7": "With feeling as support, craving. ",
  "mn38:17.8": "With craving as support, assumption. ",
  "mn38:17.9": "With assumption as support, being. ",
  "mn38:17.10": "With being as support, birth. ",
  "mn38:17.11": "With birth as support, aging and death, sorrow, lamentation, displeasure, sadness, and distress exist. ",
  "mn38:17.12": "That is how this entire mass of suffering originates. ",
  "mn38:18.1": "‘With birth as support, aging and death.’ That’s what I said. ",
  "mn38:18.2": "Is that how you see this or not?” ",
  "mn38:18.3": "",
  "mn38:18.4": "“That’s how we see it.” ",
  "mn38:18.5": "",
  "mn38:18.6": "“‘With being as support, birth.’ … ",
  "mn38:18.7": "",
  "mn38:18.8": "",
  "mn38:18.9": "",
  "mn38:18.10": "",
  "mn38:18.11": "",
  "mn38:18.12": "",
  "mn38:18.13": "",
  "mn38:18.14": "",
  "mn38:18.15": "",
  "mn38:18.16": "",
  "mn38:18.17": "",
  "mn38:18.18": "",
  "mn38:18.19": "",
  "mn38:18.20": "",
  "mn38:18.21": "",
  "mn38:18.22": "",
  "mn38:18.23": "",
  "mn38:18.24": "",
  "mn38:18.25": "",
  "mn38:18.26": "",
  "mn38:18.27": "",
  "mn38:18.28": "",
  "mn38:18.29": "",
  "mn38:18.30": "",
  "mn38:18.31": "",
  "mn38:18.32": "",
  "mn38:18.33": "",
  "mn38:18.34": "",
  "mn38:18.35": "",
  "mn38:18.36": "",
  "mn38:18.37": "",
  "mn38:18.38": "",
  "mn38:18.39": "",
  "mn38:18.40": "",
  "mn38:18.41": "",
  "mn38:18.42": "",
  "mn38:18.43": "",
  "mn38:18.44": "",
  "mn38:18.45": "",
  "mn38:18.46": "",
  "mn38:18.47": "",
  "mn38:18.48": "",
  "mn38:18.49": "",
  "mn38:18.50": "‘With ignorance as support, activities.’ That’s what I said. ",
  "mn38:18.51": "Is that how you see this or not?” ",
  "mn38:18.52": "",
  "mn38:18.53": "“That’s how we see it.” ",
  "mn38:18.54": "",
  "mn38:19.1": "“Good, bhikkhus! ",
  "mn38:19.2": "So both you and I say this. ",
  "mn38:19.3": "With this, this is; when this arises, that arises. That is: ",
  "mn38:19.4": "With ignorance as support, activities. ",
  "mn38:19.5": "With activities as support, consciousness. ",
  "mn38:19.6": "With consciousness as support, name-and-form. ",
  "mn38:19.7": "With name-and-form as support, the six sense fields. ",
  "mn38:19.8": "With the six sense fields as support, pressure. ",
  "mn38:19.9": "With pressure as support, feeling. ",
  "mn38:19.10": "With feeling as support, craving. ",
  "mn38:19.11": "With craving as support, assumption. ",
  "mn38:19.12": "With assumption as support, being. ",
  "mn38:19.13": "With being as support, birth. ",
  "mn38:19.14": "With birth as support, aging and death, sorrow, lamentation, displeasure, sadness, and distress exist. ",
  "mn38:19.15": "That is how this entire mass of suffering originates. ",
  "mn38:20.1": "With the remainderless fading away and cessation of ignorance, cessation of activities. ",
  "mn38:20.2": "With cessation of activities, cessation of consciousness. ",
  "mn38:20.3": "With cessation of consciousness, cessation of name-and-form. ",
  "mn38:20.4": "With cessation of name-and-form, cessation of the six sense fields. ",
  "mn38:20.5": "With cessation of the six sense fields, cessation of pressure. ",
  "mn38:20.6": "With cessation of pressure, cessation of feeling. ",
  "mn38:20.7": "With cessation of feeling, cessation of craving. ",
  "mn38:20.8": "With cessation of craving, cessation of assumption. ",
  "mn38:20.9": "With cessation of assumption, cessation of being. ",
  "mn38:20.10": "With cessation of being, cessation of birth. ",
  "mn38:20.11": "With cessation of birth, cessation of aging and death, sorrow, lamentation, displeasure, sadness, and distress. ",
  "mn38:20.12": "That is how this entire mass of suffering ceases. ",
  "mn38:21.1": "‘With cessation of birth, cessation of aging and death.’ That’s what I said. ",
  "mn38:21.2": "Is that how you see this or not?” ",
  "mn38:21.3": "",
  "mn38:21.4": "“That’s how we see it.” ",
  "mn38:21.5": "",
  "mn38:21.6": "‘With cessation of being, cessation of birth.’ … ",
  "mn38:21.7": "",
  "mn38:21.8": "",
  "mn38:21.9": "",
  "mn38:21.10": "",
  "mn38:21.11": "",
  "mn38:21.12": "",
  "mn38:21.13": "",
  "mn38:21.14": "",
  "mn38:21.15": "",
  "mn38:21.16": "",
  "mn38:21.17": "",
  "mn38:21.18": "",
  "mn38:21.19": "",
  "mn38:21.20": "",
  "mn38:21.21": "",
  "mn38:21.22": "",
  "mn38:21.23": "",
  "mn38:21.24": "",
  "mn38:21.25": "",
  "mn38:21.26": "",
  "mn38:21.27": "",
  "mn38:21.28": "",
  "mn38:21.29": "",
  "mn38:21.30": "",
  "mn38:21.31": "",
  "mn38:21.32": "",
  "mn38:21.33": "",
  "mn38:21.34": "",
  "mn38:21.35": "",
  "mn38:21.36": "",
  "mn38:21.37": "",
  "mn38:21.38": "",
  "mn38:21.39": "",
  "mn38:21.40": "",
  "mn38:21.41": "",
  "mn38:21.42": "",
  "mn38:21.43": "",
  "mn38:21.44": "",
  "mn38:21.45": "",
  "mn38:21.46": "",
  "mn38:21.47": "",
  "mn38:21.48": "",
  "mn38:21.49": "",
  "mn38:21.50": "",
  "mn38:21.51": "‘With cessation of ignorance, cessation of activities.’ That’s what I said. ",
  "mn38:21.52": "Is that how you see this or not?” ",
  "mn38:21.53": "",
  "mn38:21.54": "“That’s how we see it.” ",
  "mn38:21.55": "",
  "mn38:22.1": "“Good, bhikkhus! ",
  "mn38:22.2": "So both you and I say this. ",
  "mn38:22.3": "Without this, this is not; when this ceases, this ceases. That is: ",
  "mn38:22.4": "With cessation of ignorance, cessation of activities. ",
  "mn38:22.5": "With cessation of activities, cessation of consciousness. ",
  "mn38:22.6": "With cessation of consciousness, cessation of name-and-form. ",
  "mn38:22.7": "With cessation of name-and-form, cessation of the six sense fields. ",
  "mn38:22.8": "With cessation of the six sense fields, cessation of pressure. ",
  "mn38:22.9": "With cessation of pressure, cessation of feeling. ",
  "mn38:22.10": "With cessation of feeling, cessation of craving. ",
  "mn38:22.11": "With cessation of craving, cessation of assumption. ",
  "mn38:22.12": "With cessation of assumption, cessation of being. ",
  "mn38:22.13": "With cessation of being, cessation of birth. ",
  "mn38:22.14": "With cessation of birth, cessation of aging and death, sorrow, lamentation, displeasure, sadness, and distress. ",
  "mn38:22.15": "That is how this entire mass of suffering ceases. ",
  "mn38:23.1": "Knowing and seeing in this way, bhikkhus, would you turn back to the past, thinking, ",
  "mn38:23.2": "‘Did we exist in the past? Did we not exist in the past? What were we in the past? How were we in the past? After being what, what did we become in the past?’?” ",
  "mn38:23.3": "“No, Bhante.” ",
  "mn38:23.4": "“Knowing and seeing in this way, bhikkhus, would you turn forward to the future, thinking, ",
  "mn38:23.5": "‘Will we exist in the future? Will we not exist in the future? What will we be in the future? How will we be in the future? After being what, what will we become in the future?’?” ",
  "mn38:23.6": "“No, Bhante.” ",
  "mn38:24.1": "“Knowing and seeing in this way, bhikkhus, would you be undecided about the present, thinking, ",
  "mn38:24.2": "‘Am I? Am I not? What am I? How am I? This sentient being—where did it come from? And where will it go?’?” ",
  "mn38:24.3": "“No, Bhante.” ",
  "mn38:24.4": "“Knowing and seeing in this way, would you say, ",
  "mn38:24.5": "‘We respect our teacher, and we speak like this out of respect for our teacher’?” ",
  "mn38:24.6": "“No, Bhante.” ",
  "mn38:24.7": "“Knowing and seeing in this way, would you say, ",
  "mn38:24.8": "‘This ascetic says this. We speak like this because it is what he says’?” ",
  "mn38:24.9": "“No, Bhante.” ",
  "mn38:24.10": "“Knowing and seeing in this way, would you dedicate yourself to another teacher?” ",
  "mn38:24.11": "“No, Bhante.” ",
  "mn38:24.12": "“Knowing and seeing in this way, would you regard the observances and boisterous, superstitious rites of the various ascetics and brahmins as valuable?” ",
  "mn38:24.13": "“No, Bhante.” ",
  "mn38:24.14": "“Aren’t you speaking only of what you have known and seen and realized for yourselves?” ",
  "mn38:24.15": "“Yes, Bhante.” ",
  "mn38:25.1": "“Good, bhikkhus! You have been guided by me with this Dhamma that’s presently visible, timeless, verifiable, and ushering, to be experienced for themselves by the wise. ",
  "mn38:25.2": "For when I said that this Dhamma is presently visible, timeless, verifiable, and ushering, to be experienced for themselves by the wise, ",
  "mn38:25.3": "this is what I was referring to. ",
  "mn38:26.1": "Bhikkhus, when three things come together an embryo is conceived. ",
  "mn38:26.2": "In a case where the mother and father come together, but the mother is not in the fertile phase of her menstrual cycle, and the incoming being is not ready, the embryo is not conceived. ",
  "mn38:26.3": "In a case where the mother and father come together, the mother is in the fertile phase of her menstrual cycle, but the incoming being is not ready, the embryo is not conceived. ",
  "mn38:26.4": "But when these three things come together—the mother and father come together, the mother is in the fertile phase of her menstrual cycle, and the incoming being is ready—an embryo is conceived. ",
  "mn38:27.1": "The mother nurtures the embryo in her womb for nine or ten months with great anxiety, as a heavy burden. ",
  "mn38:27.2": "When nine or ten months have passed, the mother gives birth with great anxiety, as a heavy burden. ",
  "mn38:27.3": "When the infant is born she nourishes it with her own blood. ",
  "mn38:27.4": "For mother’s milk is regarded as blood in the training of the Noble One. ",
  "mn38:28.1": "That boy grows up and his faculties mature. ",
  "mn38:28.2": "He plays childish games such as toy plows, tipcat, somersaults, pinwheels, toy measures, toy carts, and toy bows. ",
  "mn38:29.1": "That boy grows up and his faculties mature further. ",
  "mn38:29.2": "He amuses himself, supplied and provided with the five strands of sensuality. ",
  "mn38:29.3": "Sights cognizable by the eye that are likable, desirable, agreeable, pleasing, connected with sensuality, and enticing. ",
  "mn38:29.4": "Sounds cognizable by the ear … ",
  "mn38:29.5": "Smells cognizable by the nose … ",
  "mn38:29.6": "Tastes cognizable by the tongue … ",
  "mn38:29.7": "Touches cognizable by the body that are likable, desirable, agreeable, pleasing, connected with sensuality, and enticing. ",
  "mn38:30.1": "When he sees a sight with the eye, if it’s agreeable he harbors passion for it, if it’s disagreeable he’s averse to it. He lives with recollection of the body unestablished and with a limited mind. ",
  "mn38:30.2": "And he doesn’t  understand as it is the liberation by mind and liberation by understanding where those bad, detrimental qualities cease without remainder. ",
  "mn38:30.3": "Engaged in this way in favoring and opposing, when he experiences any kind of feeling—pleasant, unpleasant, or neutral—he delights in it, welcomes it, and is fixated on it. ",
  "mn38:30.4": "This gives rise to delight. ",
  "mn38:30.5": "That delight in feelings is assumption. With this assumption of his as support, being. With being as support, birth. With birth as support, aging and death, sorrow, lamentation, displeasure, sadness, and distress exist. ",
  "mn38:30.6": "That is how this entire mass of suffering originates. ",
  "mn38:30.7": "When he hears a sound with the ear … ",
  "mn38:30.8": "When he smells an odor with the nose … ",
  "mn38:30.9": "When he tastes a flavor with the tongue … ",
  "mn38:30.10": "When he touches a touch with the body … ",
  "mn38:30.11": "When he cognizes a phenomenon with the mind-sense, if it’s agreeable he harbors passion for it, if it’s disagreeable he’s averse to it. He lives with recollection of the body unestablished and with a limited mind. ",
  "mn38:30.12": "And he doesn’t understand as it is the liberation by mind and liberation by understanding where those bad, detrimental qualities cease without remainder. ",
  "mn38:30.13": "Engaged in this way in favoring and opposing, when he experiences any kind of feeling—pleasant, unpleasant, or neutral—he delights in it, welcomes it, and is fixed on it. ",
  "mn38:30.14": "This gives rise to delight. ",
  "mn38:30.15": "That delight in feelings is assumption. With this assumption of his as support, being. With being as support, birth. With birth as support, aging and death, sorrow, lamentation, displeasure, sadness, and distress exist. ",
  "mn38:30.16": "That is how this entire mass of suffering originates. ",
  "mn38:31.1": "But when a Realized One arises in the world—an Arahant, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed—",
  "mn38:31.2": "he makes known this world to others—with its gods, Māras and Brahmās, this population with its ascetics and brahmins, gods and humans—having for himself comprehended and realized it. ",
  "mn38:31.3": "He teaches a Dhamma that is good in the beginning, good in the middle, and good in the end, meaningful and well-phrased. ",
  "mn38:31.4": "And he reveals a renunciate life that’s entirely complete and pure. ",
  "mn38:32.1": "A householder hears that teaching, or a householder’s child, or someone born in a good family. ",
  "mn38:32.2": "He gains faith in the Realized One ",
  "mn38:32.3": "and reflects, ",
  "mn38:32.4": "‘Household life is confined and dusty, but the life of one gone forth is wide open. ",
  "mn38:32.5": "It’s not easy for someone living at home to lead the renunciate life utterly complete and pure, like a polished shell. ",
  "mn38:32.6": "Why don’t I shave off my hair and beard, dress in ocher robes, and go forth from lay life to homelessness?’ ",
  "mn38:32.7": "After some time he gives up a large or small fortune, and a large or small family circle. He shaves off hair and beard, dresses in ocher robes, and goes forth from the lay life to homelessness. ",
  "mn38:33.1": "Once he’s gone forth, he takes up the training and livelihood of the bhikkhus. He abstains from killing living creatures, renouncing the rod and the sword. He’s scrupulous and kind, living compassionate for the welfare of all creatures and beings. ",
  "mn38:33.2": "He abstains from stealing. He takes only what’s given, and expects only what’s given. He keeps himself clean by not thieving. ",
  "mn38:33.3": "He abstains from incelibacy. He is celibate, set apart, avoiding the vulgar act of sex. ",
  "mn38:33.4": "He abstains from lying. He speaks the truth and sticks to the truth. He’s honest and trustworthy, and doesn’t trick the world with his words. ",
  "mn38:33.5": "He abstains from divisive speech. He doesn’t repeat in one place what he heard in another to divide people against each other. Instead, he reconciles those who are divided, supporting unity, delighting in harmony, enjoying harmony, and speaking words that promote harmony. ",
  "mn38:33.6": "He abstains from harsh speech. He speaks in a way that’s gentle, pleasing to the ear, affectionate, going to the heart, polite, likable, and agreeable to the people. ",
  "mn38:33.7": "He abstains from frivolous speech. His words are timely, true, and meaningful, in line with the teaching and training. He says things at the right time which are valuable, reasonable, succinct, and beneficial. ",
  "mn38:33.8": "He abstains from violence towards plants and seeds. ",
  "mn38:33.9": "He eats in one part of the day, abstaining from eating at night and at the wrong time. ",
  "mn38:33.10": "He abstains from dancing, singing, music, and watching shows. ",
  "mn38:33.11": "He abstains from beautifying and adorning himself with garlands, perfumes, and makeup. ",
  "mn38:33.12": "He abstains from high and luxurious beds. ",
  "mn38:33.13": "He abstains from receiving gold and money, ",
  "mn38:33.14": "raw grains, ",
  "mn38:33.15": "raw meat, ",
  "mn38:33.16": "women and girls, ",
  "mn38:33.17": "male and female bondservants, ",
  "mn38:33.18": "goats and sheep, ",
  "mn38:33.19": "chickens and pigs, ",
  "mn38:33.20": "elephants, cows, horses, and mares, ",
  "mn38:33.21": "and fields and land. ",
  "mn38:33.22": "He abstains from running errands and messages; ",
  "mn38:33.23": "buying and selling; ",
  "mn38:33.24": "falsifying weights, metals, or measures; ",
  "mn38:33.25": "bribery, fraud, cheating, and duplicity; ",
  "mn38:33.26": "mutilation, murder, abduction, banditry, plunder, and violence. ",
  "mn38:34.1": "He’s content with robes to look after the body and almsfood to look after the belly. Wherever he goes, he sets out taking only these things. ",
  "mn38:34.2": "He’s like a bird: wherever it flies, wings are its only burden. ",
  "mn38:34.3": "In the same way, a bhikkhu is content with robes to look after the body and almsfood to look after the belly. Wherever he goes, he sets out taking only these things. ",
  "mn38:34.4": "When he has this noble aggregate of virtue, he experiences a blameless ease internally. ",
  "mn38:35.1": "When he sees a sight with the eye, he doesn’t grasp at signs and features of it ",
  "mn38:35.2": "on account of which—due to abiding with the eye faculty unrestrained—bad, detrimental phenomena of longing and upset would flow in on him. He practices to restrain that; he guards the eye faculty and brings about the restraint of the eye faculty. ",
  "mn38:35.3": "When he hears a sound with the ear … ",
  "mn38:35.4": "When he smells an odor with the nose … ",
  "mn38:35.5": "When he tastes a flavor with the tongue … ",
  "mn38:35.6": "When he touches a touch with the body … ",
  "mn38:35.7": "When he cognizes a phenomenon with the mind-sense, he doesn’t grasp at signs and features of it ",
  "mn38:35.8": "on account of which—due to abiding with the mind-sense faculty unrestrained—bad, detrimental phenomena of longing and upset would flow in on him. He practices to restrain that; he guards the mind-sense faculty and brings about the restraint of the mind-sense faculty. ",
  "mn38:35.9": "When he has this noble sense restraint, he experiences an unsullied ease internally. ",
  "mn38:36.1": "He acts with comprehension when going out and coming back; when looking ahead and aside; when bending and extending the limbs; when bearing the outer robe, bowl and robes; when eating, drinking, chewing, and tasting; when urinating and defecating; when walking, standing, sitting, sleeping, waking, speaking, and keeping silent. ",
  "mn38:37.1": "When he has this noble aggregate of virtue, this noble contentment, this noble sense restraint, and this noble recollection and comprehension, ",
  "mn38:37.2": "he frequents a secluded lodging—a wilderness, the root of a tree, a hill, a ravine, a mountain cave, a charnel ground, a forest, the open air, a heap of straw. ",
  "mn38:38.1": "After the meal, he returns from almsround, sits down cross-legged, sets his body straight, and establishes recollection at the fore. ",
  "mn38:38.2": "Giving up longing with regard to the world, he abides with a mind rid of longing; he cleanses the mind of longing. ",
  "mn38:38.3": "Giving up aversion and hatred, he abides with a mind rid of aversion, compassionate for the welfare of all creatures and beings; he cleanses the mind of aversion and hatred. ",
  "mn38:38.4": "Giving up indolence and lethargy, he abides with a mind rid of indolence and lethargy, perceiving light, recollected, and comprehending; he cleanses the mind of indolence and lethargy. ",
  "mn38:38.5": "Giving up restlessness and anxiety, he abides without restlessness, his mind internally appeased; he cleanses the mind of restlessness and anxiety. ",
  "mn38:38.6": "Giving up doubt, he abides having gone beyond doubt, not uncertain about beneficial qualities; he cleanses the mind of doubt. ",
  "mn38:39.1": "He gives up these five hindrances, defilements of the mind that weaken understanding. ",
  "mn38:39.2": "Then, quite separated from sensuality, separated from detrimental phenomena, with thinking and with pondering, with joy and ease born of separation, he abides having entered upon the first jhāna. ",
  "mn38:39.3": "Furthermore, with the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and ease born of composure, a bhikkhu abides having entered upon second jhāna. ",
  "mn38:39.4": "third jhāna … ",
  "mn38:39.5": "fourth jhāna. ",
  "mn38:40.1": "When he sees a sight with the eye, if it’s agreeable he doesn’t harbor passion for it, if it’s disagreeable he’s not averse to it. He lives with recollection of the body established and with an immeasurable mind. ",
  "mn38:40.2": "And he understands as it is the liberation by mind and liberation by understanding where those bad, detrimental qualities cease without remainder. ",
  "mn38:40.3": "Having thus given up favoring and opposing, when he experiences any kind of feeling—pleasant, unpleasant, or neutral—he doesn’t delight in it, welcome it, and is not fixated on it. ",
  "mn38:40.4": "As a result, delight in feelings ceases. ",
  "mn38:40.5": "With cessation of his delight, cessation of assumption. With cessation of assumption, cessation of being. With cessation of being, cessation of birth. When cessation of birth, cessation of  aging and death, sorrow, lamentation, displeasure, sadness, and distress. ",
  "mn38:40.6": "That is how this entire mass of suffering ceases. ",
  "mn38:41.1": "When he hears a sound with the ears … ",
  "mn38:41.2": "When he smells an odor with the nose … ",
  "mn38:41.3": "When he tastes a flavor with the tongue … ",
  "mn38:41.4": "When he feels a touch with the body … ",
  "mn38:41.5": "When he cognizes a phenomenon with the mind-sense, if it’s agreeable he doesn’t harbor passion for it, if it’s disagreeable he’s not averse to it. He lives with recollection of the body established and with an immeasurable mind. ",
  "mn38:41.6": "And he understands as it is the liberation by mind and liberation by understanding where those bad, detrimental qualities cease without remainder. ",
  "mn38:41.7": "Having thus given up favoring and opposing, when he experiences any kind of feeling—pleasant, unpleasant, or neutral—he doesn’t delight in it, welcome it, and is not fixated on it. ",
  "mn38:41.8": "As a result, delight in feelings ceases. ",
  "mn38:41.9": "With cessation of his delight, cessation of assumption. With cessation of assumption, cessation of being. With cessation of being, cessation of birth. When cessation of birth, cessation of  aging and death, sorrow, lamentation, displeasure, sadness, and distress. ",
  "mn38:41.10": "That is how this entire mass of suffering ceases. ",
  "mn38:41.11": "Bhikkhus, you should memorize this brief statement on liberation through the exhaustion of craving. But the bhikkhu Sāti, the fisherman’s son, is caught in a vast net of craving, a tangle of craving.” ",
  "mn38:41.12": "That is what the Buddha said. ",
  "mn38:41.13": "Pleased, the bhikkhus delighted in what the Buddha said. "
}