{
  "mn39:0.1": "Middle Discourses 39 ",
  "mn39:0.2": "The Longer Discourse at Assapura ",
  "mn39:1.1": "So I have heard. ",
  "mn39:1.2": "At one time the Buddha was staying in the land of the Aṅgas, near the Aṅgan town named Assapura. ",
  "mn39:1.3": "There the Buddha addressed the bhikkhus, ",
  "mn39:1.4": "“Bhikkhus!” ",
  "mn39:1.5": "“Bhante,” they replied. ",
  "mn39:1.6": "The Buddha said this: ",
  "mn39:2.1": "“Bhikkhus, people label you as ascetics. ",
  "mn39:2.2": "And when they ask you what you are, you claim to be ascetics. ",
  "mn39:2.3": "Given this label and this claim, you should train like this: ‘We will undertake and follow the things that make one an ascetic and a brahmin. That way our label will be accurate and our claim correct. ",
  "mn39:2.4": "Any robes, almsfood, lodgings, and medicines and supplies for the sick that we use will be very fruitful and beneficial for the donor. And our going forth will not be wasted, but will be fruitful and fertile.’ ",
  "mn39:2.5": "",
  "mn39:3.1": "And what are the things that make one an ascetic and a brahmin? ",
  "mn39:3.2": "You should train like this: ‘We will have a sense of prudence and dread of wrongdoing.’ ",
  "mn39:3.3": "Now, bhikkhus, you might think, ",
  "mn39:3.4": "‘We have a sense of prudence and dread of wrongdoing. Just this much is enough. We have achieved the goal of life as an ascetic. There is nothing more to do.’ And you might rest content with just that much. ",
  "mn39:3.5": "I declare this to you, bhikkhus, I announce this to you: ",
  "mn39:3.6": "‘You who seek to be true ascetics, do not lose sight of the goal of the ascetic life while there is still more to do.’ ",
  "mn39:4.1": "What more is there to do? ",
  "mn39:4.2": "You should train like this: ‘Our bodily behavior will be pure, clear, open, neither inconsistent nor secretive. ",
  "mn39:4.3": "And we won’t exalt ourselves or put others down on account of our pure bodily behavior.’ ",
  "mn39:4.4": "Now, bhikkhus, you might think, ",
  "mn39:4.5": "‘We have a sense of prudence and dread of wrongdoing, and our bodily behavior is pure. ",
  "mn39:4.6": "Just this much is enough …’ ",
  "mn39:4.7": "I declare this to you, bhikkhus, I announce this to you: ",
  "mn39:4.8": "‘You who seek to be true ascetics, do not lose sight of the goal of the ascetic life while there is still more to do.’ ",
  "mn39:5.1": "What more is there to do? ",
  "mn39:5.2": "You should train like this: ‘Our verbal behavior … ",
  "mn39:5.3": "",
  "mn39:5.4": "",
  "mn39:5.5": "",
  "mn39:5.6": "",
  "mn39:5.7": "",
  "mn39:5.8": "",
  "mn39:6.1": "",
  "mn39:6.2": "mental behavior … ",
  "mn39:6.3": "",
  "mn39:6.4": "",
  "mn39:6.5": "",
  "mn39:6.6": "",
  "mn39:6.7": "",
  "mn39:6.8": "",
  "mn39:7.1": "",
  "mn39:7.2": "livelihood will be pure, clear, open, neither inconsistent nor secretive. ",
  "mn39:7.3": "And we won’t exalt ourselves or put others down on account of our pure livelihood.’ ",
  "mn39:7.4": "Now, bhikkhus, you might think, ",
  "mn39:7.5": "‘We have a sense of prudence and dread of wrongdoing, our bodily, verbal, and mental behavior is pure, and our livelihood is pure. ",
  "mn39:7.6": "Just this much is enough. We have achieved the goal of life as an ascetic. There is nothing more to do.’ And you might rest content with just that much. ",
  "mn39:7.7": "I declare this to you, bhikkhus, I announce this to you: ",
  "mn39:7.8": "‘You who seek to be true ascetics, do not lose sight of the goal of the ascetic life while there is still more to do.’ ",
  "mn39:8.1": "What more is there to do? ",
  "mn39:8.2": "You should train yourselves like this: ‘We will guard our sense doors. ",
  "mn39:8.3": "When we see a sight with the eye, we won’t grasp at signs and features of it ",
  "mn39:8.4": "on account of which—due to abiding with the eye faculty unrestrained—bad, detrimental phenomena of longing and upset would flow in on us. We will practice to restrain that; we will guard the eye faculty and bring about the restraint of the eye faculty. ",
  "mn39:8.5": "When we hear a sound with the ear … ",
  "mn39:8.6": "When we smell an odor with the nose … ",
  "mn39:8.7": "When we taste a flavor with the tongue … ",
  "mn39:8.8": "When we feel a touch with th body … ",
  "mn39:8.9": "When we cognize a phenomenon with the mental faculty, we won’t grasp at signs and features of it ",
  "mn39:8.10": "on account of which—due to abiding with the eye faculty unrestrained—bad, detrimental phenomena of longing and upset would flow in on us. We will practice to restrain that; we will guard the mental faculty and bring about the restraint of the mental faculty. ",
  "mn39:8.11": "Now, bhikkhus, you might think, ",
  "mn39:8.12": "‘We have a sense of prudence and dread of wrongdoing, our bodily, verbal, and mental behavior is pure, our livelihood is pure, and our sense doors are guarded. ",
  "mn39:8.13": "Just this much is enough …’ ",
  "mn39:8.14": "",
  "mn39:8.15": "",
  "mn39:9.1": "What more is there to do? ",
  "mn39:9.2": "You should train yourselves like this: ‘We will be moderate in eating. We will eat having reflected through-the-origin: ",
  "mn39:9.3": "‘Not for entertainment, indulgence, beautification, or adornment, but only to sustain this body, to avoid harm, and to support the renunciate life. In this way, we shall put an end to old feelings and not give rise to new ones, and we will live blamelessly and at ease.’ ",
  "mn39:9.4": "Now, bhikkhus, you might think, ",
  "mn39:9.5": "‘We have a sense of prudence and dread of wrongdoing, our bodily, verbal, and mental behavior is pure, our livelihood is pure, our sense doors are guarded, and we are moderate in eating. ",
  "mn39:9.6": "Just this much is enough …’ ",
  "mn39:9.7": "",
  "mn39:9.8": "",
  "mn39:10.1": "What more is there to do? ",
  "mn39:10.2": "You should train yourselves like this: ‘We will be dedicated to vigilance. During the day, we will cleanse the mind of obstructive states while walking or sitting. ",
  "mn39:10.3": "During the first watch of the night, we will cleanse the mind of obstructive states while walking or sitting. ",
  "mn39:10.4": "During the second watch of the night, we will lie down in the lion’s posture—on the right side, placing one foot on top of the other—recollected and aware, having set the intention to get up. ",
  "mn39:10.5": "Having gotten up in the last watch of the night, we will cleanse the mind of obstructive states while walking or sitting.’ ",
  "mn39:10.6": "Now, bhikkhus, you might think, ",
  "mn39:10.7": "‘We have conscience and , our bodily, verbal, and mental behavior is pure, our livelihood is pure, our sense doors are guarded, we are moderate in eating, and we are dedicated to vigilance. ",
  "mn39:10.8": "Just this much is enough …’ ",
  "mn39:10.9": "",
  "mn39:10.10": "",
  "mn39:11.1": "What more is there to do? ",
  "mn39:11.2": "You should train yourselves like this: ‘We will have recollection and awareness. We will act with awareness when going out and coming back; when looking ahead and aside; when bending and extending the limbs; when bearing the outer robe, bowl and robes; when eating, drinking, chewing, and tasting; when urinating and defecating; when walking, standing, sitting, sleeping, waking, speaking, and keeping silent.’ ",
  "mn39:11.3": "Now, bhikkhus, you might think, ",
  "mn39:11.4": "‘We have a sense of prudence and dread of wrongdoing, our bodily, verbal, and mental behavior is pure, our livelihood is pure, our sense doors are guarded, we don’t eat too much, we are dedicated to vigilance, and we have recollection and awareness. ",
  "mn39:11.5": "Just this much is enough …’ ",
  "mn39:11.6": "",
  "mn39:11.7": "",
  "mn39:12.1": "What more is there to do? ",
  "mn39:12.2": "Take a bhikkhu who frequents a secluded lodging—a wilderness, the root of a tree, a hill, a ravine, a mountain cave, a charnel ground, a forest, the open air, a heap of straw. ",
  "mn39:13.1": "After the meal, he returns from almsround, sits down cross-legged, sets his body straight, and establishes recollection at the fore. ",
  "mn39:13.2": "Giving up longing in regard to the world, he abides with a mind rid of longing; he cleanses the mind of longing. ",
  "mn39:13.3": "Giving up aversion and hatred, he abides with a mind rid of aversion, compassionate for the welfare of all creatures and beings; he cleanses the mind of aversion and hatred. ",
  "mn39:13.4": "Giving up indolence-and-lethargy, he abides with a mind rid of indolence-and-lethargy, perceiving light, recollected, and aware; he cleanses the mind of indolence-and-lethargy. ",
  "mn39:13.5": "Giving up restlessness-and-anxiety, he abides without restlessness, his mind internally appeased; he cleanses the mind of restlessness-and-anxiety. ",
  "mn39:13.6": "Giving up doubt, he abides having crossed over doubt, not uncertain about beneficial qualities; he cleanses the mind of doubt. ",
  "mn39:14.1": "Suppose a man who has gotten into debt were to apply himself to work, ",
  "mn39:14.2": "and his efforts proved successful. ",
  "mn39:14.3": "He would pay off the original loan and have enough left over to support his wife. ",
  "mn39:14.4": "Thinking about this, ",
  "mn39:14.5": "",
  "mn39:14.6": "",
  "mn39:14.7": "he’d be filled with joy and happiness. ",
  "mn39:14.8": "Suppose a man was sick, suffering, and gravely ill. He’d lose his appetite and get physically weak. ",
  "mn39:14.9": "But after some time they’d recover from that illness, and regain their appetite and their strength. ",
  "mn39:14.10": "Thinking about this, ",
  "mn39:14.11": "",
  "mn39:14.12": "they’d be filled with joy and happiness. ",
  "mn39:14.13": "Suppose a man was imprisoned in a jail. ",
  "mn39:14.14": "But after some time they were released from jail, safe and sound, with no loss of wealth. ",
  "mn39:14.15": "Thinking about this, ",
  "mn39:14.16": "",
  "mn39:14.17": "they’d be filled with joy and happiness. ",
  "mn39:14.18": "Suppose a man was a bondservant. He would not be his own master, but indentured to another, unable to go where he wishes. ",
  "mn39:14.19": "But after some time he’d be freed from servitude. He would be his own master, not indentured to another, an emancipated individual able to go where he wishes. ",
  "mn39:14.20": "Thinking about this, ",
  "mn39:14.21": "",
  "mn39:14.22": "they’d be filled with joy and happiness. ",
  "mn39:14.23": "Suppose there was a man with wealth and property who was traveling along a desert road. ",
  "mn39:14.24": "But after some time they crossed over the desert, safe and sound, with no loss of wealth. ",
  "mn39:14.25": "Thinking about this, ",
  "mn39:14.26": "",
  "mn39:14.27": "",
  "mn39:14.28": "they’d be filled with joy and happiness. ",
  "mn39:14.29": "In the same way, the bhikkhu regards these five hindrances that are not given up in him as a debt, a disease, a prison, slavery, and a desert crossing. ",
  "mn39:14.30": "But when these five hindrances are given up in him, the bhikkhu regards this as freedom from debt, good health, release from prison, emancipation, and a place of safety at last. ",
  "mn39:15.1": "He gives up these five hindrances, defilements of the mind that weaken understanding. ",
  "mn39:15.2": "Then, quite disjoined from sensuality, disjoined from detrimental phenomena, with thinking and with pondering, with joy and comfort born of separation, he abides having entered upon the first jhāna. ",
  "mn39:15.3": "He tops up, suffuses, fills, and pervades his body with the joy and comfort born of separation. There would be no part of his whole body that’s not pervaded with the joy and comfort born of separation. ",
  "mn39:15.4": "It’s like when a deft bathroom attendant or their apprentice pours bath powder into a bronze dish, sprinkling it little by little with water. They knead it until the ball of bath powder is soaked and saturated with moisture, spread through inside and out; yet no moisture oozes out. ",
  "mn39:15.5": "In the same way, the bhikkhu tops up, suffuses, fills, and pervades his body with the joy and comfort born of separation. There would be no part of his whole body that’s not pervaded with the joy and comfort born of separation. ",
  "mn39:16.1": "Furthermore, with the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and comfort born of composure, the bhikkhu abides having entered upon the second jhāna. ",
  "mn39:16.2": "He tops up, suffuses, fills, and pervades his body with the joy and comfort born of composure. There would be no part of his whole body that’s not pervaded with the joy and comfort born of composure. ",
  "mn39:16.3": "It’s like a deep lake fed by spring water where there would be no inlet to the east, west, north, or south, and no rainfall to replenish it from time to time. But the stream of cool water welling up in the lake would top up, suffuse, fill, and pervade the lake. There would be no part of the whole lake that’s not pervaded with cool water. ",
  "mn39:16.4": "In the same way, the bhikkhu tops up, suffuses, fills, and pervades his body with joy and comfort born of composure. There would be no part of his whole body that’s not pervaded with the joy and comfort born of composure. ",
  "mn39:17.1": "Furthermore, with the fading of joy, the bhikkhu abides equanimous, recollected, and aware, experiencing comfort with the body. He abides having entered upon the third jhāna, with regard to which the noble ones say “one abides equanimous, recollected, and comfortable.” ",
  "mn39:17.2": "He tops up, suffuses, fills, and pervades his body with the comfort devoid of joy. There would be no part of his whole body that’s not pervaded with the comfort devoid of joy. ",
  "mn39:17.3": "It’s like a pool with blue water lilies, or pink or white lotuses. Some of them sprout and grow in the water without rising above it, thriving underwater. From the tip to the root they’re topped up, suffused, filled, and pervaded with cool water. There would be no part of them that’s not pervaded with cool water. ",
  "mn39:17.4": "In the same way, the bhikkhu tops up, suffuses, fills, and pervades his whole body with the comfort devoid of joy. There would be no part of his whole body that’s not pervaded with the comfort devoid of joy. ",
  "mn39:18.1": "Furthermore, with the giving up of comfort and discomfort—and with the ending of joys and upsets beforehand—without comfort or discomfort, with purity of equanimity and recollection, the bhikkhu abides having entered upon the fourth jhāna. ",
  "mn39:18.2": "He sits having pervaded his body with a pure, bright mind. There would be no part of his whole body that’s not pervaded with a pure, bright mind. ",
  "mn39:18.3": "It’s like a man sitting wrapped from head to foot with white cloth. There would be no part of his whole body that’s not spread over with white cloth. ",
  "mn39:18.4": "In the same way, the bhikkhu sits having pervaded his body with a pure, bright mind. There would be no part of his whole body that’s not pervaded with a pure, bright mind. ",
  "mn39:19.1": "When his mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he extends it towards the knowledge of recollection of past lives. ",
  "mn39:19.2": "He recollects many kinds of past lives, that is, one birth, two births … He recollects his many kinds of past lives, with features and details. ",
  "mn39:19.3": "Suppose a man was to leave his home village and go to another village. From that village he’d go to yet another village. And from that village he’d return to his home village. He’d think: ‘I went from my home village to another village. There I stood like this, sat like that, spoke like this, or kept silent like that. From that village I went to yet another village. There too I stood like this, sat like that, spoke like this, or kept silent like that. And from that village I returned to my home village.’ ",
  "mn39:19.4": "In the same way, the bhikkhu recollects his many kinds of past lives, with features and details. ",
  "mn39:20.1": "When his mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he extends it towards the knowledge of the passing away and reappearance of beings. ",
  "mn39:20.2": "With the divine eye that is purified and superhuman, he sees beings passing away and reappearing—inferior and superior, beautiful and ugly, in a good place or a bad place. He understands how beings reappear according to their actions. ",
  "mn39:20.3": "Suppose there were two houses with doors. A man with good eyesight standing in between them would see people entering and leaving a house and wandering to and fro. ",
  "mn39:20.4": "In the same way, with the divine eye that is purified and superhuman, he sees beings passing away and reappearing—inferior and superior, beautiful and ugly, in a good place or a bad place. He understands how beings reappear according to their actions. ",
  "mn39:21.1": "When his mind has become composed like this—purified, bright, flawless, rid of defilements, pliable, workable, steady, and imperturbable—he extends it towards the knowledge of the destruction of the influxes. ",
  "mn39:21.2": "He understands as it is: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering.’ ",
  "mn39:21.3": "He understands as it is: ‘These are influxes’ … ‘This is the origin of influxes’ … ‘This is the cessation of influxes’ … ‘This is the practice that leads to the cessation of influxes.’ ",
  "mn39:21.4": "Knowing and seeing like this, his mind is liberated from the influxes of sensuality, being, and ignorance. ",
  "mn39:21.5": "When it’s liberated, he knows it’s liberated. ",
  "mn39:21.6": "He understands: ‘Birth is destroyed, the renunciate life has been lived, what had to be done has been done, there will be no more of this.’ ",
  "mn39:21.7": "Suppose that in a mountain glen there was a lake that was transparent, clear, and unclouded. A man with clear eyes standing on the bank would see the clams and mussels, and pebbles and gravel, and schools of fish swimming about or staying still. ",
  "mn39:21.8": "",
  "mn39:21.9": "He’d think: ",
  "mn39:21.10": "‘This lake is transparent, clear, and unclouded. And here are the clams and mussels, and pebbles and gravel, and schools of fish swimming about or staying still.’ ",
  "mn39:21.11": "In the same way, he understands as it is: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering.’ ",
  "mn39:21.12": "... there will be no more of this.’ ",
  "mn39:22.1": "This bhikkhu is one who is called an ‘ascetic’, a ‘brahmin’, a ‘bathed one’, ‘one with complete knowledge’, a ‘scourer’, a ‘noble one’, and also an ‘Arahant’. ",
  "mn39:23.1": "And how is a bhikkhu an ascetic? ",
  "mn39:23.2": "He has appeased the bad, detrimental qualities that are defiling, involving repeated being, troublesome, resulting in suffering, leading to future birth, aging, and death. ",
  "mn39:23.3": "That’s how a bhikkhu is an ascetic. ",
  "mn39:24.1": "And how is a bhikkhu a brahmin? ",
  "mn39:24.2": "He has banished the bad, detrimental qualities that are defiling, involving repeated being, troublesome, resulting in suffering, leading to future birth, aging, and death. ",
  "mn39:24.3": "That’s how a bhikkhu is a brahmin. ",
  "mn39:25.1": "And how is a bhikkhu a bathed one? ",
  "mn39:25.2": "He has bathed off the bad, detrimental qualities that are defiling, involving repeated being, troublesome, resulting in suffering, leading to future birth, aging, and death. ",
  "mn39:25.3": "That’s how a bhikkhu is a bathed one. ",
  "mn39:26.1": "And how is a bhikkhu one with complete knowledge? ",
  "mn39:26.2": "The bad, detrimental qualities that are defiling, involving repeated being, troublesome, resulting in suffering, leading to future birth, aging, and death, have been known by him. ",
  "mn39:26.3": "That’s how a bhikkhu is one with complete knowledge. ",
  "mn39:27.1": "And how is a bhikkhu a scourer? ",
  "mn39:27.2": "He has scoured off the bad, detrimental qualities that are defiling, involving repeated being, troublesome, resulting in suffering, leading to future birth, aging, and death. ",
  "mn39:27.3": "That’s how a bhikkhu is a scourer. ",
  "mn39:28.1": "And how is a bhikkhu a noble one? ",
  "mn39:28.2": "The bad, detrimental qualities that are defiling, involving repeated being, troublesome, resulting in suffering, leading to future birth, aging, and death, are far away from him. ",
  "mn39:28.3": "That’s how a bhikkhu is a noble one. ",
  "mn39:29.1": "And how is a bhikkhu an Arahant? ",
  "mn39:29.2": "The bad, detrimental qualities that are defiling, involving repeated being, troublesome, resulting in suffering, leading to future birth, aging, and death, are far away from him. ",
  "mn39:29.3": "That’s how a bhikkhu is an Arahant.” ",
  "mn39:29.4": "That is what the Buddha said. ",
  "mn39:29.5": "Pleased, the bhikkhus delighted in what the Buddha said. "
}