{
  "mn40:0.1": "Middle Discourses 40 ",
  "mn40:0.2": "The Shorter Discourse at Assapura ",
  "mn40:1.1": "So I have heard. ",
  "mn40:1.2": "At one time the Buddha was staying in the land of the Aṅgas, near the Aṅgan town named Assapura. ",
  "mn40:1.3": "There the Buddha addressed the bhikkhus, ",
  "mn40:1.4": "“Bhikkhus!” ",
  "mn40:1.5": "“Bhante,” they replied. ",
  "mn40:1.6": "The Buddha said this: ",
  "mn40:2.1": "“Bhikkhus, people label you as ascetics. ",
  "mn40:2.2": "And when they ask you what you are, you claim to be ascetics. ",
  "mn40:2.3": "Given this label and this claim, you should train like this: ‘We will enter upon the way that is proper for an ascetic. That way our label will be accurate and our claim correct. ",
  "mn40:2.4": "",
  "mn40:2.5": "",
  "mn40:2.6": "Any robes, almsfood, lodgings, and medicines and supplies for the sick that we use will be very fruitful and beneficial for the donor. And our going forth will not be wasted, but will be fruitful and fertile.’ ",
  "mn40:2.7": "",
  "mn40:3.1": "And how has a bhikkhu not entered upon the way that is proper for an ascetic? ",
  "mn40:3.2": "There are some bhikkhus who have not given up covetousness, ill will, irritability, hostility, denigration, contentiousness, jealousy, stinginess, deviousness, deceit, evil wishes, and wrong view. ",
  "mn40:3.3": "These stains, defects, and dregs of an ascetic lead to places of loss, and are to be experienced in bad destinations. As long as they have not given these up, they have not entered upon the way that is proper for an ascetic, I say. ",
  "mn40:4.1": "I say that such a bhikkhu’s going forth may be compared to the kind of weapon called ‘deadborn’—double-edged, whetted with yellow arsenic—that has been covered and wrapped in an outer robe. ",
  "mn40:4.2": "",
  "mn40:4.3": "",
  "mn40:5.1": "I don’t say that someone is an ascetic just because they wear an outer robe. ",
  "mn40:5.2": "I don’t say that someone is an ascetic just because they go naked. ",
  "mn40:5.3": "I don’t say that someone is an ascetic just because they are covered in dust and dirt. ",
  "mn40:5.4": "I don’t say that someone is an ascetic just because they immerse themselves in water. ",
  "mn40:5.5": "I don’t say that someone is an ascetic just because they stay at the root of a tree. ",
  "mn40:5.6": "I don’t say that someone is an ascetic just because they stay in the open air. ",
  "mn40:5.7": "I don’t say that someone is an ascetic just because they stand perpetually. ",
  "mn40:5.8": "I don’t say that someone is an ascetic just because they eat in intervals. ",
  "mn40:5.9": "I don’t say that someone is an ascetic just because they recite hymns. ",
  "mn40:5.10": "I don’t say that someone is an ascetic just because they have matted hair. ",
  "mn40:6.1": "If just by wearing an outer robe someone with covetousness, ill will, irritability, hostility, denigration, contentiousness, jealousy, stinginess, deviousness, deceit, evil wishes, and wrong view could give up these things, friends and colleagues, relatives and kin would make one an outer robe wearer as soon as they were born: ",
  "mn40:6.2": "‘Please, my dear, wear an outer robe! Just by doing so you will give up covetousness, ill will, irritability, hostility, denigration, contentiousness, jealousy, stinginess, deviousness, deceit, evil wishes, and wrong view.’ ",
  "mn40:6.3": "But sometimes I see someone with these qualities who wears an outer robe. That’s why I don’t say that someone is an ascetic just because they wear an outer robe. ",
  "mn40:6.4": "If just by going naked … ",
  "mn40:6.5": "being covered in dust and dirt … ",
  "mn40:6.6": "immersing oneself in water … ",
  "mn40:6.7": "staying at the root of a tree … ",
  "mn40:6.8": "staying in the open air … ",
  "mn40:6.9": "standing perpetually … ",
  "mn40:6.10": "eating at set intervals … ",
  "mn40:6.11": "reciting hymns … ",
  "mn40:6.12": "having matted hair someone with covetousness, ill will, irritability, hostility, denigration, contentiousness, jealousy, stinginess, deviousness, deceit, evil wishes, and wrong view could give up these things, friends and colleagues, relatives and kin would make one a matted-hair ascetic as soon as they were born: ",
  "mn40:6.13": "‘Please, my dear, have matted hair! Just by doing so you will give up covetousness, ill will, irritability, hostility, denigration, contentiousness, jealousy, stinginess, deviousness, deceit, evil wishes, and wrong view.’ ",
  "mn40:6.14": "But sometimes I see someone with these qualities who is a matted-hair ascetic. That’s why I don’t say that someone is an ascetic just because they have matted hair. ",
  "mn40:7.1": "And how has a bhikkhu entered upon the way that is proper for an ascetic? ",
  "mn40:7.2": "There are some bhikkhus who have given up covetousness, ill will, irritability, hostility, denigration, contentiousness, jealousy, stinginess, deviousness, deceit, evil wishes, and wrong view. ",
  "mn40:7.3": "Since they have given up these stains, defects, and dregs of an ascetic that lead to places of loss and are to be experienced in bad destinations, they have entered upon the way that is proper for an ascetic, I say. ",
  "mn40:8.1": "They see themselves purified from all these bad, detrimental qualities. ",
  "mn40:8.2": "Considering this, gladness is born. When he’s glad, joy is born. When the mind is joyous, the body becomes calm. When the body is calm, he feels comfort. When he’s comfortable, the mind becomes composed. ",
  "mn40:9.1": "He abides having pervaded with a mind of friendliness the first direction, likewise second, likewise third, likewise the fourth. In the same way above, below, across, everywhere, he abides having pervaded the whole world with a mind of friendliness—abundant, expansive, immeasurable, free of enmity and ill will. ",
  "mn40:10-12.1": "He abides having pervaded with a mind of compassion ... ",
  "mn40:10-12.2": "He abides having pervaded with a mind of contentment ... ",
  "mn40:10-12.3": "He abides having pervaded with a mind of equanimity the first direction, likewise the second, likewise the third, likewise the fourth. In the same way above, below, across, everywhere, he abides having pervaded the whole world with a mind of equanimity—abundant, expansive, immeasurable, free of enmity and ill will. ",
  "mn40:13.1": "Suppose there was a lotus pond with clear, sweet, cool water, clean, with smooth banks, delightful. ",
  "mn40:13.2": "Then along comes a man—whether from the east, west, north, or south—struggling in the oppressive heat, weary, thirsty, and parched. ",
  "mn40:13.3": "No matter what direction they come from, when they arrive at that lotus pond they would alleviate their thirst and heat destruction. ",
  "mn40:13.4": "In the same way, suppose someone has gone forth from the lay life to homelessness—whether from a family of aristocrats, brahmins, peasants, or menials—and has arrived at the teaching and discipline proclaimed by a Realized One. Having developed friendliness, compassion, contentment, and equanimity in this way, they gain peace internally. ",
  "mn40:13.5": "Because of that internal peace they have entered upon the way proper for an ascetic, I say. ",
  "mn40:14.1": "And suppose someone has gone forth from the lay life to homelessness—whether from a family of aristocrats, brahmins, peasants, or workers—",
  "mn40:14.2": "and with the destruction of the influxes, they abide having entered upon the liberation by mind and liberation by understanding that is devoid of influxes, having for themselves comprehended and realized it right in the present experience. ",
  "mn40:14.3": "They’re an ascetic because of the destruction of defilements.” ",
  "mn40:14.4": "That is what the Buddha said. ",
  "mn40:14.5": "Pleased, the bhikkhus delighted in what the Buddha said. ",
  "mn40:14.6": "",
  "mn40:14.7": "",
  "mn40:15.1": "",
  "mn40:15.2": "",
  "mn40:15.3": ""
}