{
  "mn43:0.1": "Middle Discourses 43 ",
  "mn43:0.2": "The Great Elaboration ",
  "mn43:1.1": "So I have heard. ",
  "mn43:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
  "mn43:1.3": "Then in the late afternoon, Venerable Mahākoṭṭhita came out of retreat, went to Venerable Sāriputta, and exchanged pleasantries with him. ",
  "mn43:1.4": "When the amicable and cordial talk was over, he sat down to one side and said to Venerable Sāriputta: ",
  "mn43:2.1": "“Friend, they speak of ‘a witless person’. ",
  "mn43:2.2": "How is a witless person defined?” ",
  "mn43:2.3": "“Friend, they’re called witless because they don’t understand. ",
  "mn43:2.4": "And what don’t they understand? ",
  "mn43:2.5": "They don’t understand: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering.’ ",
  "mn43:2.6": "They’re called witless because they don’t understand.” ",
  "mn43:2.7": "Saying “Good, friend,” Venerable Mahākoṭṭhita approved and agreed with what Venerable Sāriputta said. Then he asked another question: ",
  "mn43:3.1": "“They speak of ‘a wise person’. ",
  "mn43:3.2": "How is a wise person defined?” ",
  "mn43:3.3": "“They’re called wise because they understand. ",
  "mn43:3.4": "And what do they understand? ",
  "mn43:3.5": "They understand: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering.’ ",
  "mn43:3.6": "They’re called wise because they understand.” ",
  "mn43:4.1": "“They speak of ‘consciousness’. ",
  "mn43:4.2": "How is consciousness defined?” ",
  "mn43:4.3": "“It’s called consciousness because it cognizes. ",
  "mn43:4.4": "And what does it cognize? ",
  "mn43:4.5": "It cognizes ‘pleasure’ and ‘displeasure’ and ‘neither-pleasure-nor-displeasure’. ",
  "mn43:4.6": "It’s called consciousness because it cognizes.” ",
  "mn43:5.1": "“Understanding and consciousness—",
  "mn43:5.2": "are these things mixed or separate? ",
  "mn43:5.3": "And is it possible to completely disentangle them so as to describe the difference between them?” ",
  "mn43:5.4": "“Understanding and consciousness—",
  "mn43:5.5": "these things are mixed, not separate. ",
  "mn43:5.6": "And it is not possible to completely disentangle them so as to describe the difference between them. ",
  "mn43:5.7": "For one cognizes what one understands, and understands that which is cognized. ",
  "mn43:5.8": "That’s why these things are mixed, not separate. ",
  "mn43:5.9": "And it is not possible to completely disentangle them so as to describe the difference between them. ",
  "mn43:6.1": "“Understanding and consciousness—",
  "mn43:6.2": "what is the difference between these things that are mixed, not separate?” ",
  "mn43:6.3": "",
  "mn43:6.4": "“The difference between these things is that understanding should be developed, while consciousness should be completely understood.” ",
  "mn43:6.5": "",
  "mn43:7.1": "“They speak of this thing called ‘feeling’. ",
  "mn43:7.2": "How is feeling defined?” ",
  "mn43:7.3": "“It’s called feeling because it feels. ",
  "mn43:7.4": "And what does it feel? ",
  "mn43:7.5": "It feels pleasure, displeasure, and neither-pleasure-nor-displeasure. ",
  "mn43:7.6": "It’s called feeling because it feels.” ",
  "mn43:8.1": "“They speak of this thing called ‘perception’. ",
  "mn43:8.2": "How is perception defined?” ",
  "mn43:8.3": "“It’s called perception because it perceives. ",
  "mn43:8.4": "And what does it perceive? ",
  "mn43:8.5": "It perceives blue, yellow, red, and white. ",
  "mn43:8.6": "It’s called perception because it perceives.” ",
  "mn43:9.1": "“Feeling, perception, and consciousness—",
  "mn43:9.2": "are these things mixed or separate? ",
  "mn43:9.3": "And is it possible to completely disentangle them so as to describe the difference between them?” ",
  "mn43:9.4": "“Feeling, perception, and consciousness—",
  "mn43:9.5": "these things are mixed, not separate. ",
  "mn43:9.6": "And it is not possible to completely disentangle them so as to describe the difference between them. ",
  "mn43:9.7": "For what one feels, one perceives, and what one perceives, one cognizes. ",
  "mn43:9.8": "That’s why these things are mixed, not separate. ",
  "mn43:9.9": "And you can never completely disentangle them so as to describe the difference between them.” ",
  "mn43:10.1": "“What can be known by purified mental-faculty-consciousness released from the five senses?” ",
  "mn43:10.2": "“Aware that ‘space is infinite’ it can know the extent of infinite space. Aware that ‘consciousness is infinite’ it can know the extent of infinite consciousness. Aware that ‘there is nothing at all’ it can know the extent of nothingness.” ",
  "mn43:11.1": "“How does one understand a knowable phenomenon?” ",
  "mn43:11.2": "“One understands a knowable phenomenon with the eye of understanding.” ",
  "mn43:12.1": "“What is the purpose of understanding?” ",
  "mn43:12.2": "“The purpose of understanding is comprehension, complete knowledge, and giving up.” ",
  "mn43:13.1": "“How many conditions are there for the arising of the Right View?” ",
  "mn43:13.2": "“There are two conditions for the arising of right view: ",
  "mn43:13.3": "the words of another and attending through the origin. ",
  "mn43:13.4": "These are the two conditions for the arising of right view.” ",
  "mn43:14.1": "“When right view is supported by how many factors does it have liberation by mind and liberation by understanding as its fruit and boon?” ",
  "mn43:14.2": "“When right view is supported by five factors it has liberation by mind and liberation by understanding as its fruit and boon. ",
  "mn43:14.3": "It’s when right view is supported by virtue, learning, discussion, calm, and insight. ",
  "mn43:14.4": "When right view is supported by these five factors it has liberation by mind and liberation by understanding as its fruit and boon. ” ",
  "mn43:15.1": "“How many types of being are there?” ",
  "mn43:15.2": "“Friend, there are these three types of being. ",
  "mn43:15.3": "Sensual being, material being, and immaterial being.” ",
  "mn43:16.1": "“But how is there the production of being again in the future?” ",
  "mn43:16.2": "“When beings are hindered by ignorance and fettered by craving, which delights wherever it lands— ",
  "mn43:16.3": "that’s how there is the production of being again in the future.” ",
  "mn43:17.1": "“But how is there no production of being again in the future”? ",
  "mn43:17.2": "“With the fading of ignorance, the arising of knowledge, and the cessation of craving— ",
  "mn43:17.3": "that’s how there is no production of being again in the future.” ",
  "mn43:18.1": "“But what, friend, is the first jhāna?” ",
  "mn43:18.2": "It’s when a bhikkhu, quite disjoined from sensuality, disjoined from unbeneficial phenomena, with thinking and with pondering, with joy and ease born of separation, abides having entered upon the first jhāna. ",
  "mn43:18.3": "This is called the first jhāna.” ",
  "mn43:19.1": "“But how many factors does the first jhāna have?” ",
  "mn43:19.2": "“The first jhāna has five factors. ",
  "mn43:19.3": "For a bhikkhu who has attained the first jhāna, thinking, pondering, joy, ease, and unification of mind are present. ",
  "mn43:19.4": "That’s how the first jhāna has five factors.” ",
  "mn43:20.1": "“But how many factors is the first jhāna is the first jhāna devoid of and how many does it possess?” ",
  "mn43:20.2": "“The first jhāna is devoid of five factors and possesses five factors. ",
  "mn43:20.3": "For a bhikkhu who has attained the first jhāna, sensual desire, ill will, indolence-and-lethargy, restlessness-and-anxiety, and doubt have been given up. ",
  "mn43:20.4": "Thinking, pondering, joy, ease, and unification of mind are present. ",
  "mn43:20.5": "That’s how the first jhāna is devoid of five factors and possesses five factors.” ",
  "mn43:21.1": "“Friend, these five faculties have different scopes and different ranges, and don’t experience each others’ scope and range. That is, ",
  "mn43:21.2": "the faculties of the eye, ear, nose, tongue, and body. ",
  "mn43:21.3": "What do these five faculties, with their different scopes and ranges, have recourse to? What experiences their scopes and ranges?” ",
  "mn43:21.4": "",
  "mn43:21.5": "",
  "mn43:21.6": "“These five faculties, with their different scopes and ranges, have recourse to the mental faculty. And the mental faculty experiences their scopes and ranges.” ",
  "mn43:22.1": "",
  "mn43:22.2": "",
  "mn43:22.3": "“These five faculties depend on what to continue?” ",
  "mn43:22.4": "",
  "mn43:22.5": "",
  "mn43:22.6": "“These five faculties depend on life to continue.” ",
  "mn43:22.7": "“But what does life depend on to continue?” ",
  "mn43:22.8": "“Life depends on warmth to continue.” ",
  "mn43:22.9": "“But what does warmth depend on to continue?” ",
  "mn43:22.10": "“Warmth depends on life to continue.” ",
  "mn43:22.11": "“Just now I understood you to say: ",
  "mn43:22.12": "‘Life depends on warmth to continue.’ ",
  "mn43:22.13": "But I also understood you to say: ",
  "mn43:22.14": "‘Warmth depends on life to continue.’ ",
  "mn43:22.15": "How then should we see the meaning of this statement?” ",
  "mn43:22.16": "“Well then, friend, I shall give you a simile. ",
  "mn43:22.17": "For by means of a simile some sensible people understand the meaning of what is said. ",
  "mn43:22.18": "Suppose there was an oil lamp burning. The light appears dependent on the flame, and the flame appears dependent on the light. ",
  "mn43:22.19": "In the same way, life depends on warmth to continue, and warmth depends on life to continue.” ",
  "mn43:23.1": "“Are the life-activities phenomena that are experienced? Or are life-activities one thing and phenomena that are experienced another?” ",
  "mn43:23.2": "“The life-activities are not the same as phenomena that are experienced. ",
  "mn43:23.3": "For if the life-activities were the same as phenomena that are experienced, a bhikkhu who had attained the cessation of perception-and-feeling would not emerge from it. ",
  "mn43:23.4": "But because the life-activities are one thing and phenomena that are experienced another, a bhikkhu who has attained the cessation of perception-and-feeling can emerge from it.” ",
  "mn43:24.1": "“When it loses how many things does this body lie forsaken, tossed aside like an inanimate log?” ",
  "mn43:24.2": "“When this body loses three things, it lies forsaken, tossed aside like an insentient log: life, warmth, and consciousness.” ",
  "mn43:25.1": "“What’s the difference between someone who has passed away and a bhikkhu who has attained the cessation of perception-and-feeling?” ",
  "mn43:25.2": "“When someone dies, their physical, verbal, and mental activities have ceased and stilled; their life is spent; their warmth is dissipated; and their faculties have disintegrated. ",
  "mn43:25.3": "When a bhikkhu has attained the cessation of perception-and-feeling, his physical, verbal, and mental activities have ceased and stilled. But his life is not spent; his warmth is not dissipated; and his faculties are very clear. ",
  "mn43:25.4": "That’s the difference between someone who has passed away and a bhikkhu who has attained the cessation of perception-and-feeling.” ",
  "mn43:26.1": "“How many conditions are necessary to attain the liberation of mind devoid of ease and unease?” ",
  "mn43:26.2": "“Four conditions are necessary to attain the liberation of mind devoid of ease and unease. ",
  "mn43:26.3": "With the giving up of ease and unease—and with the ending of joys and upsets beforehand—without ease or unease, with purity of equanimity and recollection, a bhikkhu abides having entered upon the fourth jhāna. ",
  "mn43:26.4": "These four conditions are necessary to attain the liberation of mind devoid of ease and unease.” ",
  "mn43:27.1": "“How many conditions are necessary to attain the signless liberation of mind?” ",
  "mn43:27.2": "“Two conditions are necessary to attain the signless liberation of mind: ",
  "mn43:27.3": "not attending to any signs, and attending to the signless property. ",
  "mn43:27.4": "These two conditions are necessary to attain the signless liberation of mind.” ",
  "mn43:27.5": "“How many conditions are necessary to remain in the signless liberation of mind?” ",
  "mn43:28.1": "“Three conditions are necessary to remain in the signless liberation of mind: ",
  "mn43:28.2": "not attending to any signs, attending to the signless property, and a previous determination. ",
  "mn43:28.3": "These three conditions are necessary to remain in the signless liberation of mind.” ",
  "mn43:29.1": "“How many conditions are necessary to emerge from the signless liberation of mind?” ",
  "mn43:29.2": "“Two conditions are necessary to emerge from the signless liberation of mind: ",
  "mn43:29.3": "attending to all signs, and not attending to the signless property. ",
  "mn43:29.4": "These two conditions are necessary to emerge from the signless liberation of mind.” ",
  "mn43:29.5": "“The signless liberation of mind, and the liberation of mind through nothingness, and the liberation of mind through emptiness, and the signless liberation of mind: do these things differ in both meaning and phrasing? Or do they mean the same thing, and differ only in the phrasing?” ",
  "mn43:30.1": "“There is a way in which these things differ in both meaning and phrasing. ",
  "mn43:30.2": "But there’s also a way in which they mean the same thing, and differ only in the phrasing. ",
  "mn43:31.1": "And what’s the way in which these things differ in both meaning and phrasing? ",
  "mn43:31.2": "Firstly, a bhikkhu abides having pervaded with a mind of friendliness the first direction, likewise second, likewise third, likewise the fourth. In the same way above, below, across, everywhere, he abides having pervaded the whole world with a mind of friendliness—abundant, expansive, immeasurable, free of enmity and ill will. ",
  "mn43:31.3": "He abides having pervaded with a mind of compassion … ",
  "mn43:31.4": "a mind of contentment … ",
  "mn43:31.5": "He abides having pervaded with a mind of equanimity the first direction, likewise the second, likewise the third, likewise the fourth. In the same way above, below, across, everywhere, he abides having pervaded the whole world with a mind of equanimity—abundant, expansive, immeasurable, free of enmity and ill will. ",
  "mn43:31.6": "This is called the immeasurable liberation of mind. ",
  "mn43:32.1": "And what is the liberation of mind through nothingness? ",
  "mn43:32.2": "It’s when a bhikkhu, having fully surmounted the extent of infinite consciousness, aware that ‘there is nothing’, abides having entered upon the extent of nothingness. … ",
  "mn43:32.3": "This is called the liberation of mind through nothingness. ",
  "mn43:33.1": "And what is the liberation of mind through emptiness? ",
  "mn43:33.2": "It’s when a bhikkhu has gone to a wilderness, or to the root of a tree, or to an empty hut, and reflects like this: ",
  "mn43:33.3": "‘This is empty of a self or what belongs to a self.’ ",
  "mn43:33.4": "This is called the liberation of mind through emptiness. ",
  "mn43:34.1": "And what is the signless liberation of mind? ",
  "mn43:34.2": "It’s when a bhikkhu, not attending to any signs, abides having entered upon the signless liberation of mind. ",
  "mn43:34.3": "This is called the signless liberation of mind. ",
  "mn43:34.4": "This is the way in which these things differ in both meaning and phrasing. ",
  "mn43:35.1": "And what’s the way in which they mean the same thing, and differ only in the phrasing? ",
  "mn43:35.2": "Passion, aversion, and muddledness are makers of measurements. ",
  "mn43:35.3": "For a bhikkhu who has destroyed the influxes, these are given up, cut off at the root, made like a palm stump, obliterated, and are are unable to arise in the future. ",
  "mn43:35.4": "The unshakable liberation of mind is said to be the best kind of immeasurable liberation of mind. ",
  "mn43:35.5": "That unshakable liberation of mind is empty of passion, aversion, and muddledness. ",
  "mn43:36.1": "Passion is something, aversion is something, and muddledness is something. ",
  "mn43:36.2": "For a bhikkhu who has destroyed the influxes, these are given up, cut off at the root, made like a palm stump, obliterated, and are are unable to arise in the future. ",
  "mn43:36.3": "The unshakable liberation of mind is said to be the best kind of liberation of mind through nothingness. ",
  "mn43:36.4": "That unshakable liberation of mind is empty of passion, aversion, and muddledness. ",
  "mn43:37.1": "Passion, aversion, and muddledness are makers of signs. ",
  "mn43:37.2": "For a bhikkhu who has destroyed the influxes, these are given up, cut off at the root, made like a palm stump, obliterated, and are are unable to arise in the future. ",
  "mn43:37.3": "The unshakable liberation of mind is said to be the best kind of signless liberation of mind. ",
  "mn43:37.4": "That unshakable liberation of mind is empty of passion, aversion, and muddledness. ",
  "mn43:37.5": "This is the way in which they mean the same thing, and differ only in the phrasing.” ",
  "mn43:37.6": "This is what Venerable Sāriputta said. ",
  "mn43:37.7": "Pleased, Venerable Mahākoṭṭhita delighted in with what Venerable Sāriputta said. "
}