{
  "mn44:0.1": "Middle Discourses 44 ",
  "mn44:0.2": "The Shorter Elaboration ",
  "mn44:1.1": "So I have heard. ",
  "mn44:1.2": "At one time the Buddha was staying near Rājagaha, in the Bamboo Grove, the squirrels’ feeding ground. ",
  "mn44:1.3": "Then the layman Visākha went to see the nun Dhammadinnā, bowed, sat down to one side, and said to her: ",
  "mn44:2.1": "“Ma’am, ‘personality, personality’, it is said. ",
  "mn44:2.2": "What has the Buddha referred to as personality?” ",
  "mn44:2.3": "“Visākha, the Buddha has referred to these five assumption-aggregates as personality. ",
  "mn44:2.4": "That is, the assumption-aggregates of form, feeling, perception, activities, and consciousness. ",
  "mn44:2.5": "It is these five assumption-aggregates that the Buddha has referred to as personality.” ",
  "mn44:2.6": "Saying “Good, ma’am,” Visākha approved and agreed with what the nun Dhammadinnā said. Then he asked another question: ",
  "mn44:3.1": "“Ma’am, ‘the origin of personality, the origin of personality’, it is said. ",
  "mn44:3.2": "What has the Buddha referred to as the origin of personality?” ",
  "mn44:3.3": "“It is the craving that leads to renewed being, accompanied by delight-and-passion, which delights wherever it lands. That is, ",
  "mn44:3.4": "craving for sensuality, craving for being, and craving for non-being. ",
  "mn44:3.5": "This is what the Buddha has referred to as the origin of personality.” ",
  "mn44:4.1": "“Ma’am, ‘the cessation of personality, the cessation of personality’, it is said. ",
  "mn44:4.2": "What has the Buddha referred to as the cessation of personality?” ",
  "mn44:4.3": "It is the fading and cessation of that very same craving without remainder; giving it up, letting it go, releasing it, and not resting upon it. ",
  "mn44:4.4": "This is what the Buddha has referred to as the cessation of personality.” ",
  "mn44:5.1": "“Ma’am, ‘the practice that leads to the cessation of personality, the practice that leads to the cessation of personality’, it is said. ",
  "mn44:5.2": "What has the Buddha referred to as the practice that leads to the cessation of personality?” ",
  "mn44:5.3": "“The practice that leads to the cessation of personality that the Buddha has referred to is simply this Noble Eightfold Path, that is: ",
  "mn44:5.4": "right view, right intention, right speech, right action, right livelihood, right effort, right remembrance, and right composure.” ",
  "mn44:6.1": "“But ma’am, is that assumption the same as the five assumption-aggregates? Or is assumption one thing and the five assumption-aggregates another?” ",
  "mn44:6.2": "“That assumption is not the same as the five assumption-aggregates. Nor is assumption one thing and the five assumption-aggregates another. ",
  "mn44:6.3": "It is the desire-and-passion for the five assumption-aggregates that is the assumption there.” ",
  "mn44:7.1": "“But ma’am, how is there personality-view?” ",
  "mn44:7.2": "“It is when an unlearned ordinary person has not seen the noble ones, and is neither skilled nor trained in the teaching of the noble ones. He has not seen the righteous men, and is neither skilled nor trained in the teaching of the righteous men. ",
  "mn44:7.3": "He regards form as self, self as having form, form in self, or self in form. ",
  "mn44:7.4": "He regards feeling … ",
  "mn44:7.5": "perception … ",
  "mn44:7.6": "activities … ",
  "mn44:7.7": "consciousness as self, self as having consciousness, consciousness in self, or self in consciousness. ",
  "mn44:7.8": "That is how there is personality-view.” ",
  "mn44:8.1": "“But ma’am, how is there not personality-view?” ",
  "mn44:8.2": "“It is when a learned noble disciple has seen the noble ones, and is skilled and trained in the teaching of the noble ones. He has seen the righteous men, and is skilled and trained in the teaching of the righteous men. ",
  "mn44:8.3": "He does not regard form as self, self as having form, form in self, or self in form. ",
  "mn44:8.4": "He does not regard feeling … ",
  "mn44:8.5": "perception … ",
  "mn44:8.6": "activities … ",
  "mn44:8.7": "consciousness as self, self as having consciousness, consciousness in self, or self in consciousness. ",
  "mn44:8.8": "That is how there is not personality-view.” ",
  "mn44:9.1": "“But ma’am, what is the Noble Eightfold Path?” ",
  "mn44:9.2": "“It is simply this Noble Eightfold Path, that is: ",
  "mn44:9.3": "right view, right intention, right speech, right action, right livelihood, right effort, right remembrance, and right composure.” ",
  "mn44:10.1": "“But ma’am, is the Noble Eightfold Path determined or undetermined?” ",
  "mn44:10.2": "“The Noble Eightfold Path is determined.” ",
  "mn44:11.1": "“Are the three aggregates [of development] included in the Noble Eightfold Path? Or is the Noble Eightfold Path included in the three aggregates [of development]?” ",
  "mn44:11.2": "“The three aggregates [of development] are not included in the Noble Eightfold Path. Rather, the Noble Eightfold Path is included in the three aggregates [of development]. ",
  "mn44:11.3": "Right speech, right action, and right livelihood: these things are included in the aggregate of virtue. ",
  "mn44:11.4": "Right effort, right remembrance, and right composure: these things are included in the aggregate of composure. ",
  "mn44:11.5": "Right view and right intention: these things are included in the aggregate of understanding.” ",
  "mn44:12.1": "“But ma’am, what is composure? What things are the basis of composure? What things are the requisites for composure? What is the development of composure?” ",
  "mn44:12.2": "“Unification of the mind is composure. ",
  "mn44:12.3": "The four foundations of remembrance are the basis of composure. ",
  "mn44:12.4": "The four right efforts are the requisites for composure. ",
  "mn44:12.5": "The cultivation, development, and making much of these very same phenomena is the development of composure.” ",
  "mn44:13.1": "“How many activities are there?” ",
  "mn44:13.2": "“There are these three activities. ",
  "mn44:13.3": "The bodily activity, the verbal activity, and the mind-activity.” ",
  "mn44:14.1": "“But madam, what is the bodily activity? What is the verbal activity? What is the mind-activity?” ",
  "mn44:14.2": "“Breathing is the bodily activity. Thinking and pondering are the verbal activity. Perception and feeling are the mind-activity.” ",
  "mn44:15.1": "“But madam, why is breathing the bodily activity? Why are thinking and pondering the verbal activity? Why are perception and feeling the mind-activity?” ",
  "mn44:15.2": "“Breathing is bodily. It is tied up with the body, that is why breathing is the bodily activity. ",
  "mn44:15.3": "Having first thought and pondered, one breaks into speech. That is why thinking and pondering are the verbal activity. ",
  "mn44:15.4": "Perception and feeling are mental. They are tied up with the mind, that is why perception and feeling are the mind-activity.” ",
  "mn44:16.1": "“But madam, how does someone attain the cessation of perception-and-feeling?” ",
  "mn44:16.2": "“A bhikkhu who is attaining the cessation of perception-and-feeling does not think: ",
  "mn44:16.3": "‘I will attain the cessation of perception-and-feeling’ or ‘I am attaining the cessation of perception-and-feeling’ or ‘I have attained the cessation of perception-and-feeling.’ ",
  "mn44:16.4": "Rather, his mind has been previously developed so as to lead to that.” ",
  "mn44:17.1": "“But madam, which activity ceases first for a bhikkhu who is attaining the cessation of perception-and-feeling: the bodily, verbal, or mind-activity?” ",
  "mn44:17.2": "“The verbal activity ceases first, then the bodily activity, then the mind-activity.” ",
  "mn44:18.1": "“But madam, how does someone emerge from the cessation of perception-and-feeling?” ",
  "mn44:18.2": "“A bhikkhu who is emerging from such an attainment does not think: ",
  "mn44:18.3": "‘I will emerge from the cessation of perception-and-feeling’ or ‘I am emerging from the cessation of perception-and-feeling’ or ‘I have emerged from the cessation of perception-and-feeling.’ ",
  "mn44:18.4": "Rather, his mind has been previously developed so as to lead to that.” ",
  "mn44:19.1": "“But madam, which activity arises first for a bhikkhu who is emerging from the cessation of perception-and-feeling: the bodily, verbal, or mind-activity?” ",
  "mn44:19.2": "“The mind-activity arises first, then the bodily activity, then the verbal activity.” ",
  "mn44:20.1": "“But madam, when a bhikkhu has emerged from the attainment of the cessation of perception-and-feeling, how many kinds of contact does he experience?” ",
  "mn44:20.2": "“He experiences three kinds of contact: emptiness-contact, signless contact, and undirected contact.” ",
  "mn44:21.1": "“But madam, when a bhikkhu has emerged from the attainment of the cessation of perception-and-feeling, what does his mind slant, slope, and incline to?” ",
  "mn44:21.2": "“His mind slants, slopes, and inclines to disengagement.” ",
  "mn44:22.1": "“But madam, how many feelings are there?” ",
  "mn44:22.2": "“There are three feelings: ",
  "mn44:22.3": "pleasant, unpleasant, and neither-pleasant-nor-unpleasant feeling.” ",
  "mn44:23.1": "“What are these three feelings?” ",
  "mn44:23.2": "“That which is felt as pleasant and agreeable, whether bodily or mental. ",
  "mn44:23.3": "This is pleasant feeling. ",
  "mn44:23.4": "That which is felt as unpleasant and disagreeable, whether bodily or mental. ",
  "mn44:23.5": "This is unpleasant feeling. ",
  "mn44:23.6": "That which is felt as neither-agreeable-nor-disagreeable, whether bodily or mental. ",
  "mn44:23.7": "This is neither-pleasant-nor-unpleasant feeling.” ",
  "mn44:24.1": "“What is pleasant and what is unpleasant with regard to each of the three feelings?” ",
  "mn44:24.2": "“Pleasant feeling is pleasant when it remains and unpleasant when it deteriorates. ",
  "mn44:24.3": "Unpleasant feeling is unpleasant when it remains and pleasant when it deteriorates. ",
  "mn44:24.4": "Neither-pleasant-nor-unpleasant feeling is pleasant when known, and unpleasant when not known.” ",
  "mn44:25.1": "“What underlying tendencies underlie each of the three feelings?” ",
  "mn44:25.2": "“The underlying tendency for passion underlies pleasant feeling. The underlying tendency for resistance underlies painful feeling. The underlying tendency for ignorance underlies neither-pleasant-nor-unpleasant feeling.” ",
  "mn44:26.1": "“Do these underlying tendencies always underlie these feelings?” ",
  "mn44:26.2": "“No, they do not.” ",
  "mn44:27.1": "“What should be given up with regard to each of these three feelings?” ",
  "mn44:27.2": "“The underlying tendency to passion should be given up when it comes to pleasant feeling. The underlying tendency to resistance should be given up when it comes to unpleasant feeling. The underlying tendency to ignorance should be given up when it comes to neither-pleasant-nor-unpleasant feeling.” ",
  "mn44:28.1": "“Should these underlying tendencies be given up with regard to all instances of these feelings?” ",
  "mn44:28.2": "“No, not in all instances. ",
  "mn44:28.3": "Take a bhikkhu who, having thoroughly withdrawn from sensuality, having withdrawn from unbeneficial phenomena, with thinking and with pondering, with joy and ease born of withdrawal, abides having entered upon the first jhāna. ",
  "mn44:28.4": "With this he gives up passion, and the underlying tendency to passion does not underlie there. ",
  "mn44:28.5": "And take a bhikkhu who reflects: ",
  "mn44:28.6": "‘Oh, when will I abide having entered upon the same sphere that the noble ones abide having entered at present?’ ",
  "mn44:28.7": "Nursing such a yearning for the supreme liberations gives rise to sorrow due to yearning. ",
  "mn44:28.8": "With this he gives up resistance, and the underlying tendency to resistance does not underlie there. ",
  "mn44:28.9": "Take a bhikkhu who, with the giving up of ease and unease—and with the ending of joys and upsets beforehand—without ease or unease, with purity of equanimity and remembrance, abides having entered upon the fourth jhāna. ",
  "mn44:28.10": "With this he gives up ignorance, and the underlying tendency to ignorance does not underlie there.” ",
  "mn44:29.1": "“But ma’am, what is the counterpart of pleasant feeling?” ",
  "mn44:29.2": "“Unpleasant feeling.” ",
  "mn44:29.3": "“What is the counterpart of unpleasant feeling?” ",
  "mn44:29.4": "“Pleasant feeling.” ",
  "mn44:29.5": "“What is the counterpart of neither-pleasant-nor-unpleasant feeling?” ",
  "mn44:29.6": "“Ignorance.” ",
  "mn44:29.7": "“What is the counterpart of ignorance?” ",
  "mn44:29.8": "“Knowledge.” ",
  "mn44:29.9": "“What is the counterpart of knowledge?” ",
  "mn44:29.10": "“Liberation.” ",
  "mn44:29.11": "“What is the counterpart of liberation?” ",
  "mn44:29.12": "“Nibbāna.” ",
  "mn44:29.13": "“What is the counterpart of Nibbāna?” ",
  "mn44:29.14": "“Your question goes too far, Visākha. You could not figure out the limit of questions. ",
  "mn44:29.15": "For Nibbāna is the culmination, destination, and end of the renunciate life. ",
  "mn44:29.16": "If you wish, go to the Buddha and ask him this question. You should remember it in line with his answer.” ",
  "mn44:30.1": "And then the layman Visākha, having delighted in and expressed appreciation for what the nun Dhammadinnā said, got up from his seat, bowed, and respectfully circled her, keeping her on his right. Then he went up to the Buddha, bowed, sat down to one side, ",
  "mn44:30.2": "and informed the Buddha of all they had discussed. ",
  "mn44:30.3": "When he had spoken, the Buddha said to him, ",
  "mn44:30.4": "“The nun Dhammadinnā is wise, Visākha, she is of great understanding. ",
  "mn44:30.5": "If you came to me and asked this question, I would answer it in exactly the same way as the nun Dhammadinnā. ",
  "mn44:30.6": "That is what it means, and that is how you should remember it.” ",
  "mn44:30.7": "That is what the Buddha said. ",
  "mn44:30.8": "Pleased, the layman Visākha delighted in what the Buddha said."
}