{
    "mn46:0.1": "Middle Discourses 46 ",
    "mn46:0.2": "The Great Discourse on Undertakings ",
    "mn46:1.1": "Thus have I heard. ",
    "mn46:1.2": "At one time the Auspicious One was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
    "mn46:1.3": "There the Auspicious One addressed the bhikkhus, ",
    "mn46:1.4": "“Bhikkhus!” ",
    "mn46:1.5": "“Venerable sir,” they replied. ",
    "mn46:1.6": "The Auspicious One said this: ",
    "mn46:2.1": "“Bhikkhus, beings typically have the wish, desire, and hope: ",
    "mn46:2.2": "‘Oh, if only unlikable, undesirable, and disagreeable things would decrease, and likable, desirable, and agreeable things would increase!’ ",
    "mn46:2.3": "But the exact opposite happens to them. ",
    "mn46:2.4": "What do you take to be the reason for this?” ",
    "mn46:2.5": "“Our teachings are rooted in the Auspicious One. He is our guide and our refuge. Venerable sir, may the Auspicious One himself please clarify the meaning of this. The bhikkhus will listen and remember it.” ",
    "mn46:2.6": "“Well then, bhikkhus, listen and apply your mind well, I will speak.” ",
    "mn46:2.7": "“Yes, venerable sir,” they replied. ",
    "mn46:2.8": "The Auspicious One said this: ",
    "mn46:3.1": "“Take an unlearned ordinary person who has not seen the noble ones, and is neither skilled nor trained in the teaching of the noble ones. He has not seen the righteous men, and is neither skilled nor trained in the teaching of the righteous men. ",
    "mn46:3.2": "He does not know what things he should cultivate and foster, and what things he should not cultivate and foster. ",
    "mn46:3.3": "So he cultivates and fosters things he should not, and does not cultivate and foster things he should. ",
    "mn46:3.4": "When he does so, unlikable, undesirable, and disagreeable things increase, and likable, desirable, and agreeable things decrease. ",
    "mn46:3.5": "Why is that? ",
    "mn46:3.6": "Because that is what it is like for someone who is ignorant. ",
    "mn46:4.1": "But a learned noble disciple has seen the noble ones, and is skilled and trained in the teaching of the noble ones. He has seen the righteous men, and is skilled and trained in the teaching of the righteous men. ",
    "mn46:4.2": "He knows what things he should cultivate and foster, and what things he should not cultivate and foster. ",
    "mn46:4.3": "So he cultivates and foster things he should, and do not cultivate and foster things he should not. ",
    "mn46:4.4": "When he does so, unlikable, undesirable, and disagreeable things decrease, and likable, desirable, and agreeable things increase. ",
    "mn46:4.5": "Why is that? ",
    "mn46:4.6": "Because that is what it is like for someone who is wise. ",
    "mn46:5.1": "Bhikkhus, there are these four undertakings. ",
    "mn46:5.2": "What four? ",
    "mn46:5.3": "There is an undertaking that is painful now and results in future pain. ",
    "mn46:5.4": "There is an undertaking that is pleasant now but results in future pain. ",
    "mn46:5.5": "There is an undertaking that is painful now but results in future pleasure. ",
    "mn46:5.6": "There is an undertaking that is pleasant now and results in future pleasure. ",
    "mn46:6.1": "When it comes to the undertaking that is painful now and results in future pain, an ignorant person, not knowing, does not understand as it is: ",
    "mn46:6.2": "‘This is the undertaking that is painful now and results in future pain.’ ",
    "mn46:6.3": "So instead of avoiding it, he cultivates it. ",
    "mn46:6.4": "When he does so, unlikable, undesirable, and disagreeable things increase, and likable, desirable, and agreeable things decrease. ",
    "mn46:6.5": "Why is that? ",
    "mn46:6.6": "Because that is what it is like for someone who does not know. ",
    "mn46:7.1": "When it comes to the undertaking that is pleasant now and results in future pain, an ignorant person … ",
    "mn46:7.2": "",
    "mn46:7.3": "cultivates it … ",
    "mn46:7.4": "and disagreeable things increase … ",
    "mn46:7.5": "",
    "mn46:7.6": "",
    "mn46:8.1": "When it comes to the undertaking that is painful now and results in future pleasure, an ignorant person … ",
    "mn46:8.2": "",
    "mn46:8.3": "does not cultivate it … ",
    "mn46:8.4": "and disagreeable things increase … ",
    "mn46:8.5": "",
    "mn46:8.6": "",
    "mn46:9.1": "When it comes to the undertaking that is pleasant now and results in future pleasure, an ignorant person … ",
    "mn46:9.2": "",
    "mn46:9.3": "does not cultivate it … ",
    "mn46:9.4": "and disagreeable things increase … ",
    "mn46:9.5": "Why is that? ",
    "mn46:9.6": "Because that is what it is like for someone who is ignorant. ",
    "mn46:10.1": "When it comes to the undertaking that is painful now and results in future pain, a wise person, knowing this, understands as it is: ",
    "mn46:10.2": "‘This is the undertaking that is painful now and results in future pain.’ ",
    "mn46:10.3": "So instead of cultivating it, he avoids it. ",
    "mn46:10.4": "When he does so, unlikable, undesirable, and disagreeable things decrease, and likable, desirable, and agreeable things increase. ",
    "mn46:10.5": "Why is that? ",
    "mn46:10.6": "Because that is what it is like for someone who knows. ",
    "mn46:11.1": "When it comes to the undertaking that is pleasant now and results in future pain, a wise person … ",
    "mn46:11.2": "",
    "mn46:11.3": "does not cultivate it … ",
    "mn46:11.4": "and agreeable things increase … ",
    "mn46:11.5": "",
    "mn46:11.6": "",
    "mn46:12.1": "When it comes to the undertaking that is painful now and results in future pleasure, a wise person … ",
    "mn46:12.2": "",
    "mn46:12.3": "cultivates it … ",
    "mn46:12.4": "and agreeable things increase … ",
    "mn46:12.5": "",
    "mn46:12.6": "",
    "mn46:13.1": "When it comes to the undertaking that is pleasant now and results in future pleasure, a wise person, knowing this, understands as it is: ",
    "mn46:13.2": "‘This is the undertaking that is pleasant now and results in future pleasure.’ ",
    "mn46:13.3": "So instead of avoiding it, he cultivates it. ",
    "mn46:13.4": "When he does so, unlikable, undesirable, and disagreeable things decrease, and likable, desirable, and agreeable things increase. ",
    "mn46:13.5": "Why is that? ",
    "mn46:13.6": "Because that is what it is like for someone who knows. ",
    "mn46:14.1": "And what is the undertaking that is painful now and results in future pain? ",
    "mn46:14.2": "It is when someone, in pain and sorrow, kills living creatures, steals, and engages in misconduct with regard to sense pleasures. He uses speech that is false, divisive, harsh, or frivolous. And he is covetous, averse, with wrong view. Because of these things, he experiences pain and sorrow. ",
    "mn46:14.3": "",
    "mn46:14.4": "",
    "mn46:14.5": "",
    "mn46:14.6": "",
    "mn46:14.7": "",
    "mn46:14.8": "",
    "mn46:14.9": "",
    "mn46:14.10": "",
    "mn46:14.11": "",
    "mn46:14.12": "And when his body breaks up, after death, he reappears in a place of loss, a bad place, the underworld, hell. ",
    "mn46:14.13": "This is called the undertaking that is painful now and results in future pain. ",
    "mn46:15.1": "And what is the undertaking that is pleasant now but results in future pain? ",
    "mn46:15.2": "It is when someone with pleasure and happiness kills living creatures, steals, and engages in misconduct with regard to sense pleasures. He uses speech that is false, divisive, harsh, or frivolous. And he is covetous, averse, with wrong view. Because of these things, he experiences pleasure and happiness. ",
    "mn46:15.3": "",
    "mn46:15.4": "",
    "mn46:15.5": "",
    "mn46:15.6": "",
    "mn46:15.7": "",
    "mn46:15.8": "",
    "mn46:15.9": "",
    "mn46:15.10": "",
    "mn46:15.11": "",
    "mn46:15.12": "But when his body breaks up, after death, he reappears in a place of loss, a bad place, the underworld, hell. ",
    "mn46:15.13": "This is called the undertaking that is pleasant now but results in future pain. ",
    "mn46:16.1": "And what is the undertaking that is painful now but results in future pleasure? ",
    "mn46:16.2": "It is when someone, in pain and sorrow, does not kill living creatures, steal, or engage in misconduct with regard to sense pleasures. He does not use speech that is false, divisive, harsh, or frivolous. And he is not covetous or averse, and has right view. Because of these things, he experiences pain and sorrow. ",
    "mn46:16.3": "",
    "mn46:16.4": "",
    "mn46:16.5": "",
    "mn46:16.6": "",
    "mn46:16.7": "",
    "mn46:16.8": "",
    "mn46:16.9": "",
    "mn46:16.10": "",
    "mn46:16.11": "",
    "mn46:16.12": "But when his body breaks up, after death, he reappears in a good place, a heavenly realm. ",
    "mn46:16.13": "This is called the undertaking that is painful now but results in future pleasure. ",
    "mn46:17.1": "And what is the undertaking that is pleasant now and results in future pleasure? ",
    "mn46:17.2": "It is when someone, with pleasure and happiness, does not kill living creatures, steal, or engage in misconduct with regard to sense pleasures. He does not use speech that is false, divisive, harsh, or frivolous. And he is not covetous or averse, and have right view. Because of these things, he experiences pleasure and happiness. ",
    "mn46:17.3": "",
    "mn46:17.4": "",
    "mn46:17.5": "",
    "mn46:17.6": "",
    "mn46:17.7": "",
    "mn46:17.8": "",
    "mn46:17.9": "",
    "mn46:17.10": "",
    "mn46:17.11": "",
    "mn46:17.12": "And when his body breaks up, after death, he reappears in a good place, a heavenly realm. ",
    "mn46:17.13": "This is called the undertaking that is pleasant now and results in future pleasure. ",
    "mn46:17.14": "These are the four undertakings. ",
    "mn46:18.1": "Suppose there was some bitter gourd mixed with poison. ",
    "mn46:18.2": "Then a man would come along who wants to live and does not want to die, who wants pleasure and recoils from pain. ",
    "mn46:18.3": "They would say to him: ",
    "mn46:18.4": "‘Here, mister, this is bitter gourd mixed with poison. ",
    "mn46:18.5": "Drink it if you like. ",
    "mn46:18.6": "If you drink it, the color, aroma, and flavor will be unappetizing, and it will result in death or deadly pain.’ ",
    "mn46:18.7": "He would not reject it. Without reflection, he would drink it. ",
    "mn46:18.8": "The color, aroma, and flavor would be unappetizing, and it would result in death or deadly pain. ",
    "mn46:18.9": "This is comparable to the undertaking that is painful now and results in future pain, I say. ",
    "mn46:19.1": "Suppose there was a bronze cup of beverage that had a nice color, aroma, and flavor. ",
    "mn46:19.2": "But it was mixed with poison. ",
    "mn46:19.3": "Then a man would come along who wants to live and does not want to die, who wants pleasure and recoils from pain. ",
    "mn46:19.4": "They would say to him: ",
    "mn46:19.5": "‘Here, mister, this bronze cup of beverage has a nice color, aroma, and flavor. ",
    "mn46:19.6": "But it is mixed with poison. ",
    "mn46:19.7": "Drink it if you like. ",
    "mn46:19.8": "If you drink it, the color, aroma, and flavor will be appetizing, but it will result in death or deadly pain.’ ",
    "mn46:19.9": "He would not reject it. Without reflection, he would drink it. ",
    "mn46:19.10": "The color, aroma, and flavor would be appetizing, but it would result in death or deadly pain. ",
    "mn46:19.11": "This is comparable to the undertaking that is pleasant now and results in future pain, I say. ",
    "mn46:20.1": "Suppose there was some rancid urine mixed with different medicines. ",
    "mn46:20.2": "Then a man with jaundice would come along. ",
    "mn46:20.3": "They would say to him: ",
    "mn46:20.4": "‘Here, mister, this is rancid urine mixed with different medicines. Drink it if you like. ",
    "mn46:20.5": "If you drink it, the color, aroma, and flavor will be unappetizing, but after drinking it, you will be at ease.’ ",
    "mn46:20.6": "He would not reject it. After appraisal, he would drink it. ",
    "mn46:20.7": "The color, aroma, and flavor would be unappetizing, but after drinking it, he would be at ease. ",
    "mn46:20.8": "This is comparable to the undertaking that is painful now and results in future pleasure, I say. ",
    "mn46:21.1": "Suppose there was some curds, honey, ghee, and molasses all mixed together. ",
    "mn46:21.2": "Then a man with bloody dysentery would come along. ",
    "mn46:21.3": "They would say to him: ",
    "mn46:21.4": "‘Here, mister, this is curds, honey, ghee, and molasses all mixed together. Drink it if you like. ",
    "mn46:21.5": "If you drink it, the color, aroma, and flavor will be appetizing, and after drinking, it you will be at ease.’ ",
    "mn46:21.6": "He would not reject it. After appraisal, he would drink it. ",
    "mn46:21.7": "The color, aroma, and flavor would be appetizing, and after drinking it, he would be at ease. ",
    "mn46:21.8": "This is comparable to the undertaking that is pleasant now and results in future pleasure, I say. ",
    "mn46:22.1": "It is like the time after the rainy season when the sky is clear and cloudless. And when the sun rises, it dispels all the darkness from the sky as it shines and glows and radiates. ",
    "mn46:22.2": "In the same way, this undertaking that is pleasant now and results in future pleasure dispels the doctrines of the various other ascetics and brahmins as it shines and glows and radiates.” ",
    "mn46:22.3": "That is what the Auspicious One said. ",
    "mn46:22.4": "Pleased, the bhikkhus delighted in what the Auspicious One said. "
}