{
    "mn48:0.1": "Middle Discourses 48 ",
    "mn48:0.2": "The Bhikkhus of Kosambī ",
    "mn48:1.1": "So I have heard. ",
    "mn48:1.2": "At one time the Buddha was staying near Kosambī, in Ghosita’s Monastery. ",
    "mn48:2.1": "Now at that time the bhikkhus of Kosambī were arguing, quarreling, and disputing, continually wounding each other with barbed words. ",
    "mn48:2.2": "They could not persuade each other or be persuaded, nor could they convince each other or be convinced. ",
    "mn48:3.1": "Then a bhikkhu went up to the Buddha, bowed, sat down to one side, and informed him of the matter. ",
    "mn48:3.2": "",
    "mn48:4.1": "So the Buddha addressed one of the monks, ",
    "mn48:4.2": "“Please, bhikkhu, in my name tell those bhikkhus that ",
    "mn48:4.3": "the teacher summons them. ",
    "mn48:4.4": "“Yes, Bhante,” that bhikkhu replied. He went to those bhikkhus and said, ",
    "mn48:4.5": "“Venerables, the teacher summons you.” ",
    "mn48:4.6": "“Yes, venerable,” those bhikkhus replied. They went to the Buddha, bowed, and sat down to one side. The Buddha said to them, ",
    "mn48:4.7": "“Is it really true, bhikkhus, that you have been arguing, quarreling, and disputing, continually wounding each other with barbed words? ",
  "mn48:4.8": "And that you cannot persuade each other or be persuaded, nor can you convince each other or be convinced?” ",
    "mn48:4.9": "“Yes, Bhante,” they said. ",
    "mn48:5.1": "“What do you think, bhikkhus? ",
    "mn48:5.2": "When you are arguing, quarreling, and disputing, continually wounding each other with barbed words, are your bodily, verbal, and mental actions towards your fellow renunciates friendly, both in public and in private?” ",
    "mn48:5.3": "“No, Bhante.” ",
    "mn48:5.4": "“So it seems that when you are arguing like this, your actions towards each other are not friendly. ",
    "mn48:5.5": "So what exactly do you know and see, you inept men, that you behave in such a way? ",
    "mn48:5.6": "This will be for your lasting harm and suffering.” ",
    "mn48:6.1": "Then the Buddha said to the bhikkhus: ",
    "mn48:6.2": "“Bhikkhus, these six amicable qualities make for fondness and respect, conducing to cohesion, non-dispute, concord, and unity. ",
    "mn48:6.3": "What six? ",
    "mn48:6.4": "Firstly, a bhikkhu’s bodily actions towards his fellow renunciates are friendly, both in public and in private. ",
    "mn48:6.5": "This amicable quality makes for fondness and respect, conducing to cohesion, non-dispute, concord, and unity. ",
    "mn48:6.6": "Furthermore, a bhikkhu’s verbal actions towards his fellow renunciates are friendly, both in public and in private … ",
    "mn48:6.7": "",
    "mn48:6.8": "Furthermore, a bhikkhu’s mental actions towards his fellow renunciates are friendly, both in public and in private … ",
    "mn48:6.9": "",
    "mn48:6.10": "Furthermore, a bhikkhu shares without reservation any material possessions he has gained by legitimate means, even the food placed in the alms-bowl, using them in common with his virtuous fellow renunciates … ",
    "mn48:6.11": "",
    "mn48:6.12": "Furthermore, a bhikkhu lives according to the virtue shared with his fellow renunciates, both in public and in private—that virtue which is unbroken, flawless, unmottled, spotless, and liberating, praised by the wise, not clung to, and leading to composure. ",
    "mn48:6.13": "",
    "mn48:6.14": "Furthermore, a bhikkhu lives according to the view shared with his fellow renunciates, both in public and in private—that view which is noble and emancipating, and delivers one who acts according to it to the complete ending of suffering. ",
    "mn48:6.15": "This amicable quality makes for fondness and respect, conducing to cohesion, non-dispute, concord, and unity. ",
    "mn48:6.16": "These six amicable qualities make for fondness and respect, conducing to cohesion, non-dispute, concord, and unity. ",
    "mn48:7.1": "Of these six amicable qualities, the chief is the view that is noble and emancipating, and delivers one who acts according to it to the complete ending of suffering. It holds and binds everything together. ",
    "mn48:7.2": "It is like a bungalow. The roof-peak is the chief point, which holds and binds everything together. ",
    "mn48:7.3": "In the same way, of these six amicable qualities, the chief is the view that is noble and emancipating, and delivers one who acts according to it to the complete ending of suffering. It holds and binds everything together. ",
    "mn48:8.1": "And how does the view that is noble and emancipating lead one who acts according to it to the complete ending of suffering? ",
    "mn48:8.2": "It is when a bhikkhu has gone to a wilderness, or to the root of a tree, or to an empty hut, and reflects like this, ",
    "mn48:8.3": "‘Is there any prepossession not given up internally by me that might prepossess my mind such that I would not accurately know and see?’ ",
    "mn48:8.4": "If a bhikkhu is prepossessed by sensual desire, his mind is prepossessed. ",
    "mn48:8.5": "If a bhikkhu is prepossessed by ill will, ",
    "mn48:8.6": "indolence-and-lethargy, ",
    "mn48:8.7": "restlessness-and-anxiety, ",
    "mn48:8.8": "doubt, ",
    "mn48:8.9": "pursuing speculation about this world, ",
    "mn48:8.10": "pursuing speculation about the next world, ",
    "mn48:8.11": "or arguing, quarreling, and disputing, continually wounding others with barbed words, his mind is prepossessed. ",
    "mn48:8.12": "He understands, ",
    "mn48:8.13": "‘There is no prepossession not given up internally by me that might prepossess my mind such that I would not accurately know and see. ",
    "mn48:8.14": "My mind is properly disposed for awakening to the truths.’ ",
    "mn48:8.15": "This is the first knowledge he has achieved that is noble and supramundane, and is not shared with ordinary people. ",
    "mn48:9.1": "Furthermore, a noble disciple reflects, ",
    "mn48:9.2": "‘When I develop, cultivate, and make much of this view, do I gain calm and quenching for myself?’ ",
    "mn48:9.3": "He understands, ",
    "mn48:9.4": "‘When I develop, cultivate, and make much of this view, I gain calm and quenching for myself.’ ",
    "mn48:9.5": "This is his second knowledge … ",
    "mn48:10.1": "Furthermore, a noble disciple reflects, ",
    "mn48:10.2": "‘Are there any ascetics or brahmins outside of here who have the same kind of view that I have?’ ",
    "mn48:10.3": "He understands, ",
    "mn48:10.4": "‘There are no ascetics or brahmins outside of here who have the same kind of view that I have.’ ",
    "mn48:10.5": "This is his third knowledge … ",
    "mn48:11.1": "Furthermore, a noble disciple reflects, ",
    "mn48:11.2": "‘Do I have the same nature as an individual accomplished in view?’ ",
    "mn48:11.3": "And what, bhikkhus, is the nature of an individual accomplished in view? ",
    "mn48:11.4": "This is the nature of an individual accomplished in view: ",
    "mn48:11.5": "Though he may fall into a kind of offense for which resolution is possible, he quickly discloses, clarifies, and reveals it to the Teacher or a wise fellow renunciate. ",
    "mn48:11.6": "And having revealed it he restrains himself in the future. ",
    "mn48:11.7": "Suppose a young tender infant puts his hand or foot on a burning coal; he quickly pulls it back. ",
    "mn48:11.8": "In the same way, this is the nature of an individual accomplished in view. ",
    "mn48:11.9": "Though he may still fall into a kind of offense for which resolution is possible, he quickly reveals it to the Teacher or a wise fellow renunciate. ",
    "mn48:11.10": "And having revealed it he restrains himself in the future. ",
    "mn48:11.11": "He understands, ",
    "mn48:11.12": "‘I have the same nature as an individual accomplished in view.’ ",
    "mn48:11.13": "This is his fourth knowledge … ",
    "mn48:12.1": "Furthermore, a noble disciple reflects, ",
    "mn48:12.2": "‘Do I have the same nature as an individual accomplished in view?’ ",
    "mn48:12.3": "And what, bhikkhus, is the nature of an individual accomplished in view? ",
    "mn48:12.4": "This is the nature of an individual accomplished in view. ",
    "mn48:12.5": "Though he might manage a diverse array of duties for his fellow renunciates, he still feels a keen regard for the training in higher virtue, higher mind, and higher understanding. ",
    "mn48:12.6": "Suppose there was a cow with a baby calf. As she grazes, she keeps an eye on her calf. ",
    "mn48:12.7": "In the same way, this is the nature of an individual accomplished in view. ",
    "mn48:12.8": "Though he might manage a diverse array of duties for his fellow renunciates, he still feels a keen regard for the training in higher virtue, higher mind, and higher understanding. ",
    "mn48:12.9": "He understands, ",
    "mn48:12.10": "‘I have the same nature as an individual accomplished in view.’ ",
    "mn48:12.11": "This is his fifth knowledge … ",
    "mn48:13.1": "Furthermore, a noble disciple reflects, ",
    "mn48:13.2": "‘Do I have the same strength as an individual accomplished in view?’ ",
    "mn48:13.3": "And what, bhikkhus, is the strength of an individual accomplished in view? ",
    "mn48:13.4": "The strength of an individual accomplished in view is that, when the teaching-and-discipline proclaimed by the Realized One are being taught, he listens to it wholeheartedly, with full attention. ",
    "mn48:13.5": "He understands, ",
    "mn48:13.6": "‘I have the same strength as an individual accomplished in view.’ ",
    "mn48:13.7": "This is his sixth knowledge … ",
    "mn48:14.1": "Furthermore, a noble disciple reflects, ",
    "mn48:14.2": "‘Do I have the same strength as an individual accomplished in view?’ ",
    "mn48:14.3": "And what, bhikkhus, is the strength of an individual accomplished in view? ",
    "mn48:14.4": "The strength of an individual accomplished in view is that, when the teaching-and-discipline proclaimed by the Realized One are being taught, he realizes the Dhamma and its meaning, and gains gladness connected with the Dhamma. ",
    "mn48:14.5": "He understands, ",
    "mn48:14.6": "‘I have the same strength as an individual accomplished in view.’ ",
    "mn48:14.7": "This is the seventh knowledge he has achieved that is noble and supramundane, and is not shared with ordinary people. ",
    "mn48:15.1": "When a noble disciple has these seven factors, he has properly investigated his nature regarding the realization of the fruit of stream-entry. ",
    "mn48:15.2": "A noble disciple with these seven factors has the fruit of stream-entry.” ",
    "mn48:15.3": "That is what the Buddha said. ",
    "mn48:15.4": "Pleased, the bhikkhus delighted in what the Buddha said. "
}