{
    "mn51:0.1": "Middle Discourses 51 ",
    "mn51:0.2": "With Kandaraka ",
    "mn51:1.1": "Thus have I heard. ",
    "mn51:1.2": "At one time, the Auspicious One was staying near Campā on the banks of the Gaggarā Lotus Pond together with a large Saṅgha of bhikkhus. ",
    "mn51:1.3": "Then Pessa the elephant driver’s son and Kandaraka the wanderer went to see the Auspicious One. When they had approached, Pessa bowed and sat down to one side. ",
    "mn51:1.4": "But the wanderer Kandaraka exchanged pleasantries. When the amicable and cordial talk was over, he stood to one side. ",
    "mn51:1.5": "He looked around the bhikkhu Saṅgha, who were so very silent, and said to the Auspicious One: ",
    "mn51:2.1": "“It is remarkable, Master Gotama, it is extraordinary! ",
    "mn51:2.2": "How the bhikkhu Saṅgha has been led to practice properly by Master Gotama! ",
    "mn51:2.3": "All the Arahants, the fully awakened Buddhas, in the past or the future who lead the bhikkhu Saṅgha to practice properly will at best do so ",
    "mn51:2.4": "like Master Gotama does in the present.” ",
    "mn51:2.5": "",
    "mn51:2.6": "",
    "mn51:3.1": "“Thus it is indeed, Karandaka. ",
    "mn51:3.2": "All the Arahants, the fully awakened Buddhas in the past or the future who lead the bhikkhu Saṅgha to practice properly will at best do so ",
    "mn51:3.3": "like I do in the present. ",
    "mn51:3.4": "",
    "mn51:3.5": "",
    "mn51:3.6": "For in this bhikkhu Saṅgha there are bhikkhus who are Arahants, who have destroyed the influxes, fulfilled the training, done what had to be done, laid down the burden, arrived at the highest goal, utterly destroyed the fetters of being, and are liberated by right understanding. ",
    "mn51:3.7": "And in this bhikkhu Saṅgha there are trainee bhikkhus who are consistently virtuous, consistent in their behavior and living judiciously. ",
    "mn51:3.8": "They abide with their minds well established in the four establishments of remembrance. ",
    "mn51:3.9": "What four? ",
    "mn51:3.10": "Here, a bhikkhu abides maintaining perspective of the body concurrently with the body—diligent, aware, and recollected, having dispelled longing and upset with regard to the world. ",
    "mn51:3.11": "He abides maintaining perspective of feelings concurrently with feelings—diligent, aware, and recollected, having dispelled longing and upset with regard to the world. ",
    "mn51:3.12": "He abides maintaining perspective of the mind concurrently with the mind—diligent, aware, and recollected, having dispelled longing and upset with regard to the world. ",
    "mn51:3.13": "He abides maintaining perspective of phenomena concurrently with phenomena—diligent, aware, and recollected, having subdued longing and upset with regard to the world. ",
    "mn51:4.1": "When he had spoken, Pessa said to the Auspicious One: ",
    "mn51:4.2": "“It is remarkable, venerable sir, it is extraordinary! ",
    "mn51:4.3": "How well described by the Auspicious One are the four establishments of remembrance! For the purification of beings, for the surmounting of sorrow and lamentation, for bringing an end to suffering and upset, for accomplishing the method, and for realizing Nibbāna. ",
    "mn51:4.4": "For we white-clothed laypeople also, from time to time, abide with our minds well set in the four establishments of remembrance. ",
    "mn51:4.5": "We abide maintaining perspective of the body concurrently with the body … ",
    "mn51:4.6": "of feelings concurrently with feelings … ",
    "mn51:4.7": "of the mind concurrently with the mind … ",
    "mn51:4.8": "of phenomena concurrently with phenomena—diligent, aware, and recollected, having subdued longing and upset with regard to the world. ",
    "mn51:4.9": "It is remarkable, venerable sir, it is extraordinary! ",
    "mn51:4.10": "How the Auspicious One knows what is best for beings, even though people continue to be so deceitful, corrupt, and devious. ",
    "mn51:4.11": "For human beings are deceitful, venerable sir, ",
    "mn51:4.12": "while the animal is obvious. ",
    "mn51:4.13": "For I can drive an elephant in training, ",
    "mn51:4.14": "and while going back and forth in Campā, it will try all the stratagems, deceptions, ruses, and feints that it can. ",
    "mn51:4.15": "But my bondservants, servants, and workers behave one way by body, another by speech, and their minds another. ",
    "mn51:4.16": "It is remarkable, venerable sir, it is extraordinary! ",
    "mn51:4.17": "How the Auspicious One knows what is best for beings, even though people continue to be so deceitful, corrupt, and devious. ",
    "mn51:4.18": "For human beings are deceitful, venerable sir, ",
    "mn51:4.19": "while the animal is obvious.” ",
    "mn51:5.1": "“Thus it is indeed, Pessa. ",
    "mn51:5.2": "For human beings are deceitful, ",
    "mn51:5.3": "while the animal is obvious. ",
    "mn51:5.4": "Pessa, these four individuals are found in the world. ",
    "mn51:5.5": "What four? ",
    "mn51:5.6": "One individual mortifies themselves, committed to the practice of mortifying themselves. ",
    "mn51:5.7": "One individual mortifies others, committed to the practice of mortifying others. ",
    "mn51:5.8": "One individual mortifies themselves and others, committed to the practice of mortifying themselves and others. ",
    "mn51:5.9": "One individual does not mortify neither themselves nor others, committed to the practice of not mortifying themselves nor others. ",
    "mn51:5.10": "They live desireless right in the present experience, extinguished, cooled, feeling at ease, having themselves become divine. ",
    "mn51:5.11": "Which one of these four individuals appeals to you?” ",
    "mn51:5.12": "“Venerable sir, the first three individuals do not appeal to me. ",
    "mn51:5.13": "",
    "mn51:5.14": "",
    "mn51:5.15": "",
    "mn51:5.16": "Only the fourth individual appeals to me, who does not mortify neither themselves nor others.” ",
    "mn51:6.1": "“But why don’t the first three individuals appeal to you?” ",
    "mn51:6.2": "“Venerable sir, the individual who mortifies themselves does so, even though they desire pleasure and are opposed to displeasure. ",
    "mn51:6.3": "That is why that individual does not appeal to me. ",
    "mn51:6.4": "The individual who mortifies others does so, even though others they desire pleasure and are opposed to displeasure. ",
    "mn51:6.5": "That is why that individual does not appeal to me. ",
    "mn51:6.6": "The individual who mortifies themselves and others does so, even though both themselves and others desire pleasure and are opposed to displeasure. ",
    "mn51:6.7": "That is why that individual does not appeal to me. ",
    "mn51:6.8": "The individual who does not mortify neither themselves nor others—living desireless right in the present experience, extinguished, cooled, feeling at ease, having themselves become divine—does not torment themselves or others, both of whom desire pleasure and are opposed to displeasure. ",
    "mn51:6.9": "",
    "mn51:6.10": "That is why that individual appeals to me. ",
    "mn51:6.11": "Well, now, venerable sir, I must go. ",
    "mn51:6.12": "I have many duties, and much to do.” ",
    "mn51:6.13": "“Pessa, go at your convenience.” ",
    "mn51:6.14": "And then, Pessa the elephant driver’s son, having delighted in and expressed appreciation for what the Auspicious One said, arose from his seat, bowed, and respectfully circled the Auspicious One, keeping him on his right, before leaving. ",
    "mn51:7.1": "Then, not long after he had left, the Auspicious One addressed the bhikkhus: ",
    "mn51:7.2": "“Bhikkhus, Pessa the elephant driver’s son is wise. ",
    "mn51:7.3": "He is of great understanding. ",
    "mn51:7.4": "If he had sat here a little longer so that I could have analyzed these four individuals in detail, he would have greatly benefited. ",
    "mn51:7.5": "Still, even with this much, he has already greatly benefited.” ",
    "mn51:7.6": "“Now is the time, Auspicious One! Now is the time, Excellent One! ",
    "mn51:7.7": "May the Auspicious One analyze these four individuals in detail. The bhikkhus will listen and remember it.” ",
    "mn51:7.8": "“Well then, bhikkhus, listen and apply your mind well, I will speak.” ",
    "mn51:7.9": "“Yes, venerable sir,” they replied. ",
    "mn51:7.10": "The Auspicious One said this: ",
    "mn51:8.1": "“And what individual mortifies themselves, committed to the practice of mortifying themselves? It is when someone goes naked, ignoring conventions. They lick their hands, and do not come or wait when called. They do not consent to food brought to them, or food prepared for them, or an invitation for a meal. ",
    "mn51:8.2": "They do not receive anything from a pot or bowl; or from someone who keeps sheep, or who has a weapon or a shovel in their home; or where a couple is eating; or where there is a woman who is pregnant, breastfeeding, or who has a man in her home; or where there is a dog waiting or flies buzzing. They accept no fish or meat or liquor or wine, and drink no beer. ",
    "mn51:8.3": "They go to just one house for alms, taking just one mouthful, or two houses and two mouthfuls, up to seven houses and seven mouthfuls. ",
    "mn51:8.4": "They subsist on one saucer a day, two saucers a day, up to seven saucers a day. ",
    "mn51:8.5": "They eat once a day, once every second day, up to once a week, and so on, even up to once a fortnight. They live, committed to the practice of eating food at set intervals. ",
    "mn51:8.6": "They eat herbs, millet, wild rice, poor rice, water lettuce, rice bran, scum from boiling rice, sesame flour, grass, or cow dung. They subsist on forest roots and fruits, or consuming fallen fruit. ",
    "mn51:8.7": "They wear robes of sunn hemp, mixed hemp, corpse-wrapping cloth, rags, lodh tree bark, antelope hide (whole or in strips), kusa grass, bark, wood-chips, human hair, horse-tail hair, or owls’ wings. ",
    "mn51:8.8": "They tear out their hair and beard, committed to this practice. ",
    "mn51:8.9": "They constantly stand, refusing seats. ",
    "mn51:8.10": "They squat, committed to the practice of squatting. ",
    "mn51:8.11": "They lie on a mat of thorns, making a mat of thorns their bed. ",
    "mn51:8.12": "They are committed to the practice of immersion in water three times a day, including the evening. ",
    "mn51:8.13": "And so they live committed to these various ways of mortifying and tormenting the body. ",
    "mn51:8.14": "This is called an individual who mortifies themselves, being committed to the practice of mortifying themselves. ",
    "mn51:9.1": "And what individual mortifies others, committed to the practice of mortifying others? ",
    "mn51:9.2": "It is when an individual is a slaughterer of sheep, pigs, or poultry, a hunter or trapper, a fisher, a bandit, an executioner, a butcher, a jailer, or someone with some other kind of cruel livelihood. ",
    "mn51:9.3": "This is called an individual who mortifies others, being committed to the practice of mortifying others. ",
    "mn51:10.1": "And what individual mortifies themselves and others, being committed to the practice of mortifying themselves and others? ",
    "mn51:10.2": "It is when an individual is an anointed aristocratic king or an affluent brahmin. ",
    "mn51:10.3": "He has a new ceremonial hall built to the east of the citadel. He shaves off his hair and beard, dresses in a rough antelope hide, and smears his body with ghee and oil. Scratching his back with antlers, he enters the hall with his chief queen and the brahmin high priest. ",
    "mn51:10.4": "There, he lies on the bare ground strewn with grass. ",
    "mn51:10.5": "The king feeds on the milk from one teat of a cow that has a calf of the same color. The chief queen feeds on the milk from the second teat. The brahmin high priest feeds on the milk from the third teat. The milk from the fourth teat is served to the sacred flame. The calf feeds on the remainder. ",
    "mn51:10.6": "He says: ",
    "mn51:10.7": "‘Slaughter this many bulls, bullocks, heifers, goats, rams, and horses for the sacrifice! Fell this many trees and reap this much grass for the sacrificial equipment!’ ",
    "mn51:10.8": "His bondservants, servants, and workers perform their duties under threat of punishment and danger, weeping with tearful faces. ",
    "mn51:10.9": "This is called an individual who mortifies themselves and others, being committed to the practice of mortifying themselves and others. ",
    "mn51:11.1": "And what individual does not mortify neither themselves or others, but lives desireless, right in the present experience, extinguished, cooled, feeling at ease, having themselves become divine? ",
    "mn51:12.1": "It is when a Realized One arises in the world, an Arahant, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed. ",
    "mn51:12.2": "Having for himself comprehended and experienced this world—with its gods, Māras and Brahmās, this population with its ascetics and brahmins, gods and humans—, he makes it known to others. ",
    "mn51:12.3": "He teaches the Dhamma that is good in the beginning, good in the middle, and good in the end, meaningful and well-phrased. And he reveals a renunciate life that is entirely complete and pure. ",
    "mn51:13.1": "A householder hears that Dhamma, or a householder’s son, or someone born in a good family. ",
    "mn51:13.2": "They gain faith in the Realized One ",
    "mn51:13.3": "and reflect: ",
    "mn51:13.4": "‘Household life is confined and dusty, but the life of one gone forth is wide open. ",
    "mn51:13.5": "It is not easy for someone living at home to lead the renunciate life utterly complete and pure, like a polished shell. ",
    "mn51:13.6": "Why don’t I shave off my hair and beard, dress in ocher robes, and go forth from the lay life to homelessness?’ ",
    "mn51:13.7": "After some time, he gives up a large or small fortune, and a large or small family circle. He shaves off hair and beard, dresses in ocher robes, and goes forth from the lay life to homelessness. ",
    "mn51:14.1": "Once he is gone forth, he undertakes the training and livelihood of the bhikkhus. He gives up and abstains from killing living creatures, renouncing the rod and the sword. He is scrupulous and kind, living compassionate for the welfare of all creatures and beings. ",
    "mn51:14.2": "He gives up and abstains from taking what is not given. He takes only what is given, and expects only what is given. He maintains purity by refraining from theft. ",
    "mn51:14.3": "He gives up and abstains from incelibacy. He is celibate, set apart, avoiding the vulgar act of sexual intercourse. ",
    "mn51:14.4": "He gives up and abstains from lying. He speaks the truth and adheres to the truth. He is honest and trustworthy, and does not deceive the world with his words. ",
    "mn51:14.5": "He gives up and abstains from divisive speech. He does not repeat in one place what he heard in another to sow discord. Instead, he reconciles those who are divided, supporting unity, delighting in harmony, enjoying harmony, and speaking words that promote harmony. ",
    "mn51:14.6": "He gives up and abstains from harsh speech. He speaks in a way that is gentle, pleasing to the ear, affectionate, going to the heart, polite, amiable, and agreeable to the people. ",
    "mn51:14.7": "He forgoes and abstains from frivolous speech. His words are timely, true, and meaningful, in line with the teaching-and-discipline. He is one who speaks what is timely, truthful, meaningful, and in line with the Dhamma and Vinaya. At the right time, he speaks words that are worth treasuring—well-grounded, succinct, and beneficial. ",
    "mn51:14.8": "He abstains from violence towards plants and seeds. ",
    "mn51:14.9": "He eats in one part of the day, abstaining from eating at night and at the inappropriate time. ",
    "mn51:14.10": "He abstains from dancing, singing, music, and watching shows. ",
    "mn51:14.11": "He abstains from beautifying and adorning himself with garlands, perfumes, and makeup. ",
    "mn51:14.12": "He abstains from high and luxurious beds. ",
    "mn51:14.13": "He abstains from receiving gold and money, ",
    "mn51:14.14": "raw grains, ",
    "mn51:14.15": "raw meat, ",
    "mn51:14.16": "women and girls, ",
    "mn51:14.17": "male and female bondservants, ",
    "mn51:14.18": "goats and sheep, ",
    "mn51:14.19": "chickens and pigs, ",
    "mn51:14.20": "elephants, cows, horses, and mares, ",
    "mn51:14.21": "and fields and land. ",
    "mn51:14.22": "He abstains from running errands and messages; ",
    "mn51:14.23": "buying and selling; ",
    "mn51:14.24": "falsifying weights, metals, or measures; ",
    "mn51:14.25": "bribery, fraud, cheating, and duplicity; ",
    "mn51:14.26": "mutilation, murder, abduction, banditry, plunder, and violence. ",
    "mn51:15.1": "He is content with robes to sustain the body and almsfood to sustain the stomach. Wherever he goes, he sets out taking only these things. ",
    "mn51:15.2": "He is like a birdo: wherever it flies, wings are its only burden. ",
    "mn51:15.3": "In the same way, a bhikkhu is content with robes to sustain the body and almsfood to sustain the stomach. Wherever he goes, he sets out taking only these things. ",
    "mn51:15.4": "Possessed of this noble aggregate of virtue, he experiences a blameless ease internally. ",
    "mn51:16.1": "When he sees a sight with the eye, he does not grasp at signs and features of it ",
    "mn51:16.2": "on account of which—due to abiding with the eye faculty unrestrained—bad, unbeneficial thoughts of longing and upset would flow in on him. He practices to restrain that; he guards the eye faculty and brings about the restraint of the eye faculty. ",
    "mn51:16.3": "When he hears a sound with the ear … ",
    "mn51:16.4": "When he smells an odor with the nose … ",
    "mn51:16.5": "When he tastes a flavor with the tongue … ",
    "mn51:16.6": "When he touches a touch with the body … ",
    "mn51:16.7": "When he cognizes a phenomenon with the mental faculty, he does not grasp at signs and features of it ",
    "mn51:16.8": "on account of which—due to abiding with the mental faculty unrestrained—bad, unbeneficial thoughts of longing and upset would flow in on him. He practices to restrain that; he guards the mental faculty and brings about the restraint of the mental faculty. ",
    "mn51:16.9": "Possessed of this noble sense restraint, he experiences an unsullied ease internally. ",
    "mn51:17.1": "He acts with awareness when going out and coming back; when looking ahead and aside; when bending and extending the limbs; when bearing the outer robe, bowl, and robes; when eating, drinking, chewing, and tasting; when urinating and defecating; when walking, standing, sitting, sleeping, waking, speaking, and keeping silent. ",
    "mn51:18.1": "Possessed of this noble aggregate of virtue, this noble contentment, this noble sense restraint, and this noble remembrance-and-awareness, ",
    "mn51:18.2": "he frequents a secluded lodging—a wilderness, the root of a tree, a hill, a ravine, a mountain cave, a charnel ground, a forest, the open air, a heap of straw. ",
    "mn51:19.1": "After the meal, he returns from almsround, sits down cross-legged, sets his body straight, and establishes remembrance at the fore. ",
    "mn51:19.2": "With the giving up of longing with regard to the world, he abides with a mind freed from longing; he cleanses the mind of longing. ",
    "mn51:19.3": "With the giving up of ill will and hatred, he abides with a mind freed from ill will, compassionate for the welfare of all creatures and beings; he cleanses the mind of ill will and hatred. ",
    "mn51:19.4": "With the giving up of indolence-and-lethargy, he abides with a mind freed from indolence-and-lethargy, perceiving light, recollected, and aware; he cleanses the mind of indolence-and-lethargy. ",
    "mn51:19.5": "With the giving up of restlessness-and-anxiety, he abides without restlessness, his mind internally appeased; he cleanses the mind of restlessness-and-anxiety. s ",
    "mn51:19.6": "With the With the giving up of of doubt, he abides having gone beyond doubt, not uncertain about beneficial qualities; he cleanses the mind of doubt. ",
    "mn51:20.1": "He gives up these five hindrances, defilements of the mind that weaken understanding. ",
    "mn51:20.2": "Then, having thoroughly withdrawn from sensuality, having withdrawn from unbeneficial phenomena, with thinking and with pondering, with joy and ease born of withdrawal, he abides having entered upon the first jhāna. ",
    "mn51:21.1": "With the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and ease born of composure, a bhikkhu abides having entered upon the second jhāna. ",
    "mn51:22.1": "With the fading of joy, a bhikkhu abides equanimous, recollected, and aware, experiencing ease with the body. He abides having entered upon the third jhāna, with regard to which the noble ones say “one abides equanimous, recollected, and at ease.” ",
    "mn51:23.1": "With the giving up of ease and unease—and with the ending of joys and upsets beforehand—without ease or unease, with purity of equanimity and remembrance, a bhikkhu abides having entered upon the fourth jhāna. ",
    "mn51:24.1": "When his mind has become composed like this—purified, bright, flawless, freed from defilements, pliable, workable, steady, and imperturbable—he extends it towards the knowledge of recollection of past lives. ",
    "mn51:24.2": "He recollects many kinds of past lives. That is: one, two, three, four, five, ten, twenty, thirty, forty, fifty, a hundred, a thousand, a hundred thousand births; many eons of the world contracting, many eons of the world expanding, many eons of the world contracting and expanding. I remembered: ‘There, I was named this, my clan was that, I had this appearance, and that was my food. This was how I felt pleasure and displeasure, and that was how my life ended. When I departed from that place, I reappeared somewhere else. There, too, I was named this, my clan was that, I had this appearance, and that was my food. This was how I felt pleasure and displeasure, and that was how my life ended. When I departed from that place, I reappeared here.’ Thus, I recollected my many kinds of past lives, with features and details. ",
    "mn51:25.1": "When his mind has become composed like this—purified, bright, flawless, freed from defilements, pliable, workable, steady, and imperturbable—he extends it towards the knowledge of the passing away and reappearance of beings. ",
    "mn51:25.2": "With the divine eye that is purified and superhuman, he sees beings passing away and reappearing—inferior and superior, beautiful and ugly, in a good place or a bad place. He understands how beings reappear according to their actions. ‘These beings engaged in misconduct by way of body, speech, and thought. They found fault with the noble ones; they had wrong view; and they chose to act out of that wrong view. When their body breaks up, after death, they reappear in a place of loss, a bad place, the underworld, hell. These beings, however, engaged in good conduct by way of body, speech, and thought. They did not find fault with the noble ones; they had right view; and they chose to act out of that right view. When their body breaks up, after death, they reappear in a good place, a heavenly realm.’ And so, with the divine eye that is purified and superhuman, he sees beings passing away and reappearing—inferior and superior, beautiful and ugly, in a good place or a bad place. He understands how beings reappear according to their actions. ",
    "mn51:26.1": "When his mind has become composed like this—purified, bright, flawless, free from defilements, pliable, workable, steady, and imperturbable—he extends it towards the knowledge of the destruction of the influxes. ",
    "mn51:26.2": "He understands as it is: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering.’ ",
    "mn51:27.1": "He understands as it is: ‘These are influxes’ … ‘This is the origin of influxes’ … ‘This is the cessation of influxes’ … ‘This is the practice that leads to the cessation of influxes.’ ",
    "mn51:27.2": "Knowing and seeing like this, his mind is liberated from the influxes of sensuality, being, and ignorance. ",
    "mn51:27.3": "When it is liberated, he knows it is liberated. ",
    "mn51:27.4": "He understands: ‘Birth is destroyed, the renunciate life has been lived, what had to be done has been done, there will be no more of this.’ ",
    "mn51:28.1": "This is called an individual who neither mortifies themselves nor others, being committed to the practice of not mortifying themselves nor others. ",
    "mn51:28.2": "They live desireless right in the present experience, extinguished, cooled, feeling at ease, having themselves become divine. ",
    "mn51:28.3": "That is what the Auspicious One said. ",
    "mn51:28.4": "Pleased, the bhikkhus delighted in what the Auspicious One said. "
}