{
  "mn52:0.1": "Middle Discourses 52 ",
  "mn52:0.2": "The Wealthy Citizen ",
  "mn52:1.1": "So I have heard. ",
  "mn52:1.2": "At one time Venerable Ānanda was staying near Vesālī in the little village of Beluva. ",
  "mn52:1.3": "Now at that time the householder Dasama, a wealthy citizen, had arrived at Pāṭaliputta on some business. ",
  "mn52:2.1": "He went to the Chicken Monastery, approached a certain bhikkhu, bowed, sat down to one side, and said to him, ",
  "mn52:2.2": "“Bhante, where is Venerable Ānanda now staying? ",
  "mn52:2.3": "For I want to see him.” ",
  "mn52:2.4": "“Householder, Venerable Ānanda is staying near Vesālī in the little village of Beluva.” ",
  "mn52:3.1": "Then the householder Dasama, having concluded his business there, went to the little village of Beluva in Vesālī to see Ānanda. He bowed, sat down to one side, and said to Ānanda: ",
  "mn52:3.2": "“Venerable Ānanda, is there one thing that has been rightly explained by the Blessed One—who knows and sees, the Arahant, the fully awakened Buddha—practicing which a heedful, diligent and resolute bhikkhu’s mind is liberated, his influxes are destroyed, and he arrives at the supreme safety from the yoke?” ",
  "mn52:3.3": "“There is, householder.” ",
  "mn52:3.4": "“And what is that one thing?” ",
  "mn52:4.1": "“It’s when a bhikkhu, quite separated from sensuality, separated from detrimental phenomena, with thinking and with pondering, with joy and ease born of separation, abides having entered upon the first jhāna. ",
  "mn52:4.2": "He reflects: ",
  "mn52:4.3": "‘Even this first jhāna is produced and devised.’ ",
  "mn52:4.4": "He understands: ‘But whatever is produced and devised is impermanent and liable to cessation.’ ",
  "mn52:4.5": "Abiding in that, he attains  the destruction of the influxes. ",
  "mn52:4.6": "If he doesn’t attain the destruction of the influxes, with the destruction of the five lower fetters he reappears spontaneously, because of that passion and delight in the Dhamma. He is extinguished there, and is not liable to return from that world. ",
  "mn52:4.7": "This is one thing that has been rightly explained by the Blessed One—who knows and sees, the Arahant, the fully awakened Buddha—practicing which a heedful, diligent and resolute bhikkhu’s mind is liberated, his influxes are destroyed, and he arrives at the supreme safety from the yoke. ",
  "mn52:5.1": "Furthermore, with the appeasement of thinking and pondering, with internal confidence and collectedness of mind ... ",
  "mn52:5.2": "",
  "mn52:5.3": "",
  "mn52:5.4": "",
  "mn52:6.1": "third jhāna … ",
  "mn52:6.2": "",
  "mn52:6.3": "",
  "mn52:6.4": "",
  "mn52:7.1": "fourth jhāna … ",
  "mn52:7.2": "",
  "mn52:7.3": "",
  "mn52:7.4": "",
  "mn52:8.1": "Furthermore, a bhikkhu abides having pervaded with a mind of friendliness the first direction, likewise second, likewise third, likewise the fourth. In the same way above, below, across, everywhere, he abides having pervaded the whole world with a mind of friendliness—abundant, expansive, immeasurable, free of enmity and aversion. ",
  "mn52:8.2": "He reflects: ",
  "mn52:8.3": "‘Even this liberation of mind through friendliness is produced and devised.’ ",
  "mn52:8.4": "He understands: ‘But whatever is produced and devised is impermanent and liable to cessation.’ ... ",
  "mn52:8.5": "",
  "mn52:8.6": "",
  "mn52:9.1": "He abides having pervaded with a mind of compassion ... ",
  "mn52:10.1": "contentment … ",
  "mn52:11.1": "equanimity … ",
  "mn52:11.2": "",
  "mn52:11.3": "",
  "mn52:11.4": "",
  "mn52:11.5": "",
  "mn52:11.6": "",
  "mn52:12.1": "Furthermore, a bhikkhu, having fully surmounted perceptions of form, with the ending of perceptions of resistance, not attending to perceptions of diversity, aware that ‘space is infinite’, abides having entered upon the field of infinite space. ",
  "mn52:12.2": "He reflects: ",
  "mn52:12.3": "‘Even this attainment of the field of infinite space is produced, made by choices.’ ",
  "mn52:12.4": "He understands: ‘But whatever is produced and devised is impermanent and liable to cessation.’ ... ",
  "mn52:12.5": "",
  "mn52:12.6": "",
  "mn52:13.1": "Furthermore, a bhikkhu, having fully surmounted the field of infinite space, aware that ‘consciousness is infinite’, abides having entered upon the field of infinite consciousness. ... ",
  "mn52:13.2": "",
  "mn52:13.3": "",
  "mn52:13.4": "",
  "mn52:13.5": "",
  "mn52:13.6": "",
  "mn52:14.1": "Furthermore, a bhikkhu, having fully surmounted the field of infinite consciousness, aware that ‘there is nothing at all’, abides having entered upon the field of nothingness. ... ",
  "mn52:14.2": "He reflects: ",
  "mn52:14.3": "‘Even this attainment of the field of nothingness is produced and devised.’ ",
  "mn52:14.4": "He understands: ‘But whatever is produced and devised is impermanent and liable to cessation.’ ... ",
  "mn52:14.5": "Abiding in that, he attains  the destruction of the influxes. ",
  "mn52:14.6": "If he doesn’t attain the destruction of the influxes, with the destruction of the five lower fetters he reappears spontaneously, because of that passion and delight in the Dhamma. He is extinguished there, and is not liable to return from that world. ",
  "mn52:14.7": "This too is one thing that has been rightly explained by the Blessed One—who knows and sees, the Arahant, the fully awakened Buddha—practicing which a heedful, diligent and resolute bhikkhu’s mind is liberated, his influxes are destroyed, and he arrives at the supreme safety from the yoke. ",
  "mn52:15.1": "When he said this, the householder Dasama said to Venerable Ānanda, ",
  "mn52:15.2": "“Venerable Ānanda, suppose a person was looking for an entrance to a hidden treasure. And all at once they’d come across eleven entrances! ",
  "mn52:15.3": "In the same way, I was searching for the door to the Deathless. And all at once I found eleven doors to the Deathless for cultivation. ",
  "mn52:15.4": "Suppose a person had a house with eleven doors. If the house caught fire they’d be able to flee to safety through any one of those doors. ",
  "mn52:15.5": "In the same way, I’m able to flee to safety through any one of these eleven doors to the Deathless. ",
  "mn52:15.6": "Bhante, those of other religions seek a fee for the teacher. Why shouldn’t I make an offering to Venerable Ānanda?” ",
  "mn52:16.1": "Then the householder Dasama, having assembled the Saṅgha from Vesālī and Pāṭaliputta, served and satisfied them with his own hands with delicious fresh and cooked foods. ",
  "mn52:16.2": "He clothed each and every bhikkhu in a pair of garments, with a set of three robes for Ānanda. And he had a dwelling worth five hundred built for Ānanda. "
}