{
    "mn54:0.1": "Middle Discourses 54 ",
    "mn54:0.2": "With Potaliya the Householder ",
    "mn54:1.1": "So I have heard. ",
    "mn54:1.2": "At one time, the Auspicious One was staying in the land of the Aṅguttarāpans, near the town of theirs named Āpaṇa. ",
    "mn54:2.1": "Then the Auspicious One robed in the morning and, taking his bowl and robe, entered Āpaṇa for alms. ",
    "mn54:2.2": "He wandered for alms in Āpaṇa. After the meal, on his return from almsround, he went to a certain forest grove for the day’s abiding. ",
    "mn54:2.3": "Having plunged deep into it, he sat at the root of a certain tree for the day’s abiding. ",
    "mn54:3.1": "Potaliya the householder also approached that forest grove while taking a walk. He was well dressed in sarong and cloak, with parasol and sandals. Having plunged deep into it, he approached the Auspicious One, and exchanged pleasantries with him. ",
    "mn54:3.2": "When the amicable and cordial talk was over, he stood to one side, and the Auspicious One said to him, ",
    "mn54:3.3": "“There are seats, householder. Please sit if you wish.” ",
    "mn54:3.4": "When he said this, Potaliya was angry and upset. Thinking, “The ascetic Gotama addresses me as ‘householder’!” he stayed silent. ",
    "mn54:3.5": "For a second time … ",
    "mn54:3.6": "and a third time, the Auspicious One said to him, ",
    "mn54:3.7": "“There are seats, householder. Please sit if you wish.” ",
    "mn54:3.8": "When he said this, Potaliya was angry and upset. Thinking, “The ascetic Gotama addresses me as ‘householder’!” he said to the Auspicious One, ",
    "mn54:3.9": "“Master Gotama, it is neither proper nor appropriate for you to address me as ‘householder’.” ",
    "mn54:3.10": "“Well, householder, you have the features, attributes, and signs of a householder.” ",
    "mn54:3.11": "“Master Gotama, it is because I have refused all work and ceased all business.” ",
    "mn54:3.12": "“Householder, in what way have you refused all work and ceased all business?” ",
    "mn54:3.13": "“Master Gotama, all the money, grain, gold, and silver I used to have has been transferred to my children as their inheritance. And in this matter, I do not advise or reprimand them, but live with nothing more than food and clothes. ",
    "mn54:3.14": "That is how I have refused all work and cut off all business.” ",
    "mn54:3.15": "“The cutting off of business as you describe it, is one thing, householder, but the cutting off of business in the noble one’s discipline is quite different.” ",
    "mn54:3.16": "“But what, venerable sir, is cutting off of business in the noble one’s discipline? ",
    "mn54:3.17": "Venerable sir, please teach me this.” ",
    "mn54:3.18": "“Well then, householder, listen and apply your mind well, I will speak.” ",
    "mn54:3.19": "“Yes, venerable sir,” said Potaliya. ",
    "mn54:4.1": "The Auspicious One said this: ",
    "mn54:4.2": "“Householder, these eight things lead to the cutting off of business in the noble one’s discipline. ",
    "mn54:4.3": "What eight? ",
    "mn54:4.4": "Killing living creatures should be abandoned, relying on not killing living creatures. ",
    "mn54:4.5": "Taking what is not given should be abandoned, relying on not taking what is not given. ",
    "mn54:4.6": "Lying should be abandoned, relying on truthful speech. ",
    "mn54:4.7": "Divisive speech should be abandoned, relying on speech that is not divisive. ",
    "mn54:4.8": "Greed and covetousness should be abandoned, relying on not being greedy and covetous. ",
    "mn54:4.9": "Blaming and insulting should be abandoned, relying on not blaming and not insulting. ",
    "mn54:4.10": "Irritability and distress should be abandoned, relying on not being irritable and distressed. ",
    "mn54:4.11": "Arrogance should be abandoned, relying on not being arrogant. ",
    "mn54:4.12": "These are the eight things—stated in brief without being analyzed in detail—that lead to the cutting off of business in the noble one’s discipline.” ",
    "mn54:5.1": "“Venerable sir, please teach me these eight things in detail out of compassion.” ",
    "mn54:5.2": "“Well then, householder, listen and apply your mind well, I will speak.” ",
    "mn54:5.3": "“Yes, venerable sir,” said Potaliya. ",
    "mn54:5.4": "The Auspicious One said this: ",
    "mn54:6.1": "“‘Killing living creatures should be abandoned, relying on not killing living creatures.’ That is what I said, but why did I say it? ",
    "mn54:6.2": "It is when a noble disciple reflects: ",
    "mn54:6.3": "‘I am practicing to give up and sever the fetters that might cause me to kill living creatures. ",
    "mn54:6.4": "But if I were to kill living creatures, because of that, I would reprimand myself; wise men, after examination, would criticize me; and when my body perishes, after death, I could expect an bad destination. ",
    "mn54:6.5": "And killing living creatures is itself a fetter and a hindrance. ",
    "mn54:6.6": "For the influxes, trouble, and affliction that would arise because of killing living creatures are not present in an individual who does not kill living creatures.’ ",
    "mn54:6.7": "‘Killing living creatures should be abandoned, relying on not killing living creatures.’ ",
    "mn54:6.8": "That is what I said, and this is why I said it. ",
    "mn54:7.1": "‘Taking what is not given … ",
    "mn54:7.2": "",
    "mn54:7.3": "",
    "mn54:7.4": "",
    "mn54:7.5": "",
    "mn54:7.6": "",
    "mn54:7.7": "",
    "mn54:7.8": "",
    "mn54:8.1": "lying … ",
    "mn54:8.2": "",
    "mn54:8.3": "",
    "mn54:8.4": "",
    "mn54:8.5": "",
    "mn54:8.6": "",
    "mn54:8.7": "",
    "mn54:8.8": "",
    "mn54:9.1": "divisive speech … ",
    "mn54:9.2": "",
    "mn54:9.3": "",
    "mn54:9.4": "",
    "mn54:9.5": "",
    "mn54:9.6": "",
    "mn54:9.7": "",
    "mn54:9.8": "",
    "mn54:10.1": "greed and covetousness … ",
    "mn54:10.2": "",
    "mn54:10.3": "",
    "mn54:10.4": "",
    "mn54:10.5": "",
    "mn54:10.6": "",
    "mn54:10.7": "",
    "mn54:10.8": "",
    "mn54:11.1": "blaming and insulting … ",
    "mn54:11.2": "",
    "mn54:11.3": "",
    "mn54:11.4": "",
    "mn54:11.5": "",
    "mn54:11.6": "",
    "mn54:11.7": "",
    "mn54:11.8": "",
    "mn54:12.1": "irritability and distress … ",
    "mn54:12.2": "",
    "mn54:12.3": "",
    "mn54:12.4": "",
    "mn54:12.5": "",
    "mn54:12.6": "",
    "mn54:12.7": "",
    "mn54:12.8": "",
    "mn54:13.1": "Arrogance should be abandoned, relying on not being arrogant.’ That is what I said, but why did I say it? ",
    "mn54:13.2": "It is when a noble disciple reflects: ",
    "mn54:13.3": "‘I am practicing to give up and cut off the fetters that might cause me to be arrogant. ",
    "mn54:13.4": "But if I were to be arrogant, because of that, I would reprimand myself; wise men, after examination, would criticize me; and when my body decomposes, after death, I could expect a bad destination. ",
    "mn54:13.5": "And arrogance is itself a fetter and a hindrance. ",
    "mn54:13.6": "For the influxes, trouble, and affliction that would arise because of arrogance are not present in someone who is not arrogant.’ ",
    "mn54:13.7": "‘Arrogance should be abandoned by not being arrogant.’ ",
    "mn54:13.8": "That is what I said, and this is why I said it. ",
    "mn54:14.1": "These are the eight things—stated in brief and analyzed in detail—that lead to the cutting off of business in the noble one’s discipline. ",
    "mn54:14.2": "But just this much does not constitute the cutting off of business in each and every respect in the noble one’s discipline.” ",
    "mn54:14.3": "“But, venerable sir, how is there the cutting off of business in each and every respect in the noble one’s discipline? ",
    "mn54:14.4": "Venerable sir, please teach me this.” ",
    "mn54:14.5": "“In that case, householder, listen and apply your mind well, I will speak.” ",
    "mn54:14.6": "“Yes, venerable sir,” said Potaliya. ",
    "mn54:14.7": "The Auspicious One said this: ",
    "mn54:15.0": "1. The Perils of Sensuality ",
    "mn54:15.1": "“Householder, suppose a dog weak with hunger was loitering near a butcher’s shop. ",
    "mn54:15.2": "Then a deft butcher or their apprentice would cast them a skeleton scraped clean of flesh and smeared in blood. ",
    "mn54:15.3": "What do you think, householder? ",
    "mn54:15.4": "Gnawing on such a fleshless skeleton, would that dog still satisfy its hunger?” ",
    "mn54:15.5": "“No, venerable sir. ",
    "mn54:15.6": "Why not? ",
    "mn54:15.7": "Because that skeleton is scraped clean of flesh and smeared in blood. ",
    "mn54:15.8": "That dog will eventually become weary and frustrated.” ",
    "mn54:15.9": "“In the same way, a noble disciple reflects: ",
    "mn54:15.10": "‘With the simile of a skeleton, the Auspicious One said that sensuality gives little gratification and much suffering and distress, and the peril there is what is greater.’ ",
    "mn54:15.11": "Having seen this as it is with right understanding, they reject equanimity based on multiplicity and develop the equanimity based on unity, where all kinds of grasping at worldly pleasures ceases without remainder. ",
    "mn54:16.1": "Suppose a vulture or a crow or a hawk was to seize a scrap of meat and fly away. ",
    "mn54:16.2": "Other vultures, crows, and hawks would continue pursuing it, pecking and clawing. ",
    "mn54:16.3": "What do you think, householder? ",
    "mn54:16.4": "If that vulture, crow, or hawk does not quickly release that scrap of meat, would not that result in death or deadly suffering for them?” ",
    "mn54:16.5": "“Yes, venerable sir.” … ",
    "mn54:16.6": "",
    "mn54:16.7": "",
    "mn54:16.8": "",
    "mn54:17.1": "“Suppose a man carrying a blazing grass torch was to walk against the wind. ",
    "mn54:17.2": "What do you think, householder? ",
    "mn54:17.3": "If that man does not quickly release that blazing grass torch, would not he burn his hands or arm or other limb, resulting in death or deadly suffering for him?” ",
    "mn54:17.4": "“Yes, venerable sir.” … ",
    "mn54:17.5": "",
    "mn54:17.6": "",
    "mn54:17.7": "",
    "mn54:18.1": "“Suppose there was a pit of glowing coals deeper than a man’s height, full of glowing coals that neither flamed nor smoked. ",
    "mn54:18.2": "Then a man would arrive who wants to live and does not want to die, who wants to be happy and recoils from pain. ",
    "mn54:18.3": "Then two strong men would seize him by the arms and drag him towards the pit of glowing coals. ",
    "mn54:18.4": "What do you think, householder? ",
    "mn54:18.5": "Would not that man writhe and struggle to and fro?” ",
    "mn54:18.6": "“Yes, venerable sir. ",
    "mn54:18.7": "Why is that? ",
    "mn54:18.8": "For that man knows: ‘If I fall into that pit of glowing coals, that would result in my death or deadly suffering.’” … ",
    "mn54:18.9": "",
    "mn54:18.10": "",
    "mn54:18.11": "",
    "mn54:19.1": "“Suppose a person was to see delightful parks, woods, meadows, and lotus ponds in a dream. ",
    "mn54:19.2": "But when they woke, they could not see them at all. … ",
    "mn54:19.3": "",
    "mn54:19.4": "",
    "mn54:19.5": "",
    "mn54:20.1": "Suppose a man had borrowed some goods—a gentleman’s carriage and fine jewelled earrings— ",
    "mn54:20.2": "and preceded and surrounded by these, he proceeded through the middle of Āpaṇa. ",
    "mn54:20.3": "When people saw him, they would say: ",
    "mn54:20.4": "‘This must be a wealthy man! For that is how the wealthy enjoy their wealth.’ ",
    "mn54:20.5": "But when the owners saw him, they would reclaim what was theirs. ",
    "mn54:20.6": "What do you think? Would that be enough for that man to be distressed?” ",
    "mn54:20.7": "“Yes, venerable sir. ",
    "mn54:20.8": "Why is that? ",
    "mn54:20.9": "Because the owners reclaimed what was theirs.” … ",
    "mn54:20.10": "",
    "mn54:20.11": "",
    "mn54:20.12": "",
    "mn54:21.1": "“Suppose there was a dense forest grove not far from a town or village. ",
    "mn54:21.2": "And there was a tree laden with fruit, yet none of the fruit had fallen to the ground. ",
    "mn54:21.3": "And along came a man in need of fruit, wandering in search of fruit. ",
    "mn54:21.4": "Having plunged deep into that forest grove, he would see that tree laden with fruit. ",
    "mn54:21.5": "He would think: ",
    "mn54:21.6": "‘That tree is laden with fruit, yet none of the fruit has fallen to the ground. ",
    "mn54:21.7": "But I know how to climb a tree. ",
    "mn54:21.8": "Why don’t I climb the tree, eat as much as I like, then fill my pouch?’ ",
    "mn54:21.9": "And that is what he would do. ",
    "mn54:21.10": "And along would come a second man in need of fruit, wandering in search of fruit, carrying a sharp axe. ",
    "mn54:21.11": "Having plunged deep into that forest grove, he would see that tree laden with fruit. ",
    "mn54:21.12": "He would think: ",
    "mn54:21.13": "‘That tree is laden with fruit, yet none of the fruit has fallen to the ground. ",
    "mn54:21.14": "But I do not know how to climb a tree. ",
    "mn54:21.15": "Why don’t I fell this tree at the root, eat as much as I like, then fill my pouch?’ ",
    "mn54:21.16": "And so, he would fell the tree at the root. ",
    "mn54:21.17": "What do you think, householder? ",
    "mn54:21.18": "If the first man who climbed the tree does not quickly come down, when that tree fell, would he not break his hand, arm, or other limb, resulting in death or deadly suffering for him?” ",
    "mn54:21.19": "“Yes, venerable sir.” ",
    "mn54:21.20": "“In the same way, a noble disciple reflects: ",
    "mn54:21.21": "‘With the simile of the fruit tree, the Auspicious One said that sensuality gives little gratification and much suffering and distress, and the peril there is what is greater.’ ",
    "mn54:21.22": "Having seen this as it is with right understanding, they reject equanimity based on multiplicity and develop the equanimity based on unity, where all kinds of grasping at worldly pleasures ceases without remainder. ",
    "mn54:22.1": "Relying on this supreme purity of remembrance and equanimity, that noble disciple recollects their many kinds of past lives. ",
    "mn54:22.2": "That is: one, two, three, four, five, ten, twenty, thirty, forty, fifty, a hundred, a thousand, a hundred thousand births; many eons of the world contracting, many eons of the world expanding, many eons of the world contracting and expanding. … They recollect their many kinds of past lives, with features and details. ",
    "mn54:23.1": "Relying on this supreme purity of remembrance and equanimity, that noble disciple, with the divine eye that is purified and superhuman, sees beings passing away and reappearing—inferior and superior, beautiful and ugly, in a good place or a bad place. … They understand how beings are reborn according to their actions. ",
    "mn54:24.1": "Relying on this supreme purity of remembrance and equanimity, that noble disciple abides having entered upon the liberation by mind and liberation by understanding that is devoid of influxes, having for themselves comprehended and realized it right in the present experience. ",
    "mn54:25.1": "That is how there is the cutting off of business in each and every respect in the noble one’s discipline. ",
    "mn54:25.2": "What do you think, householder? ",
    "mn54:25.3": "Do you regard yourself as having cut off business in a way comparable to the cutting off of business in each and every respect in the noble one’s discipline?” ",
    "mn54:25.4": "“Who am I compared to one who has cut off business in each and every respect in the noble one’s discipline? ",
    "mn54:25.5": "I am far from that. ",
    "mn54:25.6": "Venerable sir, I used to think that the wanderers following other teachings were thoroughbreds, and I fed them and treated them accordingly, but they were not actually thoroughbreds. ",
    "mn54:25.7": "I thought that the bhikkhus were not thoroughbreds, and I fed them and treated them accordingly, but they actually were thoroughbreds. ",
    "mn54:25.8": "But now, I shall understand that the wanderers following other teachings are not in fact thoroughbreds, and I will feed them and treat them accordingly. ",
    "mn54:25.9": "And I shall understand that the bhikkhus actually are thoroughbreds, and I will feed them and treat them accordingly. ",
    "mn54:25.10": "The Auspicious One has inspired me to have fondness, confidence, and respect for ascetics! ",
    "mn54:26.1": "Excellent, venerable sir! Excellent! ",
    "mn54:26.2": "As if he were righting the overturned, or revealing the hidden, or pointing out the path to the lost, or lighting a lamp in the dark so people with clear eyes can see what is there, the Auspicious One has made the teaching clear in many ways. ",
    "mn54:26.3": "I go for refuge to the Auspicious One, to the Dhamma, and to the Saṅgha of bhikkhus. ",
    "mn54:26.4": "From this day forth, may the Auspicious One remember me as a lay follower who has gone for refuge for life.” "
}