{
  "mn55:0.1": "Middle Discourses 55 ",
  "mn55:0.2": "With Jīvaka ",
  "mn55:1.1": "So I have heard. ",
  "mn55:1.2": "At one time, the Buddha was staying near Rājagaha in the Mango Grove of Jīvaka Komārabhacca. ",
  "mn55:2.1": "Then Jīvaka approached the Buddha, bowed, sat down to one side, and said to the Buddha: ",
  "mn55:3.1": "“Venerable sir, I have heard this: ",
  "mn55:3.2": "‘They slaughter living creatures specially for the ascetic Gotama. The ascetic Gotama knowingly eats meat prepared on his behalf: this is a deed he caused.’ ",
  "mn55:3.3": "Venerable sir, do those who say this repeat what the Buddha has said, and do not misrepresent him with an untruth? Is their explanation in line with the Dhamma, without there being any legitimate grounds for rebuke and criticism?” ",
  "mn55:4.1": "“Jīvaka, those who say this do not repeat what I have said. They misrepresent me with what is false and untrue. ",
  "mn55:5.1": "In three cases, I say that meat may not be eaten: ",
  "mn55:5.2": "it is seen, heard, or suspected. ",
  "mn55:5.3": "These are three cases in which meat may not be eaten. ",
  "mn55:5.4": "In three cases, I say that meat may be eaten: ",
  "mn55:5.5": "it is not seen, heard, or suspected. ",
  "mn55:5.6": "These are three cases in which meat may be eaten. ",
  "mn55:6.1": "Take the case of a bhikkhu living supported by a town or village. ",
  "mn55:6.2": "He abides having pervaded with a mind of friendliness the first direction, likewise second, likewise third, likewise the fourth. In the same way, above, below, across, everywhere, he abides having pervaded the whole world with a mind of friendliness—abundant, expansive, immeasurable, free of enmity and ill will. ",
  "mn55:6.3": "A householder or his son approaches and invites him for the next day’s meal. ",
  "mn55:6.4": "The bhikkhu accepts if he wishes. ",
  "mn55:6.5": "When the night has passed, he dons his robes in the morning, takes his bowl and robe, and approaches that householder’s home, where he sits on the seat spread out. ",
  "mn55:6.6": "That householder or his son serves him with fine almsfood. ",
  "mn55:6.7": "It never occurs to him, ",
  "mn55:6.8": "‘It is so good that this householder serves me with fine almsfood! ",
  "mn55:6.9": "I hope he serves me with such fine almsfood in the future!’ ",
  "mn55:6.10": "He does not think that. ",
  "mn55:6.11": "He eats that almsfood without being tied, infatuated, or entangled, seeing the peril, and understanding the escape. ",
  "mn55:6.12": "What do you think, Jīvaka? ",
  "mn55:6.13": "At that time, is that bhikkhu intending for his own affliction, for that of others, or for that of both?” ",
  "mn55:6.14": "“No, venerable sir.” ",
  "mn55:6.15": "“Is he not eating blameless food at that time?” ",
  "mn55:7.1": "“Yes, venerable sir. ",
  "mn55:7.2": "Venerable sir, I have heard that ",
  "mn55:7.3": "Brahmā abides in friendliness. ",
  "mn55:7.4": "But here, I see the Auspicious One with my own eyes. ",
  "mn55:7.5": "For the Auspicious One abides in friendliness.” ",
  "mn55:7.6": "“Jīvaka, any passion, any aversion, and any confusion whereby ill will might arise in him, the Tathāgata has abandoned, cut off at the roots, made like a palm-stump, eliminated so that it is no longer liable to future arising. ",
  "mn55:7.7": "If that is what you were referring to, I acknowledge it.” ",
  "mn55:7.8": "“That is exactly what I was referring to.” ",
  "mn55:8-10.1": "“Take the case, Jīvaka, of a bhikkhu living supported by a town or village. ",
  "mn55:8-10.2": "He abides having pervaded with a mind of compassion … ",
  "mn55:8-10.3": "He abides having pervaded with a mind of contentment … ",
  "mn55:8-10.4": "He abides having pervaded with a mind of equanimity, the first direction, likewise the second, likewise the third, likewise the fourth. ",
  "mn55:8-10.5": "In the same way, above, below, across, everywhere, he abides having pervaded the whole world with a mind of equanimity—abundant, expansive, immeasurable, free of enmity and ill will. ",
  "mn55:8-10.6": "A householder or his son approaches and invites him for the next day’s meal. ",
  "mn55:8-10.7": "The bhikkhu accepts if he wants. ",
  "mn55:8-10.8": "When the night has passed, he dons his robes in the morning, takes his bowl and robe, and approaches that householder’s home, where he sits on the seat spread out. ",
  "mn55:8-10.9": "That householder or his son serves him with fine almsfood. ",
  "mn55:8-10.10": "It never occurs to him, ",
  "mn55:8-10.11": "‘It is excellent that this householder serves me with fine almsfood! ",
  "mn55:8-10.12": "I hope he serves me with such fine almsfood in the future!’ ",
  "mn55:8-10.13": "He does not think that. ",
  "mn55:8-10.14": "He eats that almsfood without being tied, infatuated, or entangled, seeing the peril, and understanding the escape. ",
  "mn55:8-10.15": "What do you think, Jīvaka? ",
  "mn55:8-10.16": "At that time, is that bhikkhu intending for his own affliction, for that of others, or for that of both?” ",
  "mn55:8-10.17": "“No, venerable sir.” ",
  "mn55:8-10.18": "“Isn’t he eating blameless food at that time?” ",
  "mn55:11.1": "“Yes, venerable sir. ",
  "mn55:11.2": "Venerable sir, I have heard that ",
  "mn55:11.3": "Brahmā abides in equanimity. ",
  "mn55:11.4": "But here I see the Auspicious One with my own eyes. ",
  "mn55:11.5": "For the Auspicious One abides in equanimity.” ",
  "mn55:11.6": "“Jīvaka, any passion, any aversion, and any muddledness whereby annoyance, discontent, or resistance might arise in him, the Tathāgata has abandoned, cut off at the roots, made like a palm-stump, eliminated so that it is no longer liable to future arising. ",
  "mn55:11.7": "If that is what you were referring to, I acknowledge it.” ",
  "mn55:11.8": "“That is exactly what I was referring to.” ",
  "mn55:12.1": "“Jīvaka, anyone who slaughters a living creature specially for the Realized One or a Realized One’s disciple creates great wickedness in five instances. ",
  "mn55:12.2": "When they say: ",
  "mn55:12.3": "‘Go, fetch that living creature,’ this is the first instance. ",
  "mn55:12.4": "When that living creature experiences pain and sadness as it is led along by a collar, this is the second instance. ",
  "mn55:12.5": "When they say: ",
  "mn55:12.6": "‘Go, slaughter that living creature,’ this is the third instance. ",
  "mn55:12.7": "When that living creature experiences pain and displeasure as it is being slaughtered, this is the fourth instance. ",
  "mn55:12.8": "When they serve the Realized One or a Realized One’s disciple with unallowable food, this is the fifth instance. ",
  "mn55:12.9": "Anyone who slaughters a living creature specially for the Realized One or a Realized One’s disciple creates much wickedness in five instances.” ",
  "mn55:13.1": "When he had spoken, Jīvaka said to the Buddha: ",
  "mn55:13.2": "“It is remarkable, venerable sir, it is extraordinary! ",
  "mn55:13.3": "The bhikkhus indeed eat allowable food. ",
  "mn55:13.4": "The bhikkhus indeed eat blameless food. ",
  "mn55:13.5": "Excellent, venerable sir! Excellent! … ",
  "mn55:13.6": "From this day forth, may the Buddha remember me as a lay follower who has gone for refuge for life.” "
}