{
    "mn57:0.1": "Middle Discourses 57 ",
    "mn57:0.2": "The Ascetic Who Behaved Like a Dog ",
    "mn57:1.1": "So, I have heard. ",
    "mn57:1.2": "At one time, the Auspicious One was staying in the land of the Koliyans, where they have a town named Haliddavasana. ",
    "mn57:2.1": "Then Puṇṇa the Koliyan, a cow votary, and the naked ascetic Seniya, a dog votary, went to see the Auspicious One. Puṇṇa bowed to the Auspicious One and sat down to one side, while Seniya exchanged pleasantries and polite conversation with him before sitting down to one side curled up like a dog. ",
    "mn57:2.2": "Puṇṇa said to the Auspicious One, ",
    "mn57:2.3": "“Venerable sir, this naked ascetic Seniya is a dog votary, one who does what is difficult. He eats food placed on the ground. ",
    "mn57:2.4": "For a long time, he has undertaken that dog observance. ",
    "mn57:2.5": "What will be his destination? What will be his future?” ",
    "mn57:2.6": "“Enough, Puṇṇa, let it be. Don not ask me that.” ",
    "mn57:2.7": "For a second time, … ",
    "mn57:2.8": "and a third time, Puṇṇa said to the Auspicious One, ",
    "mn57:2.9": "“Venerable sir, this naked ascetic Seniya is a dog votary, one who does what is difficult. He eats food placed on the ground. ",
    "mn57:2.10": "For a long time, he has undertaken that dog observance. ",
    "mn57:2.11": "What will be his destination? What will be his future?” ",
    "mn57:2.12": "“Clearly, Puṇṇa, I am not making myself understood to you when I say: ",
    "mn57:2.13": "‘Enough, Puṇṇa, let it be. Do not ask me that.’ ",
    "mn57:2.14": "Nevertheless, I will answer you. ",
    "mn57:3.1": "Take someone who develops the dog observance fully and uninterruptedly. They develop a dog’s virtue, a dog’s mentality, and a dog’s behavior fully and uninterruptedly. ",
    "mn57:3.2": "On the dissolution of the body, after death, they reappear in fellowship with dogs. ",
    "mn57:3.3": "But, if they have such a view: ‘By this precept or observance or fervent austerity or renunciate life, I will become one of the gods!’ This is wrong view on their part. ",
    "mn57:3.4": "One with wrong view reappears in one of two places, I say, hell or the animal realm. ",
    "mn57:3.5": "So, if the dog observance succeeds, it leads to fellowship with dogs. But if it fails, it leads to hell.” ",
    "mn57:4.1": "When he said this, the naked ascetic Seniya, who was a dog votary, cried and burst out in tears. ",
    "mn57:4.2": "The Auspicious One said to Puṇṇa, ",
    "mn57:4.3": "“This is what I failed to convey to you when I said: ",
    "mn57:4.4": "‘Enough, Puṇṇa, let it be. Do not ask me that.’” ",
    "mn57:4.5": "Seniya said, “Venerable sir, I am not crying because of what the Auspicious One said. ",
    "mn57:4.6": "But, venerable sir, for a long time, I have undertaken this dog observance. ",
    "mn57:4.7": "Venerable sir, this Puṇṇa the Koliyan is a cow votary. ",
    "mn57:4.8": "For a long time, he has undertaken that cow observance. ",
    "mn57:4.9": "What will be his destination? What will be his future?” ",
    "mn57:4.10": "“Enough, Seniya, let it be. Do not ask me that.” ",
    "mn57:4.11": "For a second time, … ",
    "mn57:4.12": "and a third time, Seniya said to the Auspicious One, ",
    "mn57:4.13": "“Venerable sir, this Puṇṇa the Koliyan is a cow votary. ",
    "mn57:4.14": "For a long time, he has undertaken that cow observance. ",
    "mn57:4.15": "What will be his destination? What will be his future?” ",
    "mn57:4.16": "“Clearly, Seniya, I am not making myself understood to you when I say: ",
    "mn57:4.17": "‘Enough, Seniya, let it be. Do not ask me that.’ ",
    "mn57:4.18": "Nevertheless, I will answer you. ",
    "mn57:5.1": "Take someone who develops the cow observance fully and uninterruptedly. They develop a cow’s virtue, a cow’s mentality, and a cow’s behavior fully and uninterruptedly. ",
    "mn57:5.2": "On the dissolution of the body, after death, they reappear in fellowship with cows. ",
    "mn57:5.3": "But if they have such a view: ‘By this precept or observance or fervent austerity or renunciate life, I will become one of the gods!’ This is wrong view on their part. ",
    "mn57:5.4": "One with wrong view reappears in one of two places, I say: hell or the animal realm. ",
    "mn57:5.5": "So, if the cow observance succeeds, it leads to fellowship with cows. But if it fails, it leads to hell.” ",
    "mn57:6.1": "When this was said, Puṇṇa the Koliyan who was a cow votary cried and broke into tears. ",
    "mn57:6.2": "The Auspicious One said to Seniya, ",
    "mn57:6.3": "“This is what I failed to convey to you when I said: ",
    "mn57:6.4": "‘Enough, Seniya, let it be. Do not ask me that.’” ",
    "mn57:6.5": "Puṇṇa said, “Venerable sir, I am not crying because of what the Auspicious One said. ",
    "mn57:6.6": "But, venerable sir, for a long time, I have undertaken this cow observance. ",
    "mn57:6.7": "I am quite confident that the Auspicious One ",
    "mn57:6.8": "is capable of teaching me so that I can give up this cow observance, and the naked ascetic Seniya can give up that dog observance.” ",
    "mn57:6.9": "“Well then, Puṇṇa, listen and apply your mind well, I will speak.” ",
    "mn57:6.10": "“Yes, venerable sir,” he replied. ",
    "mn57:6.11": "The Auspicious One said this: ",
    "mn57:7.1": "“Puṇṇa, I declare these four kinds of action, having for myself comprehended and experienced them. ",
    "mn57:7.2": "Which four? ",
    "mn57:7.3": "There is dark action with dark results; ",
    "mn57:7.4": "bright action with bright results; ",
    "mn57:7.5": "dark-and-bright action with dark-and-bright results; and ",
    "mn57:7.6": "neither-dark-nor-bright action with neither-dark-nor-bright results, which leads to the destruction of action. ",
    "mn57:8.1": "And what is dark action with dark results? ",
    "mn57:8.2": "It is when someone makes afflictive bodily, verbal, and mental choices. ",
    "mn57:8.3": "Having made these choices, they reappear in an afflictive world ",
    "mn57:8.4": "where they are touched by afflictive contacts. ",
    "mn57:8.5": "Touched by afflictive contacts, they feel afflictive feelings that are exclusively unpleasant—like the beings in hell. ",
    "mn57:8.6": "This is how what is arises from what was. ",
    "mn57:8.7": "For one reappears according to one’s actions, ",
    "mn57:8.8": "and contacts touch one who has reappeared. ",
    "mn57:8.9": "This is why I say that beings are heirs of their actions. ",
    "mn57:8.10": "These is called dark action with dark results. ",
    "mn57:9.1": "And what is bright action with bright results? ",
    "mn57:9.2": "It is when someone makes benign bodily, verbal, and mental choices. ",
    "mn57:9.3": "Having made these choices, they reappear in a benign world ",
    "mn57:9.4": "where they are touched by benign contacts. ",
    "mn57:9.5": "Touched by benign contacts, they feel benign feelings that are exclusively pleasant—like the gods replete with glory. ",
    "mn57:9.6": "This is how what is arises from what was. ",
    "mn57:9.7": "For one reappears according to one’s actions, ",
    "mn57:9.8": "and contacts touch one who has reappeared. ",
    "mn57:9.9": "This is why I say that beings are heirs of their actions. ",
    "mn57:9.10": "This is called bright action with bright results. ",
    "mn57:10.1": "And what is dark-and-bright action with dark-and-bright results? ",
    "mn57:10.2": "It is when someone makes both afflictive and benign choices by way of body, speech, and thought. ",
    "mn57:10.3": "Having made these choices, they are reborn in a world that is both afflictive and benign ",
    "mn57:10.4": "where they are touched by both afflictive and benign contacts. ",
    "mn57:10.5": "Touched by both afflictive and benign contacts, they feel both afflictive and benign feelings that are a mixture of pleasure and displeasure—like humans, some gods, and some beings in the underworld. ",
    "mn57:10.6": "This is how what is arises from what was. ",
    "mn57:10.7": "For one reappears according to one’s actions, ",
    "mn57:10.8": "and contacts touch one who has reappeared. ",
    "mn57:10.9": "This is why I say that beings are heirs of their actions. ",
    "mn57:10.10": "These is called dark-and-bright action with dark-and-bright results. ",
    "mn57:11.1": "And what is neither-dark-nor-bright action with neither-dark-nor-bright results, which leads to the destruction of action? ",
    "mn57:11.2": "It is the intention to give up dark action with dark results, bright action with bright results, and dark-and-bright action with dark-and-bright results. ",
    "mn57:11.3": "This is called neither-dark-nor-bright action with neither-dark-nor-bright results, which leads to the destruction of action. ",
    "mn57:11.4": "Puṇṇa, these are the four kinds of action I declare, having for myself comprehended and experienced them.” ",
    "mn57:12.1": "When this was said, Puṇṇa the Koliyan who was a cow votary said to the Auspicious One, ",
    "mn57:12.2": "“Excellent, venerable sir! Excellent! … ",
    "mn57:12.3": "",
    "mn57:12.4": "From this day forth, may the Auspicious One remember me as a lay follower who has gone for refuge for life.” ",
    "mn57:13.1": "And Seniya the naked ascetic who was a dog votary said to the Auspicious One, ",
    "mn57:13.2": "“Excellent, venerable sir! Excellent! … ",
    "mn57:13.3": "",
    "mn57:13.4": "I go for refuge to the Auspicious One, to the Dhamma, and to the Saṅgha of bhikkhus. ",
    "mn57:13.5": "Venerable sir, may I receive the going forth, the ordination in the Auspicious One’s presence?” ",
    "mn57:14.1": "“Seniya, if someone formerly ordained in another sect wishes to take the going forth, the ordination in this teaching-and-discipline, they must spend four months on probation. When four months have passed, if the bhikkhus are satisfied, they will give the going forth, the ordination into bhikkhuhood. ",
    "mn57:14.2": "However, I have recognized individual differences in this matter.” ",
    "mn57:14.3": "“Venerable sir, if four months probation are required in such a case, I will spend four years on probation. When four years have passed, if the bhikkhus are satisfied, let them give me the going forth, the ordination into bhikkhuhood.” ",
    "mn57:15.1": "And the naked ascetic Seniya who was a dog votary received the going forth, the ordination in the Auspicious One’s presence. ",
    "mn57:15.2": "Not long after his ordination, Venerable Seniya, abiding alone, withdrawn, heedful, diligent, and resolute, lived having entered upon the supreme goal of the renunciate life for which sons of good families rightly go forth from the lay life to homelessness, having for himself comprehended and realized it right in the present experience. ",
    "mn57:15.3": "He understood: “Birth is destroyed; the renunciate life has been lived; what had to be done has been done; there will be no more of this.” ",
    "mn57:15.4": "And Venerable Seniya became one of the Arahants. "
}