{
  "mn59:0.1": "Middle Discourses 59 ",
  "mn59:0.2": "The Many Kinds of Feeling ",
  "mn59:1.1": "So I have heard. ",
  "mn59:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
  "mn59:1.3": "Then the chamberlain Pañcakaṅga went up to Venerable Udāyī, bowed, sat down to one side, and said to him, ",
  "mn59:1.4": "“Bhante, how many feelings has the Buddha spoken of?” ",
  "mn59:1.5": "“Chamberlain, the Buddha has spoken of three feelings: ",
  "mn59:1.6": "pleasant, unpleasant, and neither-pleasant-nor-unpleasant. ",
  "mn59:1.7": "The Buddha has spoken of these three feelings.” ",
  "mn59:1.8": "When he said this, Pañcakaṅga said to Venerable Udāyī, ",
  "mn59:1.9": "“Bhante Udāyī, the Buddha hasn’t spoken of three feelings. ",
  "mn59:1.10": "He’s spoken of two feelings: ",
  "mn59:1.11": "pleasant and unpleasant. ",
  "mn59:1.12": "The Buddha said that neither-pleasant-nor-unpleasant feeling is a peaceful and refined kind of pleasure.” ",
  "mn59:2.1": "For a second time, Venerable Udāyī said to Pañcakaṅga, ",
  "mn59:2.2": "“The Buddha hasn’t spoken of two feelings, ",
  "mn59:2.3": "he’s spoken of three.” ",
  "mn59:2.4": "",
  "mn59:2.5": "",
  "mn59:2.6": "For a second time, Pañcakaṅga said to Venerable Udāyī, ",
  "mn59:2.7": "“The Buddha hasn’t spoken of three feelings, ",
  "mn59:2.8": "he’s spoken of two.” ",
  "mn59:2.9": "",
  "mn59:2.10": "",
  "mn59:3.1": "And for a third time, Venerable Udāyī said to Pañcakaṅga, ",
  "mn59:3.2": "“The Buddha hasn’t spoken of two feelings, ",
  "mn59:3.3": "he’s spoken of three.” ",
  "mn59:3.4": "",
  "mn59:3.5": "",
  "mn59:3.6": "And for a third time, Pañcakaṅga said to Venerable Udāyī, ",
  "mn59:3.7": "“The Buddha hasn’t spoken of three feelings, ",
  "mn59:3.8": "he’s spoken of two.” ",
  "mn59:3.9": "",
  "mn59:3.10": "",
  "mn59:3.11": "But neither was able to persuade the other. ",
  "mn59:4.1": "Venerable Ānanda heard this discussion between Venerable Udāyī and Pañcakaṅga. ",
  "mn59:4.2": "Then he went up to the Buddha, bowed, sat down to one side, ",
  "mn59:4.3": "and informed the Buddha of all they had discussed. ",
  "mn59:4.4": "When he had spoken, the Buddha said to him, ",
  "mn59:5.1": "“Ānanda, the explanation by the bhikkhu Udāyī, which the chamberlain Pañcakaṅga didn’t agree with, was quite correct. But the explanation by Pañcakaṅga, which Udāyī didn’t agree with, was also quite correct. ",
  "mn59:5.2": "In one explanation I’ve spoken of two feelings. In another explanation I’ve spoken of three feelings, or five, six, eighteen, thirty-six, or a hundred and eight feelings. ",
  "mn59:5.3": "I’ve explained the teaching in all these different ways. ",
  "mn59:5.4": "This being so, you can expect that those who don’t concede, approve, or agree with what has been well spoken will argue, quarrel, and fight, continually wounding each other with barbed words. ",
  "mn59:5.5": "I’ve explained the teaching in all these different ways. ",
  "mn59:5.6": "This being so, you can expect that those who do concede, approve, or agree with what has been well spoken will live in harmony, appreciating each other, without quarreling, blending like milk and water, and regarding each other with kindly eyes. ",
  "mn59:6.1": "There are these five kinds of sensual stimulation. ",
  "mn59:6.2": "What five? ",
  "mn59:6.3": "Sights cognizable by the eye that are likable, desirable, agreeable, pleasing, connected with sensuality, and enticing. ",
  "mn59:6.4": "Sounds known by the ear … ",
  "mn59:6.5": "Smells known by the nose … ",
  "mn59:6.6": "Tastes known by the tongue … ",
  "mn59:6.7": "Touches cognizable by the body that are likable, desirable, agreeable, pleasing, connected with sensuality, and enticing. ",
  "mn59:6.8": "These are the five strands of sensuality. ",
  "mn59:6.9": "The pleasure and joy that arise from these five strands of sensuality is called the pleasure of sensuality. ",
  "mn59:7.1": "There are those who would say that this is the highest pleasure and joy that sentient beings experience. But I don’t grant them that. ",
  "mn59:7.2": "Why is that? ",
  "mn59:7.3": "Because there is another pleasure that is finer than that. ",
  "mn59:7.4": "And what is that pleasure? ",
  "mn59:7.5": "It’s when a bhikkhu, quite disjoined from sensuality, disjoined from detrimental phenomena, with thinking and with pondering, with joy and pleasure born of separation, he abides having entered upon the first jhāna. ",
  "mn59:7.6": "This is a pleasure that is finer than that. ",
  "mn59:8.1": "There are those who would say that this is the highest pleasure and joy that sentient beings experience. But I don’t grant them that. ",
  "mn59:8.2": "Why is that? ",
  "mn59:8.3": "Because there is another pleasure that is finer than that. ",
  "mn59:8.4": "And what is that pleasure? ",
  "mn59:8.5": "It’s when, with the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and pleasure born of composure, he abides having entered upon second jhāna. ",
  "mn59:8.6": "",
  "mn59:9.1": "",
  "mn59:9.2": "There is another pleasure that is finer than that. ",
  "mn59:9.3": "And what is that pleasure? ",
  "mn59:9.4": "It’s when, with the fading of joy, a bhikkhu abides equanimous, recollected, and aware, experiencing pleasure with the body. He abides having entered upon the third jhāna, with regard to which the noble ones say “one abides equanimous, recollected, and at ease.” ",
  "mn59:9.5": "",
  "mn59:10.1": "",
  "mn59:10.2": "There is another pleasure that is finer than that. ",
  "mn59:10.3": "And what is that pleasure? ",
  "mn59:10.4": "It’s when, with the giving up of pleasure and displeasure—and with the ending of joys and upsets beforehand—without pleasure or displeasure, with purity of equanimity and recollection, a bhikkhu abides having entered upon the fourth jhāna. ",
  "mn59:10.5": "",
  "mn59:11.1": "",
  "mn59:11.2": "There is another pleasure that is finer than that. ",
  "mn59:11.3": "And what is that pleasure? ",
  "mn59:11.4": "It’s when a bhikkhu, having fully surmounted perceptions of form, with the ending of perceptions of resistance, not attending to perceptions of diversity, aware that ‘space is infinite’, abides having entered upon the extent of infinite space. ",
  "mn59:11.5": "",
  "mn59:12.1": "",
  "mn59:12.2": "There is another pleasure that is finer than that. ",
  "mn59:12.3": "And what is that pleasure? ",
  "mn59:12.4": "It’s when a bhikkhu, having fully surmounted the field of\n infinite space, aware that ‘consciousness is infinite’, abides having \nentered upon the extent of infinite consciousness.  … ",
  "mn59:12.5": "",
  "mn59:13.1": "",
  "mn59:13.2": "There is another pleasure that is finer than that. ",
  "mn59:13.3": "And what is that pleasure? ",
  "mn59:13.4": "It’s when a bhikkhu, having fully surmounted the field of\n infinite consciousness, aware that ‘there is nothing’, abide having \nentered upon the extent of nothingness.  … ",
  "mn59:13.5": "",
  "mn59:14.1": "",
  "mn59:14.2": "There is another pleasure that is finer than that. ",
  "mn59:14.3": "And what is that pleasure? ",
  "mn59:14.4": "It’s when a bhikkhu, having fully surmounted the field of\n nothingness, abides having entered upon the extent of neither \nperception nor non-perception. ",
  "mn59:14.5": "This is a pleasure that is finer than that. ",
  "mn59:15.1": "There are those who would say that this is the highest pleasure and joy that sentient beings experience. But I don’t grant them that. ",
  "mn59:15.2": "Why is that? ",
  "mn59:15.3": "Because there is another pleasure that is finer than that. ",
  "mn59:15.4": "And what is that pleasure? ",
  "mn59:15.5": "It’s when a bhikkhu, having fully surmounted the extent of neither-perception-nor-non-perception, abides having entered upon the cessation of  perception-and-feeling. ",
  "mn59:15.6": "This is a pleasure that is finer than that. ",
  "mn59:16.1": "It’s possible that wanderers of other religions might say, ",
  "mn59:16.2": "‘The ascetic Gotama spoke of the cessation of perception-and-feeling, and he defines it as a kind of pleasure. ",
  "mn59:16.3": "Why is that? How can that be?’ ",
  "mn59:16.4": "When wanderers of other religions say this, you should say to them, ",
  "mn59:16.5": "‘Friends, the Buddha does not define only pleasant feeling as pleasure. ",
  "mn59:16.6": "Wherever pleasure can be found and in whichever way, the Realized One defines that as a kind of pleasure.’” ",
  "mn59:16.7": "That is what the Buddha said. ",
  "mn59:16.8": "Pleased, Venerable Ānanda delighted in what the Buddha said. "
}