{
    "mn5:0.1": "Middle Discourses 5 ",
    "mn5:0.2": "Unblemished ",
    "mn5:1.1": "Thus have I heard. ",
    "mn5:1.2": "At one time, the Auspicious One was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
    "mn5:1.3": "There Venerable Sāriputta addressed the bhikkhus: ",
    "mn5:1.4": "“Venerable bhikkhus!” ",
    "mn5:1.5": "“Venerable,” they replied. ",
    "mn5:1.6": "Venerable Sāriputta said this: ",
    "mn5:2.1": "“Venerables, these four individuals are found in the world. ",
    "mn5:2.2": "What four? ",
    "mn5:2.3": "One individual with a blemish does not understand as it is: ‘There is a blemish in me.’ ",
    "mn5:2.4": "But another individual with a blemish does understand as it is: ‘There is a blemish in me.’ ",
    "mn5:2.5": "One individual without a blemish does not understand as it is: ‘There is no blemish in me.’ ",
    "mn5:2.6": "But another individual without a blemish does understand as it is: ‘There is no blemish in me.’ ",
    "mn5:2.7": "In this case, of the two individuals with a blemish, the one who does not understand is said to be worse, ",
    "mn5:2.8": "while the one who does understand is better. ",
    "mn5:2.9": "And of the two individuals without a blemish, the one who does not understand is said to be worse, ",
    "mn5:2.10": "while the one who does understand is better.” ",
    "mn5:3.1": "When he said this, Venerable Mahāmoggallāna said to him: ",
    "mn5:3.2": "“What is the cause, Venerable Sāriputta, what is the reason why, of the two persons with a blemish, one is said to be worse and one better? ",
    "mn5:3.3": "And what is the cause, what is the reason why, of the two persons without a blemish, one is said to be worse and one better?” ",
    "mn5:4.1": "“Venerable, take the case of the individual who has a blemish and does not understand it. You can expect that he will not generate desire, strive, or make an effort to abandon that blemish. ",
    "mn5:4.2": "And he will die with passion, aversion, and muddledness, blemished, with a defiled mind. ",
    "mn5:4.3": "Suppose a bronze dish was brought from a shop or smithy, covered with dirt or stains. ",
    "mn5:4.4": "And the owners neither used it or had it cleaned, but kept it in a dirty place. ",
    "mn5:4.5": "Over time, will not that bronze dish become even dirtier and more stained?” ",
    "mn5:4.6": "“Yes, venerable.” ",
    "mn5:4.7": "“In the same way, take the case of the individual who has a blemish and does not understand it. You can expect that … ",
    "mn5:4.8": "he will die with a defiled mind. ",
    "mn5:5.1": "Take the case of the individual who has a blemish and does understand it. You can expect that he will generate desire, strive, and make an effort to abandon that blemish. ",
    "mn5:5.2": "And he will die without passion, aversion, and muddledness, unblemished, with an undefiled mind. ",
    "mn5:5.3": "Suppose a bronze dish was brought from a shop or smithy covered with dirt or stains. ",
    "mn5:5.4": "But the owners used it and had it cleaned, and did not keep it in a dirty place. ",
    "mn5:5.5": "Over time, will not that bronze dish get cleaner and brighter?” ",
    "mn5:5.6": "“Yes, venerable.” ",
    "mn5:5.7": "“In the same way, take the case of the individual who has a blemish and does understand it. You can expect that … ",
    "mn5:5.8": "he will die with an undefiled mind. ",
    "mn5:6.1": "Take the case of the individual who does not have a blemish, but does not understand it. You can expect that he will apply his mind to the significance of beauty, and because of that, passion will infect his mind. ",
    "mn5:6.2": "And he will die with passion, aversion, and muddledness, blemished, with a defiled mind. ",
    "mn5:6.3": "Suppose a bronze dish was brought from a shop or smithy clean and bright. ",
    "mn5:6.4": "And the owners neither used it or had it cleaned, but kept it in a dirty place. ",
    "mn5:6.5": "Over time, would that bronze dish not become more soiled and stained?” ",
    "mn5:6.6": "“Yes, venerable.” ",
    "mn5:6.7": "“In the same way, take the case of the individual who has no blemish and does not understand it. You can expect that … ",
    "mn5:6.8": "he will die with a defiled mind. ",
    "mn5:7.1": "Take the case of the individual who does not have a blemish and does understand it. You can expect that he will not apply his mind to the sign of beauty, and because of that, passion will not infect his mind. ",
    "mn5:7.2": "And he will die without passion, aversion, and muddledness, unblemished, with an undefiled mind. ",
    "mn5:7.3": "Suppose a bronze dish was brought from a shop or smithy, clean and bright. ",
    "mn5:7.4": "And the owners used it and had it cleaned, and did not keep it in a dirty place. ",
    "mn5:7.5": "Over time, would not that bronze dish become cleaner and brighter?” ",
    "mn5:7.6": "“Yes, venerable.” ",
    "mn5:7.7": "“In the same way, take the case of the individual who does not have a blemish and does understand it. You can expect that … ",
    "mn5:7.8": "he will die with an undefiled mind. ",
    "mn5:8.1": "This is the cause, this is the reason why, of the two persons with a blemish, one is said to be worse and one better. ",
    "mn5:8.2": "And this is the cause, this is the reason why, of the two persons without a blemish, one is said to be worse and one better.” ",
    "mn5:9.1": "“Venerable, the word ‘blemish’ is spoken of. ",
    "mn5:9.2": "But what is ‘blemish’ a term for?” ",
    "mn5:9.3": "“Venerable, ‘blemish’ is a term for the spheres of bad, unbeneficial wishes. ",
    "mn5:10.1": "It is possible that some bhikkhu might wish: ",
    "mn5:10.2": "‘If I commit an offense, I hope the bhikkhus do not find out!’ ",
    "mn5:10.3": "But it is possible that the bhikkhus do find out that that bhikkhu ",
    "mn5:10.4": "has committed an offense. ",
    "mn5:10.5": "Thinking, ‘The bhikkhus have discovered about my offense,’ ",
    "mn5:10.6": "he becomes angry and bitter. ",
    "mn5:10.7": "That anger and that bitterness ",
    "mn5:10.8": "are both blemishes. ",
    "mn5:11.1": "It is possible that some bhikkhu might wish: ",
    "mn5:11.2": "‘If I commit an offense, I wish the bhikkhus accuse me in private, not before the Saṅgha.’ ",
    "mn5:11.3": "But it is possible that the bhikkhus do accuse that bhikkhu before the Saṅgha … ",
    "mn5:11.4": " ",
    "mn5:11.5": " ",
    "mn5:11.6": " ",
    "mn5:11.7": " ",
    "mn5:12.1": "It is possible that some bhikkhu might wish: ",
    "mn5:12.2": "‘If I commit an offense, I hope I am accused by an equal, not by someone who is not an equal.’ ",
    "mn5:12.3": "But it is possible that someone who is not an equal accuses that bhikkhu … ",
    "mn5:12.4": " ",
    "mn5:12.5": " ",
    "mn5:12.6": " ",
    "mn5:12.7": " ",
    "mn5:13.1": "It is possible that some bhikkhu might wish: ",
    "mn5:13.2": "‘Oh, I hope the Teacher will teach the bhikkhus by repeatedly questioning me alone, not some other bhikkhu.’ ",
    "mn5:13.3": "But it is possible that the Teacher will teach the bhikkhus by repeatedly questioning some other bhikkhu … ",
    "mn5:13.4": " ",
    "mn5:13.5": " ",
    "mn5:13.6": " ",
    "mn5:13.7": " ",
    "mn5:14.1": "It is possible that some bhikkhu might wish: ",
    "mn5:14.2": "‘Oh, I hope the bhikkhus will enter the village for the meal putting me at the very front, not some other bhikkhu.’ ",
    "mn5:14.3": "But it is possible that the bhikkhus will enter the village for the meal putting some other bhikkhu at the very front … ",
    "mn5:14.4": " ",
    "mn5:14.5": " ",
    "mn5:14.6": " ",
    "mn5:14.7": " ",
    "mn5:15.1": "It is possible that some bhikkhu might wish: ",
    "mn5:15.2": "‘Oh, I hope that I alone get the best seat, the best drink, and the best almsfood in the refectory, not some other bhikkhu.’ ",
    "mn5:15.3": "But it is possible that some other bhikkhu receives the best seat, the best drink, and the best almsfood in the refectory … ",
    "mn5:15.4": " ",
    "mn5:15.5": " ",
    "mn5:15.6": " ",
    "mn5:15.7": " ",
    "mn5:16.1": "It is possible that some bhikkhu might wish: ",
    "mn5:16.2": "‘I hope that I alone give the appreciation after the meal in the refectory, not some other bhikkhu.’ ",
    "mn5:16.3": "But it is possible that some other bhikkhu gives the appreciation after the meal in the refectory … ",
    "mn5:16.4": " ",
    "mn5:16.5": " ",
    "mn5:16.6": " ",
    "mn5:16.7": " ",
    "mn5:17.1": "It is possible that some bhikkhu might wish: ",
    "mn5:17.2": "‘Oh, I hope that I might teach the Dhamma to the bhikkhus, nuns, laymen, and laywomen in the monastery, not some other bhikkhu.’ ",
    "mn5:17.3": " ",
    "mn5:17.4": " ",
    "mn5:17.5": " ",
    "mn5:17.6": " ",
    "mn5:17.7": " ",
    "mn5:18-20.1": " ",
    "mn5:18-20.2": " ",
    "mn5:18-20.3": " ",
    "mn5:18-20.4": " ",
    "mn5:18-20.5": "But it is possible that some other bhikkhu teaches the Dhamma … ",
    "mn5:18-20.6": " ",
    "mn5:18-20.7": " ",
    "mn5:18-20.8": " ",
    "mn5:18-20.9": " ",
    "mn5:21.1": "It is possible that some bhikkhu might wish: ",
    "mn5:21.2": "‘Oh, I hope that the bhikkhus, nuns, laymen, and laywomen will honor, respect, revere, and venerate me alone, not some other bhikkhu.’ ",
    "mn5:21.3": " ",
    "mn5:21.4": " ",
    "mn5:21.5": " ",
    "mn5:21.6": " ",
    "mn5:21.7": " ",
    "mn5:22-24.1": " ",
    "mn5:22-24.2": " ",
    "mn5:22-24.3": " ",
    "mn5:22-24.4": " ",
    "mn5:22-24.5": "But it is possible that some other bhikkhu is honored, respected, revered, and venerated … ",
    "mn5:22-24.6": " ",
    "mn5:22-24.7": " ",
    "mn5:22-24.8": " ",
    "mn5:22-24.9": " ",
    "mn5:25.1": "It is possible that some bhikkhu might wish: ",
    "mn5:25.2": "‘I hope I get the nicest robes, almsfood, lodgings, and medicines and supplies for the sick, not some other bhikkhu.’ ",
    "mn5:25.3": "But it is possible that some other bhikkhu gets the nicest robes, almsfood, lodgings, and medicines and supplies for the sick … ",
    "mn5:25.4": " ",
    "mn5:25.5": " ",
    "mn5:25.6": " ",
    "mn5:25.7": " ",
    "mn5:26-27.1": " ",
    "mn5:26-27.2": " ",
    "mn5:26-27.3": " ",
    "mn5:26-27.4": " ",
    "mn5:26-27.5": " ",
    "mn5:26-27.6": "Thinking, ‘Some other bhikkhu has the nicest robes, almsfood, lodgings, and medicines and supplies for the sick’, ",
    "mn5:26-27.7": "he becomes angry and bitter. ",
    "mn5:26-27.8": "And that anger and that bitterness ",
    "mn5:26-27.9": "are both blemishes. ",
    "mn5:28.1": "‘Blemish’ is a term for these spheres of bad, unbeneficial wishes. ",
    "mn5:29.1": "Suppose these spheres of bad, unbeneficial wishes are seen and heard to be not abandoned by a bhikkhu. Even though he lives in the wilderness, in remote lodgings, eats only almsfood, wanders indiscriminately for almsfood, wears rag robes, and wears shabby robes, his fellow renunciates do not honor, respect, revere, and venerate him. ",
    "mn5:29.2": "Why is that? ",
    "mn5:29.3": "It is because these spheres of bad, unbeneficial wishes are seen and heard to be not abandoned by that venerable. ",
    "mn5:29.4": "Suppose a bronze dish was brought from a shop or smithy, clean and bright. ",
    "mn5:29.5": "Then the owners were to prepare it with the carcass of a snake, a dog, or a human, cover it with a bronze lid, and parade it through the market-place. ",
    "mn5:29.6": "When people saw it, they would say: ",
    "mn5:29.7": "‘What is it that you are carrying like a precious treasure?’ ",
    "mn5:29.8": "So, they would open the lid for people to look inside. ",
    "mn5:29.9": "But as soon as they saw it, they would be filled with loathing, revulsion, and disgust. ",
    "mn5:29.10": "Not even those who were hungry would want to eat it, let alone those who had eaten. ",
    "mn5:29.11": "In the same way, when these spheres of bad, unbeneficial wishes are seen and heard to be not abandoned by a bhikkhu … his fellow renunciates do not honor, respect, revere, and venerate him. ",
    "mn5:29.12": "Why is that? ",
    "mn5:29.13": "It is because these spheres of bad, unbeneficial wishes are seen and heard to be not abandoned by that venerable. ",
    "mn5:30.1": "Suppose these spheres of bad, unbeneficial wishes are seen and heard to be abandoned by a bhikkhu. Even though he lives within a village, accepts invitations to a meal, and wears robes offered by householders, his fellow renunciates honor, respect, revere, and venerate him. ",
    "mn5:30.2": "Why is that? ",
    "mn5:30.3": "It is because these spheres of bad, unbeneficial wishes are seen and heard to be abandoned by that venerable. ",
    "mn5:30.4": "Suppose a bronze dish was brought from a shop or smithy, clean and bright. ",
    "mn5:30.5": "Then the owners were to prepare it with boiled fine rice with the dark grains picked out and served with many soups and sauces, cover it with a bronze lid, and parade it through the market-place. ",
    "mn5:30.6": "When people saw it, they would say: ",
    "mn5:30.7": "‘What is it that you are carrying like a precious treasure?’ ",
    "mn5:30.8": "So, they would open the lid for people to look inside. ",
    "mn5:30.9": "And as soon as they saw it, they would be filled with liking, attraction, and relish. ",
    "mn5:30.10": "Even those who had eaten would want to eat it, let alone those who were hungry. ",
    "mn5:30.11": "In the same way, when these spheres of bad, unbeneficial wishes are seen and heard to be abandoned by a bhikkhu … his fellow renunciates honor, respect, revere, and venerate him. ",
    "mn5:30.12": "Why is that? ",
    "mn5:30.13": "It is because these spheres of bad, unbeneficial wishes are seen and heard to be abandoned by that venerable.” ",
    "mn5:31.1": "When he said this, Venerable Mahāmoggallāna said to him, ",
    "mn5:31.2": "“Venerable Sāriputta, a simile springs to mind.” ",
    "mn5:31.3": "“Then speak as you feel inspired,” said Venerable Sāriputta. ",
    "mn5:31.4": "“Venerable, at one time I was staying right here in Rājagaha, at the Hill Fort. ",
    "mn5:31.5": "Then I donned my robes in the morning and, taking my bowl and robe, entered Rājagaha for alms. ",
    "mn5:31.6": "Now at that time, Samīti of the wainwrights was planing the rim of a chariot wheel. ",
    "mn5:31.7": "The Ājīvaka ascetic Paṇḍuputta, who was formerly of the wainwrights, was standing by, ",
    "mn5:31.8": "and this thought came to his mind: ",
    "mn5:31.9": "‘Oh, I hope Samīti the wainwright planes out the crooks, bends, and flaws in this rim. Then the rim will be rid of crooks, bends, and flaws, pure and established in the pith.’ ",
    "mn5:31.10": "And Samīti planed out the flaws in the rim just as Paṇḍuputta thought. ",
    "mn5:31.11": "Then Paṇḍuputta expressed his gladness: ",
    "mn5:31.12": "‘He planes like he knows my heart with his heart!’ ",
    "mn5:32.1": "In the same way, there are those faithless individuals who went forth from the lay life to homelessness not out of faith but to earn a livelihood. They are devious, deceitful, and furtive. They are restless, insolent, fickle, scurrilous, and indiscreet. They do not guard their sense doors or eat in moderation, and they are not dedicated to vigilance. They do not concern themselves with the ascetic life, and do not keenly respect the training. They are indulgent and negligent, leaders in backsliding, neglecting seclusion, indolent, and lacking effort. They are forgetful, lacking awareness and composure, with straying minds, witless and foolish. Venerable Sāriputta planes their faults with this exposition of the Dhamma as if he knows my heart with his heart! ",
    "mn5:32.2": "But there are those sons of good families who went forth from the lay life to homelessness out of faith. They are not devious, deceitful, and furtive. They are not restless, insolent, fickle, scurrilous, and indiscreet. They guard their sense doors and eat in moderation, and they are dedicated to vigilance. They concern themselves with the ascetic life, and keenly respect the training. They are not indulgent or negligent; they neglect backsliding and are leaders in seclusion. They are effortful and resolute. Their recollectedness is established, and they are aware and composed, with unified minds; possessing understanding, not foolish. Hearing this exposition of the Dhamma from Venerable Sāriputta, they drink it and ingest it, as it were. And in speech and thought they say: ",
    "mn5:32.3": "‘It is good, sirs, that he draws his fellow renunciates away from the unbeneficial and establishes them in the beneficial.’ ",
    "mn5:33.1": "Suppose there was a woman or man who was young, youthful, and fond of adornments, and had bathed their head. Presented with a garland of lotuses, jasmine, or liana flowers, they would take them in both hands and place them on the crown of the head. ",
    "mn5:33.2": "In the same way, those sons of good families who went forth from the lay life to homelessness out of faith … say: ",
    "mn5:33.3": "‘It is good, sirs, that he diverts his fellow renunciates from the unbeneficial and establishes them in the beneficial.’” ",
    "mn5:33.4": "And so these two spiritual giants appreciated each other’s fine words. "
}
