{
    "mn6:0.1": "Middle Discourses 6 ",
    "mn6:0.2": "One Might Wish ",
    "mn6:1.1": "So I have heard. ",
    "mn6:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
    "mn6:1.3": "There the Buddha addressed the bhikkhus, ",
    "mn6:1.4": "“Bhikkhus!” ",
    "mn6:1.5": "“Bhante,” they replied. ",
    "mn6:1.6": "The Buddha said this: ",
    "mn6:2.1": "“Bhikkhus, live fulfilling virtue and the training rules. Live restrained by the code of conduct, endowed with proper behavior and a suitable environment. Seeing danger in the slightest fault, train in the training rules. ",
    "mn6:3.1": "A bhikkhu might wish: ‘May I be liked and approved by my fellow renunciates, respected and admired.’ So let him fulfill the precepts, be committed to internal appeasement of mind, not neglect jhāna, be endowed with insight, and frequent empty dwellings. ",
    "mn6:4.1": "A bhikkhu might wish: ‘May I receive robes, almsfood, lodgings, and medicines and supplies for the sick.’ So let him fulfill the precepts, be committed to internal appeasement of mind, not neglect jhāna, be endowed with insight, and frequent empty dwellings. ",
    "mn6:5.1": "A bhikkhu might wish: ‘May the services of those whose robes, almsfood, lodgings, and medicines and supplies for the sick I enjoy be very fruitful and favorable for them.’ So let him fulfill the precepts … ",
    "mn6:6.1": "A bhikkhu might wish: ‘When deceased family and relatives who have passed away recollect me with a confident mind, may this be very fruitful and favorable for them.’ So let him fulfill the precepts … ",
    "mn6:7.1": "A bhikkhu might wish: ‘May I prevail over desire and discontent, and may desire and discontent not prevail over me. May I live having conquered desire and discontent whenever they arose.’ So let him fulfill the precepts … ",
    "mn6:8.1": "A bhikkhu might wish: ‘May I prevail over fear and dread, and may fear and dread not prevail over me. May I live having conquered fear and dread whenever they arose.’ So let him fulfill the precepts … ",
    "mn6:9.1": "A bhikkhu might wish: ‘May I get the four jhānas—easeful dwellings in the present experience that involve an elevated mind—when I want, without trouble or difficulty.’ So let him fulfill the precepts … ",
    "mn6:10.1": "A bhikkhu might wish: ‘May I experience with the body the peaceful liberations that are formless, transcending form.’ So let him fulfill the precepts … ",
    "mn6:11.1": "A bhikkhu might wish: ‘May I, with the exhaustion of three fetters, become a stream-enterer, not liable to the underworld, bound for awakening.’ So let him fulfill the precepts … ",
    "mn6:12.1": "A bhikkhu might wish: ‘May I, with the exhaustion of three fetters, and the weakening of passion, aversion, and muddledness, become a once-returner, coming back to this world once only, then making an end of suffering.’ So let him fulfill the precepts … ",
    "mn6:13.1": "A bhikkhu might wish: ‘May I, with the exhaustion of the five lower fetters, reappear spontaneously and become extinguished there, not liable to return from that world.’ So let him fulfill the precepts … ",
    "mn6:14.1": "A bhikkhu might wish: ‘May I wield the many kinds of psychic power: multiplying myself and becoming one again; appearing and disappearing; going unimpeded through a wall, a rampart, or a mountain as if through space; diving in and out of the earth as if it were water; walking on water as if it were earth; flying cross-legged through the sky like a bird; touching and stroking with my hand the sun and moon, so mighty and powerful; controlling the body as far as the Brahmā realm.’ So let him fulfill the precepts … ",
    "mn6:15.1": "A bhikkhu might wish: ‘With clairaudience that is purified and superhuman, may I hear both kinds of sounds, human and divine, whether near or far.’ So let him fulfill the precepts … ",
    "mn6:16.1": "A bhikkhu might wish: ‘May I understand the minds of other beings and individuals, having comprehended them with my mind. ",
    "mn6:16.2": "May I understand mind with passion as “mind with passion”, ",
    "mn6:16.3": "and mind without passion as “mind without passion”; ",
    "mn6:16.4": "mind with aversion as “mind with aversion”, ",
    "mn6:16.5": "and mind without aversion as “mind without aversion”; ",
    "mn6:16.6": "mind with muddledness as “mind with muddledness”, ",
    "mn6:16.7": "and mind without muddledness as “mind without muddledness”; ",
    "mn6:16.8": "constricted mind as “constricted mind”, ",
    "mn6:16.9": "and scattered mind as “scattered mind”; ",
    "mn6:16.10": "expansive mind as “expansive mind”, ",
    "mn6:16.11": "and unexpansive mind as “unexpansive mind”; ",
    "mn6:16.12": "mind that is not supreme as “mind that is not supreme”, ",
    "mn6:16.13": "and mind that is supreme as “mind that is supreme”; ",
    "mn6:16.14": "mind composed as “mind composed”, ",
    "mn6:16.15": "and mind not composed as “mind not composed”; ",
    "mn6:16.16": "liberated mind as “liberated mind”, ",
    "mn6:16.17": "and unliberated mind as “unliberated mind”.’ ",
    "mn6:16.18": "So let him fulfill the precepts … ",
    "mn6:17.1": "A bhikkhu might wish: ‘May I recollect many kinds of past lives. That is: one, two, three, four, five, ten, twenty, thirty, forty, fifty, a hundred, a thousand, a hundred thousand births; many eons of the world contracting, many eons of the world expanding, many eons of the world contracting and expanding. May I remember: “There, I was named this, my clan was that, I looked like this, and that was my food. This was how I felt pleasure and displeasure, and that was how my life ended. When I passed away from that place, I reappeared somewhere else. There, too, I was named this, my clan was that, I looked like this, and that was my food. This was how I felt pleasure and displeasure, and that was how my life ended. When I passed away from that place I reappeared here.” May I thus recollect my many kinds of past lives, with features and details.’ ",
    "mn6:17.2": "So let him fulfill the precepts … ",
    "mn6:18.1": "A bhikkhu might wish: ‘With the divine eye that is purified and superhuman, may I see beings passing away and reappearing—inferior and superior, beautiful and ugly, in a good place or a bad place—and understand how beings reappear according to their actions: “These dear beings engaged in misconduct by way of body, speech, and mind. They found fault with the noble ones; they had wrong view; and they chose to act out of that wrong view. When their body breaks up, after death, they reappear in a place of loss, a bad place, the underworld, hell. These dear beings, however, did good things by way of body, speech, and mind. They did not find fault with the noble ones; they had right view; and they chose to act out of that right view. When their body breaks up, after death, they reappear in a good place, a heavenly realm.” And so, with the divine eye that is purified and superhuman, may I see beings passing away and reappearing—inferior and superior, beautiful and ugly, in a good place or a bad place. And may I understand how beings reappear according to their actions.’ ",
    "mn6:18.2": "So let him fulfill the precepts … ",
    "mn6:19.1": "A bhikkhu might wish: ‘May I, with the exhaustion of the influxes, dwell having entered upon the liberation by mind and liberation by understanding that is devoid of influxes, having personally comprehended and realized it right in the present experience.’ ",
    "mn6:19.2": "So let him fulfill the precepts, be committed to internal appeasement of mind, not neglect jhāna, be endowed with insight, and frequent empty dwellings. ",
    "mn6:20.1": "‘Bhikkhus, live fulfilling virtue and the training rules. Live restrained by the code of conduct, endowed with proper behavior and a suitable environment. Seeing danger in the slightest fault, train in the training rules.’ ",
    "mn6:20.2": "That’s what I said, and this is why I said it.” ",
    "mn6:20.3": "That is what the Buddha said. ",
    "mn6:20.4": "Pleased, the bhikkhus delighted in what the Buddha said. "
}