{
    "mn62:0.1": "Middle Discourses 62 ",
    "mn62:0.2": "The Longer Advice to Venerable Rāhula ",
    "mn62:1.1": "Thus have I heard. ",
    "mn62:1.2": "At one time, the Auspicious One was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
    "mn62:2.1": "Then the Auspicious One dressed in the morning and, taking his bowl and robe, entered Sāvatthī for alms. ",
    "mn62:2.2": "And Venerable Rāhula also dressed and followed behind the Auspicious One. ",
    "mn62:3.1": "Then the Auspicious One looked back at Venerable Rāhula and said, ",
    "mn62:3.2": "“Rāhula, you should see any kind of form at all—past, future, or present; internal or external; coarse or fine; inferior or superior; far or near: all form—as it is with right understanding: ‘This is not mine, I am not this, this is not my self.’” ",
    "mn62:3.3": "“Only form, Auspicious One? Only form, Excellent One?” ",
    "mn62:3.4": "“Form, Rāhula, as well as feeling and perception and activations and consciousness.” ",
    "mn62:4.1": "Then Venerable Rāhula thought, “Who would go to the village for alms today after being advised directly by the Auspicious One?” Turning back, he sat down cross-legged at the root of a certain tree, setting his body straight, and establishing remembrance at the fore. ",
    "mn62:5.1": "Venerable Sāriputta saw him sitting there, ",
    "mn62:5.2": "and addressed him, ",
    "mn62:5.3": "“Rāhula, develop the remembrance of breathing. ",
    "mn62:5.4": "When the remembrance of breathing is developed and cultivated, it is very fruitful and beneficial.” ",
    "mn62:6.1": "Then, in the late afternoon, Venerable Rāhula emerged from retreat, went to the Auspicious One, bowed, sat down to one side, and said to him: ",
    "mn62:7.1": "“Venerable sir, how is the remembrance of breathing developed and cultivated to be very fruitful and beneficial?” ",
    "mn62:8.1": "“Rāhula, anything internal and pertaining to oneself that is hard, solid, and appropriated—this includes: ",
    "mn62:8.2": "head hair, body hair, nails, teeth, skin, flesh, sinews, bones, bone marrow, kidneys, heart, liver, diaphragm, spleen, lungs, intestines, mesentery, undigested food, feces, or anything else internal and pertaining to oneself that is hard, solid, and appropriated. ",
    "mn62:8.3": "This is called the internal earth element. ",
    "mn62:8.4": "Both the internal earth element and the external earth element are simply the earth element. ",
    "mn62:8.5": "This should be seen as it is with right understanding: ‘This is not mine, I am not this, this is not my self.’ ",
    "mn62:8.6": "Having seen as it is with right understanding, one grows disenchanted with the earth element; one rids the mind of passion for the earth element. ",
    "mn62:9.1": "And what is the water element? ",
    "mn62:9.2": "The water element may be internal or external. ",
    "mn62:9.3": "And what is the internal water element? ",
    "mn62:9.4": "Anything internal and pertaining to oneself that is water, watery, and appropriated. This includes: ",
    "mn62:9.5": "bile, phlegm, pus, blood, sweat, fat, tears, grease, saliva, nasal mucus, synovial fluid, urine, or anything else internal and pertaining to oneself that is water, watery, and appropriated. ",
    "mn62:9.6": "This is called the internal water element. ",
    "mn62:9.7": "Both the internal water element and the external water element are simply the water element. ",
    "mn62:9.8": "This should be seen as it is with right understanding: ‘This is not mine, I am not this, this is not my self.’ ",
    "mn62:9.9": "Having seen as it is with right understanding, he grows disenchanted with the water element; he rids the mind of passion for the water element. ",
    "mn62:10.1": "And what is the fire element? ",
    "mn62:10.2": "The fire element may be internal or external. ",
    "mn62:10.3": "And what is the internal fire element? ",
    "mn62:10.4": "Anything internal and pertaining to oneself that is fire, fiery, and appropriated. This includes: ",
    "mn62:10.5": "that which warms, that which ages, that which heats you when feverish, that which properly digests food and drink, or anything else internal and pertaining to oneself that is fire, fiery, and appropriated. ",
    "mn62:10.6": "This is called the internal fire element. ",
    "mn62:10.7": "Both the internal fire element and the external fire element are simply the fire element. ",
    "mn62:10.8": "This should be seen as it is with right understanding: ‘This is not mine, I am not this, this is not my self.’ ",
    "mn62:10.9": "Having seen as it is with right understanding, he grows disenchanted with the fire element; he rids the mind of passion for the fire element. ",
    "mn62:11.1": "And what is the air element? ",
    "mn62:11.2": "The air element may be internal or external. ",
    "mn62:11.3": "And what is the internal air element? ",
    "mn62:11.4": "Anything internal and pertaining to oneself that is air, airy, and appropriated. This includes: ",
    "mn62:11.5": "winds that go up or down, winds in the belly or the bowels, winds that flow through the limbs, in-breaths and out-breaths, or anything else internal and pertaining to oneself that is air, airy, and appropriated. ",
    "mn62:11.6": "This is called the internal air element. ",
    "mn62:11.7": "Both the internal air element and the external air element are simply the air element. ",
    "mn62:11.8": "This should be seen as it is with right understanding: ‘This is not mine, I am not this, this is not my self.’ ",
    "mn62:11.9": "Having seen as it is with right understanding, he grows disenchanted with the air element; he makes the mind dispassionate for the air element. ",
    "mn62:12.1": "And what is the space element? ",
    "mn62:12.2": "The space element may be internal or external. ",
    "mn62:12.3": "And what is the internal space element? ",
    "mn62:12.4": "Anything internal and pertaining to oneself that is space, spacious, and appropriated. This includes: ",
    "mn62:12.5": "the ear canals, nostrils, and mouth, the space for swallowing what is eaten and drunk, the space where it stays, the space for excreting it from the nether regions, or anything else internal and pertaining to oneself that is space, spacious, and appropriated. ",
    "mn62:12.6": "This is called the internal space element. ",
    "mn62:12.7": "Both the internal space element and the external space element are simply the space element. ",
    "mn62:12.8": "This should be seen as it is with right understanding, like this: ‘This is not mine, I am not this, this is not my self.’ ",
    "mn62:12.9": "Having seen as it is with right understanding, he grows disenchanted with the space element; he rids the mind of passion for the space element. ",
    "mn62:13.1": "Rāhula, develop [your mind] like earth. ",
    "mn62:13.2": "For when you develop [your mind] like earth, arisen agreeable and disagreeable pressures will not occupy your mind. ",
    "mn62:13.3": "Suppose they were to toss both clean and unclean things on the earth, like feces, urine, spit, pus, and blood. The earth isn’t horrified, repelled, and disgusted because of this. ",
    "mn62:13.4": "In the same way, develop [your mind] like earth. ",
    "mn62:13.5": "For when you develop [your mind] like the earth, arisen agreeable and disagreeable pressures will not endure with a grip on your mind. ",
    "mn62:14.1": "Develop [your mind] like water. ",
    "mn62:14.2": "For when you develop [your mind] like water, arisen agreeable and disagreeable pressures will not occupy your mind. ",
    "mn62:14.3": "Suppose they were to wash both clean and unclean things in the water, like feces, urine, spit, pus, and blood. The water is not horrified, repelled, and disgusted because of this. ",
    "mn62:14.4": "In the same way, develop [your mind] like water. ",
    "mn62:14.5": "For when you develop [your mind] like water, arisen agreeable and disagreeable pressures will not endure with a grip on your mind. ",
    "mn62:15.1": "Develop [your mind] like fire. ",
    "mn62:15.2": "For when you develop [your mind] like fire, arisen agreeable and disagreeable pressures will not occupy your mind. ",
    "mn62:15.3": "Suppose a fire were to burn both clean and unclean things, like feces, urine, spit, pus, and blood. The fire is not horrified, repelled, and disgusted because of this. ",
    "mn62:15.4": "In the same way, develop [your mind] like fire. ",
    "mn62:15.5": "For when you develop [your mind] like fire, arisen agreeable and disagreeable pressures will not endure with a grip on your mind. ",
    "mn62:16.1": "Develop [your mind] like air. ",
    "mn62:16.2": "For when you develop [your mind] like air, arisen agreeable and disagreeable pressures will not endure with a grip on your mind. ",
    "mn62:16.3": "Suppose the wind were to blow on both clean and unclean things, like feces, urine, spit, pus, and blood. The wind is not horrified, repelled, and disgusted because of this. ",
    "mn62:16.4": "In the same way, develop [your mind] like air. ",
    "mn62:16.5": "For when you develop [your mind] like air, arisen agreeable and disagreeable pressures will not endure with a grip on your mind. ",
    "mn62:17.1": "Develop [your mind] like space. ",
    "mn62:17.2": "For when you develop [your mind] like space, arisen agreeable and disagreeable pressures will not occupy your mind. ",
    "mn62:17.3": "Just as space is not established anywhere, ",
    "mn62:17.4": "in the same way, develop [your mind] like space. ",
    "mn62:17.5": "For when you develop [your mind] like space, arisen agreeable and disagreeable pressures will not occupy your mind. ",
    "mn62:18.1": "Develop friendliness. ",
    "mn62:18.2": "For when you develop friendliness, any ill will will be abandoned. ",
    "mn62:19.1": "Develop compassion. ",
    "mn62:19.2": "For when you develop compassion, any annoyance will be abandoned. ",
    "mn62:20.1": "Develop contentment. ",
    "mn62:20.2": "For when you develop contentment, any discontent will be abandoned. ",
    "mn62:21.1": "Develop equanimity. ",
    "mn62:21.2": "For when you develop equanimity, any resistance will be abandoned. ",
    "mn62:22.1": "Develop [the perception] of non-beauty. ",
    "mn62:22.2": "For when you develop [the perception] of non-beauty, any passion will be abandoned. ",
    "mn62:23.1": "Develop the perception of impermanence. ",
    "mn62:23.2": "For when you develop the perception of impermanence, any conceit ‘I am’ will be abandoned. ",
    "mn62:24.1": "Develop the remembrance of breathing. ",
    "mn62:24.2": "When the remembrance of breathing is developed and cultivated, it is very fruitful and beneficial. ",
    "mn62:24.3": "And how is the remembrance of breathing developed and cultivated to be very fruitful and beneficial? ",
    "mn62:25.1": "It is when a bhikkhu—gone to a wilderness, or to the root of a tree, or to an empty hut—sits down cross-legged, sets their body straight, and establishes remembrance at the fore. ",
    "mn62:25.2": "Recollected, he breathes in; recollected, he breathes out. ",
    "mn62:26.1": "Breathing in long, he understands: ‘I am breathing in long.’ Breathing out long, he understands: ‘I am breathing out long.’ ",
    "mn62:26.2": "Breathing in short, he understands: ‘I am breathing in short.’ Breathing out short, he understands: ‘I am breathing out short.’ ",
    "mn62:26.3": "He trains like this: ‘Experiencing the whole body, I will breathe in.’ He trains like this: ‘Experiencing the whole body, I will breathe out.’ ",
    "mn62:26.4": "He trains like this: ‘Calming the bodily activity, I will breathe in.’ He trains like this: ‘Calming the bodily activity, I will breathe out.’ ",
    "mn62:27.1": "He trains like this: ‘Experiencing joy, I will breathe in.’ He trains like this: ‘Experiencing joy, I will breathe out.’ ",
    "mn62:27.2": "He trains like this: ‘Experiencing ease, I will breathe in.’ He trains like this: ‘Experiencing ease, I will breathe out.’ ",
    "mn62:27.3": "He trains like this: ‘Experiencing the mind-activity, I will breathe in.’ He trains like this: ‘Experiencing the mind-activity, I will breathe out.’ ",
    "mn62:27.4": "He trains like this: ‘Calming the mind-activity, I will breathe in.’ He trains like this: ‘Calming the mind-activity, I will breathe out.’ ",
    "mn62:28.1": "He trains like this: ‘Experiencing the mind, I will breathe in.’ He trains like this: ‘Experiencing the mind, I will breathe out.’ ",
    "mn62:28.2": "He trains like this: ‘Gladdening the mind, I will breathe in.’ He trains like this: ‘Gladdening the mind, I will breathe out.’ ",
    "mn62:28.3": "He trains like this: ‘Composing the mind, I will breathe in.’ He trains like this: ‘Composing the mind, I will breathe out.’ ",
    "mn62:28.4": "He trains like this: ‘Liberating the mind, I will breathe in.’ He trains like this: ‘Liberating the mind, I will breathe out.’ ",
    "mn62:29.1": "He trains like this: ‘Maintaining perspective of impermanence, I will breathe in.’ He trains like this: ‘Maintaining perspective of impermanence, I will breathe out.’ ",
    "mn62:29.2": "He trains like this: ’Maintaining perspective of dispassion, I will breathe in.’ He trains like this: ‘Maintaining perspective of dispassion, I will breathe out.’ ",
    "mn62:29.3": "He trains like this: ‘Maintaining perspective of cessation, I will breathe in.’ He trains like this: ‘Maintaining perspective of cessation, I will breathe out.’ ",
    "mn62:29.4": "He trains like this: ‘Maintaining perspective of relinquishment, I will breathe in.’ He trains like this: ‘Maintaining perspective of relinquishment, I will breathe out.’ ",
    "mn62:30.1": "The remembrance of breathing, when developed and cultivated in this way, is very fruitful and beneficial. ",
    "mn62:30.2": "When the remembrance of breathing is developed and cultivated in this way, even one’s final breaths cease knowingly, not unknowingly.” ",
    "mn62:30.3": "That is what the Auspicious One said. ",
    "mn62:30.4": "Pleased, Venerable Rāhula delighted in what the Auspicious One said. "
}