{
    "mn64:0.1": "Middle Discourses 64 ",
    "mn64:0.2": "The Longer Discourse With Māluṅkya ",
    "mn64:1.1": "So I have heard. ",
    "mn64:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
    "mn64:1.3": "There the Buddha addressed the bhikkhus, ",
    "mn64:1.4": "“Bhikkhus!” ",
    "mn64:1.5": "“Bhante,” they replied. ",
    "mn64:1.6": "The Buddha said this: ",
    "mn64:2.1": "“Bhikkhus, do you remember the five lower fetters taught by me?” ",
    "mn64:2.2": "When he said this, Venerable Māluṅkyaputta said to him, ",
    "mn64:2.3": "“Bhante, I remember them.” ",
    "mn64:2.4": "“But how do you remember them?” ",
    "mn64:2.5": "“I remember the lower fetters taught by the Buddha as follows: personality-view, ",
    "mn64:2.6": "doubt, ",
    "mn64:2.7": "grasping at virtue-and-duty, ",
    "mn64:2.8": "sensual desire, ",
    "mn64:2.9": "and ill will. ",
    "mn64:2.10": "That’s how I remember the five lower fetters taught by the Buddha.” ",
    "mn64:3.1": "“Who on earth do you remember being taught the five lower fetters in that way? ",
    "mn64:3.2": "Wouldn’t the wanderers of other religions fault you using the simile of the infant? ",
    "mn64:3.3": "For a young tender infant lying prone lying prone doesn’t even have a concept of ‘personality’, so how could personality-view possibly arise in him? ",
    "mn64:3.4": "Yet the underlying tendency to personality-view still underlies him. ",
    "mn64:3.5": "A young tender infant lying prone lying prone doesn’t even have a concept of ‘teachings’, so how could doubt about teachings possibly arise in him? ",
    "mn64:3.6": "Yet the underlying tendency to doubt still underlies him. ",
    "mn64:3.7": "A young tender infant lying prone doesn’t even have a concept of ‘virtue’, so how could grasping at virtue-and-duty possibly arise in him? ",
    "mn64:3.8": "Yet the underlying tendency to grasping at virtue-and-duty still underlies him. ",
    "mn64:3.9": "A young tender infant lying prone doesn’t even have a concept of ‘sensuality’, so how could sensual desire possible arise in him? ",
    "mn64:3.10": "Yet the underlying tendency to sensual desire still underlies him. ",
    "mn64:3.11": "A young tender infant lying prone doesn’t even have a concept of ‘beings’, so how could ill will towards beings possibly arise in him? ",
    "mn64:3.12": "Yet the underlying tendency to ill will still underlies him. ",
    "mn64:3.13": "Wouldn’t the wanderers of other religions fault you using the simile of the infant?” ",
    "mn64:4.1": "When he said this, Venerable Ānanda said to the Buddha, ",
    "mn64:4.2": "“Now is the time, Blessed One! Now is the time, Excellent One! ",
    "mn64:4.3": "May the Buddha teach the five lower fetters. The bhikkhus will listen and remember it.” ",
    "mn64:4.4": "“Well then, Ānanda, listen and apply your mind well, I will speak.” ",
    "mn64:4.5": "“Yes, Bhante” Ānanda replied. ",
    "mn64:4.6": "The Buddha said this: ",
    "mn64:5.1": "“Ānanda, take an unlearned ordinary person who has not seen the noble ones, and is neither skilled nor trained in the teaching of the noble ones. They’ve not seen true persons, and are neither skilled nor trained in the teaching of the true persons. ",
    "mn64:5.2": "They live with a mind that’s prepossessed and overcome by personality-view, ",
    "mn64:5.3": "and they don’t understand as it is the escape from arisen personality-view. ",
    "mn64:5.4": "That personality-view is entrenched in them, not eliminated: it is a lower fetter. ",
    "mn64:5.5": "They live with a mind that’s prepossessed and overcome by doubt, ",
    "mn64:5.6": "and they don’t understand as it is the escape from arisen doubt. ",
    "mn64:5.7": "That doubt is entrenched in them, not eliminated: it is a lower fetter. ",
    "mn64:5.8": "They live with a mind that’s prepossessed and overcome by the grasping at virtue-and-duty, ",
    "mn64:5.9": "and they don’t understand as it is the escape from arisen grasping at virtue-and-duty. ",
    "mn64:5.10": "That grasping at virtue-and-duty is entrenched in them, not eliminated: it is a lower fetter. ",
    "mn64:5.11": "They live with a mind that’s prepossessed and overcome by sensual desire, ",
    "mn64:5.12": "and they don’t understand as it is the escape from arisen sensual desire. ",
    "mn64:5.13": "That sensual desire is entrenched in them, not eliminated: it is a lower fetter. ",
    "mn64:5.14": "They live with a mind that’s prepossessed and overcome by ill will, ",
    "mn64:5.15": "and they don’t understand as it is the escape from arisen ill will. ",
    "mn64:5.16": "That ill will is entrenched in them, not eliminated: it is a lower fetter. ",
    "mn64:6.1": "But a learned noble disciple who has seen the noble ones, and is skilled and trained in the teaching of the noble ones, who’s seen true persons, and is skilled and trained in the teaching of the true persons, lives with a mind that’s not prepossessed and overcome by personality-view, ",
    "mn64:6.2": "and they understand as it is the escape from arisen personality-view. ",
    "mn64:6.3": "That personality-view, along with any underlying tendency to it, is given up in them. ",
    "mn64:6.4": "They live with a mind that’s not prepossessed and overcome by doubt, ",
    "mn64:6.5": "and they understand as it is the escape from arisen doubt. ",
    "mn64:6.6": "That doubt, along with any underlying tendency to it, is given up in them. ",
    "mn64:6.7": "They live with a mind that’s not prepossessed and overcome by the grasping at virtue-and-duty, ",
    "mn64:6.8": "and they understand as it is the escape from arisen grasping at virtue-and-duty. ",
    "mn64:6.9": "That grasping at virtue-and-duty, along with any underlying tendency to it, is given up in them. ",
    "mn64:6.10": "They live with a mind that’s not prepossessed and overcome by sensual desire, ",
    "mn64:6.11": "and they understand as it is the escape from arisen sensual desire. ",
    "mn64:6.12": "That sensual desire, along with any underlying tendency to it, is given up in them. ",
    "mn64:6.13": "They live with a mind that’s not prepossessed and overcome by ill will, ",
    "mn64:6.14": "and they understand as it is the escape from arisen ill will. ",
    "mn64:6.15": "That ill will, along with any underlying tendency to it, is given up in them. ",
    "mn64:6.16": "There is a path and a practice for giving up the five lower fetters. It’s not possible to know or see or give up the five lower fetters without relying on that path and that practice. ",
    "mn64:6.17": "Suppose there was a large tree standing with heartwood. It’s not possible to cut out the heartwood without having cut through the bark and the softwood. ",
    "mn64:6.18": "",
    "mn64:6.19": "In the same way, there is a path and a practice for giving up the five lower fetters. It’s not possible to know or see or give up the five lower fetters without relying on that path and that practice. ",
    "mn64:7.1": "But it is possible to know and see and give up the five lower fetters by relying on that path and that practice. ",
    "mn64:8.1": "Suppose there was a large tree standing with heartwood. It is possible to cut out the heartwood after having cut through the bark and the softwood. ",
    "mn64:8.2": "In the same way, there is a path and a practice for giving up the five lower fetters. It is possible to know and see and give up the five lower fetters by relying on that path and that practice. ",
    "mn64:8.3": "Suppose the river Ganges was full to the brim so a crow could drink from it. ",
    "mn64:8.4": "Then along comes a feeble person, who thinks: ",
    "mn64:8.5": "‘By swimming with my arms I’ll safely cross over to the far shore of the Ganges.’ ",
    "mn64:8.6": "But they’re not able to do so. ",
    "mn64:8.7": "In the same way, when the Dhamma is being taught for the cessation of personality-view, someone whose mind doesn’t leap at it, and isn’ṭ confident, settled, and liberated in it, ",
    "mn64:8.8": "should be regarded as being like that feeble person. ",
    "mn64:8.9": "Suppose the river Ganges was full to the brim so a crow could drink from it. ",
    "mn64:8.10": "Then along comes a strong person, who thinks: ",
    "mn64:8.11": "‘By swimming with my arms I’ll safely cross over to the far shore of the Ganges.’ ",
    "mn64:8.12": "And they are able to do so. ",
    "mn64:8.13": "In the same way, when the Dhamma is being taught for the cessation of personality-view, someone whose mind leaps at it, and is confident, settled, and liberated in it, ",
    "mn64:8.14": "should be regarded as being like that strong person. ",
    "mn64:9.1": "And what, Ānanda, is the path and the practice for giving up the five lower fetters? ",
    "mn64:9.2": "It’s when a bhikkhu—due to the disjoining from appropriation, the giving up of unbeneficial qualities, and the complete calming of bodily discomforts—quite disjoined from sensuality, disjoined from unbeneficial phenomena, with thinking and with pondering, with joy and ease born of separation, abides having entered upon the first jhāna. ",
    "mn64:9.3": "He regards whatever is there that’s included in form, feeling, perception, activities, and consciousness as impermanent, as suffering, as diseased, as a boil, as a dart, as misery, as an affliction, as alien, as falling apart, as empty, as not-self. ",
    "mn64:9.4": "He turns his mind away from those phenomena, ",
    "mn64:9.5": "and directs it to the Deathless element: ",
    "mn64:9.6": "‘This is peaceful; this is sublime—that is, the appeasement of all activities, the letting go of all appropriation, the ending of craving, dispassion, cessation, Nibbāna.’ ",
    "mn64:9.7": "When he’s steady in that, he reaches destruction of the influxes. ",
    "mn64:9.8": "If he doesn’t reach the destruction of the influxes, then due to that passion and delight in the Dhamma, with the complete destruction of the five lower fetters, he reappears spontaneously. He is extinguished there, and is not liable to return from that world. ",
    "mn64:9.9": "This is the path and the practice for giving up the five lower fetters. ",
    "mn64:10-12.1": "‘Furthermore, with the appeasement of thinking and pondering … abides having entered upon the second jhāna.’ ",
    "mn64:10-12.2": "third jhāna … ",
    "mn64:10-12.3": "fourth jhāna. ",
    "mn64:10-12.4": "He regards whatever is there that’s included in form, feeling, perception, activities, and consciousness … ",
    "mn64:10-12.5": "He turns his mind away from those phenomena … ",
    "mn64:10-12.6": "If he doesn’t attain the destruction of the influxes … and is not liable to return from that world. ",
    "mn64:10-12.7": "This too is the path and the practice for giving up the five lower fetters. ",
    "mn64:13.1": "Furthermore, a bhikkhu, having fully surmounted perceptions of form, with the ending of perceptions of resistance, not attending to perceptions of multiplicity, aware that ‘space is infinite’, abides having entered upon the extent of infinite space. ",
    "mn64:13.2": "He regards whatever is there that’s included in feeling, perception, activities, and consciousness … ",
    "mn64:13.3": "He turns his mind away from those things … ",
    "mn64:13.4": "If he doesn’t attain the destruction of the influxes … and is not liable to return from that world. ",
    "mn64:13.5": "This too is the path and the practice for giving up the five lower fetters. ",
    "mn64:14.1": "Furthermore, a bhikkhu, having fully surmounted the extent of infinite space, aware that ‘consciousness is infinite’, abides having entered upon the extent of infinite consciousness. ",
    "mn64:14.2": "He regards whatever is there that’s included in feeling, perception, activities, and consciousness … ",
    "mn64:14.3": "He turns his mind away from those things … ",
    "mn64:14.4": "If he doesn’t attain the destruction of the influxes … and is not liable to return from that world. ",
    "mn64:14.5": "This too is the path and the practice for giving up the five lower fetters. ",
    "mn64:15.1": "Furthermore, a bhikkhu, having fully surmounted the extent of infinite consciousness, aware that ‘there is nothing at all’, abides having entered upon the extent of nothingness. ",
    "mn64:15.2": "He regards whatever is there that’s included in feeling, perception, activities, and consciousness … ",
    "mn64:15.3": "He turns his mind away from those things … ",
    "mn64:15.4": "If he doesn’t attain the destruction of the influxes … and is not liable to return from that world. ",
    "mn64:15.5": "This too is the path and the practice for giving up the five lower fetters.” ",
    "mn64:16.1": "“Bhante, if this is the path and the practice for giving up the five lower fetters, how come some bhikkhus here are liberated by mind while others are liberated by understanding?” ",
    "mn64:16.2": "“In that case, I say it is the multiplicity of their faculties.” ",
    "mn64:16.3": "That is what the Buddha said. ",
    "mn64:16.4": "Pleased, Venerable Ānanda delighted in what the Buddha said. "
}