{
  "mn8:0.1": "Middle Discourses 8 ",
  "mn8:0.2": "Wearing Away ",
  "mn8:1.1": "So I have heard. ",
  "mn8:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
  "mn8:2.1": "Then in the late afternoon, Venerable Mahācunda came out of retreat and went to the Buddha. He bowed, sat down to one side, and said to the Buddha: ",
  "mn8:3.1": "“Bhante, there are many different views that arise in the world ",
  "mn8:3.2": "connected with assertions about the self or the world. ",
  "mn8:3.3": "Does the abandoning and relinquishing of those views come about in a bhikkhu who attends to just the basics [of the training]?” ",
  "mn8:3.4": "“Cunda, there are many different views that arise in the world ",
  "mn8:3.5": "connected with assertions about the self or the world. ",
  "mn8:3.6": "A bhikkhu gives up and lets go of these views by seeing as it is with right understanding where they arise, where they settle, and where they operate as: ‘This is not mine, I am not this, this is not my self.’ ",
  "mn8:4.1": "It’s possible that a certain bhikkhu, quite disjoined from sensuality, disjoined from detrimental phenomena, with thinking and with pondering, with joy and ease born of separation, might abide having entered upon the first jhāna. ",
  "mn8:4.2": "He might think ",
  "mn8:4.3": "he's practicing ‘wearing away’. ",
  "mn8:4.4": "But in the training of the Noble One these are not called ‘wearing away’; ",
  "mn8:4.5": "they’re called ‘pleasant abidings in the present experience’. ",
  "mn8:5.1": "It’s possible that some bhikkhu, with the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and ease born of composure, might abide having entered upon the second jhāna. ",
  "mn8:5.2": "He might think ",
  "mn8:5.3": "he's practicing ‘wearing away’. ",
  "mn8:5.4": "But in the training of the Noble One these are not called ‘wearing away’; ",
  "mn8:5.5": "they’re called ‘pleasant abidings in the present experience’. ",
  "mn8:6.1": "It's possible that some bhikkhu, with the fading of joy, might abide equanimous, recollected and aware, experiencing ease with the body—that he might abide having entered upon the third jhāna, with regard to which the noble ones say “one abides equanimous, recollected, and at ease.” ",
  "mn8:6.2": "He might think ",
  "mn8:6.3": "he's practicing ‘wearing away’. ",
  "mn8:6.4": "But in the training of the Noble One these are not called ‘wearing away’; ",
  "mn8:6.5": "they’re called ‘pleasant abidings in the present experience’. ",
  "mn8:7.1": "It’s possible that some bhikkhu, with the giving up of ease and unease—and with the ending of joys and upsets beforehand—without pleasure or displeasure, with purity of equanimity and recollection, might abide having entered upon the fourth jhāna. ",
  "mn8:7.2": "He might think ",
  "mn8:7.3": "he's practicing ‘wearing away’. ",
  "mn8:7.4": "But in the training of the Noble One these are not called ‘wearing away’; ",
  "mn8:7.5": "they’re called ‘pleasant abidings in the present experience’. ",
  "mn8:8.1": "It’s possible that some bhikkhu, having fully surmounted perceptions of form, with the ending of perceptions of resistance, not attending to perceptions of diversity, [knowing that] ‘space is infinite’, might abide having entered upon the extent of infinite space. ",
  "mn8:8.2": "He might think ",
  "mn8:8.3": "he's practicing ‘wearing away’. ",
  "mn8:8.4": "But in the training of the Noble One these are not called ‘wearing away’; ",
  "mn8:8.5": "they’re called ‘peaceful abidings’. ",
  "mn8:9.1": "It’s possible that some bhikkhu, having fully surmounted the extent of infinite space, [knowing that] ‘consciousness is infinite’, might abide having entered upon the extent of infinite consciousness. ",
  "mn8:9.2": "He might think ",
  "mn8:9.3": "he's practicing ‘wearing away’. ",
  "mn8:9.4": "But in the training of the Noble One these are not called ‘wearing away’; ",
  "mn8:9.5": "they’re called ‘peaceful abidings’. ",
  "mn8:10.1": "It’s possible that some bhikkhu, having fully surmounted the extent of infinite consciousness, [knowing that] ‘there is nothing’, might abide having entered upon the extent of nothingness. ",
  "mn8:10.2": "He might think ",
  "mn8:10.3": "he's practicing ‘wearing away’. ",
  "mn8:10.4": "But in the training of the Noble One these are not called ‘wearing away’; ",
  "mn8:10.5": "they’re called ‘peaceful abidings’. ",
  "mn8:11.1": "It’s possible that some bhikkhu, having fully surmounted the extent of nothingness, might abide having entered upon the extent of neither-perception-nor-non-perception. ",
  "mn8:11.2": "He might think ",
  "mn8:11.3": "he's practicing ‘wearing away’. ",
  "mn8:11.4": "But in the training of the Noble One these are not called ‘wearing away’; ",
  "mn8:11.5": "they’re called ‘peaceful abidings’. ",
  "mn8:12.0": "1. The Exposition of Wearing Away ",
  "mn8:12.1": "It is here, Cunda, that ‘wearing away’ should be practiced: ",
  "mn8:12.2": "‘Others will be cruel, but here we will not be cruel.’ ",
  "mn8:12.3": "‘Others will kill living creatures, but here we will not kill living creatures.’ ",
  "mn8:12.4": "‘Others will steal, but here we will not steal.’ ",
  "mn8:12.5": "‘Others will not be celibate, but here we will be celibate.’ ",
  "mn8:12.6": "‘Others will lie, but here we will not lie.’ ",
  "mn8:12.7": "‘Others will speak divisively, but here we will not speak divisively.’ ",
  "mn8:12.8": "‘Others will speak harshly, but here we will not speak harshly.’ ",
  "mn8:12.9": "‘Others will engage in frivolous talk, but here we will not engage in frivolous talk.’ ",
  "mn8:12.10": "‘Others will be covetous, but here we will not be covetous.’ ",
  "mn8:12.11": "‘Others will have aversion, but here we will not have aversion.’ ",
  "mn8:12.12": "‘Others will have wrong view, but here we will have right view.’ ",
  "mn8:12.13": "‘Others will have wrong intention, but here we will have right intention.’ ",
  "mn8:12.14": "‘Others will have wrong speech, but here we will have right speech.’ ",
  "mn8:12.15": "‘Others will have wrong action, but here we will have right action.’ ",
  "mn8:12.16": "‘Others will have wrong livelihood, but here we will have right livelihood.’ ",
  "mn8:12.17": "‘Others will have wrong effort, but here we will have right effort.’ ",
  "mn8:12.18": "‘Others will have wrong recollection, but here we will have right recollection.’ ",
  "mn8:12.19": "‘Others will have wrong composure, but here we will have right composure.’ ",
  "mn8:12.20": "‘Others will have wrong knowledge, but here we will have right knowledge.’ ",
  "mn8:12.21": "‘Others will have wrong liberation, but here we will have right liberation.’ ",
  "mn8:12.22": "‘Others will be overcome with indolence-and-lethargy, but here we will be rid of indolence-and-lethargy.’ ",
  "mn8:12.23": "‘Others will be restless, but here we will not be restless.’ ",
  "mn8:12.24": "‘Others will have doubts, but here we will have gone beyond doubt.’ ",
  "mn8:12.25": "‘Others will be irritable, but here we will be without anger.’ ",
  "mn8:12.26": "‘Others will be resentful, but here we will be without resentment.’ ",
  "mn8:12.27": "‘Others will denigrate, but here we will not denigrate.’ ",
  "mn8:12.28": "‘Others will be contentious, but here we will be uncontentious.’ ",
  "mn8:12.29": "‘Others will be jealous, but here we will be without jealousy.’ ",
  "mn8:12.30": "‘Others will be stingy, but here we will be without stinginess.’ ",
  "mn8:12.31": "‘Others will be devious, but here we will not be devious.’ ",
  "mn8:12.32": "‘Others will be deceitful, but here we will not be deceitful.’ ",
  "mn8:12.33": "‘Others will be obstinate, but here we will not be obstinate.’ ",
  "mn8:12.34": "‘Others will be arrogant, but here we will not be arrogant.’ ",
  "mn8:12.35": "‘Others will be hard to admonish, but here we will not be hard to admonish.’ ",
  "mn8:12.36": "‘Others will have bad friends, but here we will have good friends.’ ",
  "mn8:12.37": "‘Others will be negligent, but here we will be diligent.’ ",
  "mn8:12.38": "‘Others will be faithless, but here we will have faith.’ ",
  "mn8:12.39": "‘Others will be shameless, but here we will not be shameless.’ ",
  "mn8:12.40": "‘Others will be imprudent, but here we will be prudent.’ ",
  "mn8:12.41": "‘Others will be unlearned, but here we will be well learned.’ ",
  "mn8:12.42": "‘Others will be lazy, but here we will be effortful.’ ",
  "mn8:12.43": "‘Others will have muddled recollection, but here we will have recollection established.’ ",
  "mn8:12.44": "‘Others will be witless, but here we will be accomplished in understanding.’ ",
  "mn8:12.45": "‘Others will be attached to their own views, holding them tight, and refusing to let go, but here we will not be attached to our own views, not holding them tight, but will let them go easily.’ ",
  "mn8:13.0": "2. The Exposition by Intent ",
  "mn8:13.1": "Cunda, I say that even the arising of intent towards beneficial qualities is very helpful, let alone following that in body and speech. ",
  "mn8:13.2": "That’s why you should give rise to the following intents: ‘Others will be cruel, but here we will not be cruel.’ ",
  "mn8:13.3": "‘Others will kill living creatures, but here we will not kill living creatures.’ … ",
  "mn8:13.4": "‘Others will be attached to their own views, holding them tight, and refusing to let go, but here we will not be attached to our own views, not holding them tight, but will let them go easily.’ ",
  "mn8:14.0": "3. A Way Around ",
  "mn8:14.1": "Cunda, suppose there was an uneven path and another even path to get around it. ",
  "mn8:14.2": "Or suppose there was an uneven ford and another even ford to get around it. ",
  "mn8:14.3": "In the same way, a cruel individual gets around it by not being cruel. An individual who kills gets around it by not killing. … ",
  "mn8:14.4": " ",
  "mn8:14.5": "An individual who is attached to their own views, holding them tight, and refusing to let go, gets around it by not being attached to their own views, not holding them tight, but letting them go easily. ",
  "mn8:15.0": "4. Going Up ",
  "mn8:15.1": "Cunda, all detrimental qualities lead downwards, while all beneficial qualities lead upwards. ",
  "mn8:15.2": "In the same way, a cruel individual goes upwards by not being cruel. An individual who kills goes upwards by not killing … ",
  "mn8:15.3": "An individual who is attached to their own views, holding them tight, and refusing to let go, goes upwards by not being attached to their own views, not holding them tight, but letting them go easily. ",
  "mn8:16.0": "5. The Exposition by Quenching (Parinibbāna) ",
  "mn8:16.1": "If you’re sinking in the mud yourself, Cunda, it is quite impossible for you to pull out someone else who is sinking in the mud. ",
  "mn8:16.2": "But if you’re not sinking in the mud yourself, it is quite possible for you to pull out someone else who is sinking in the mud. ",
  "mn8:16.3": "If you’re not tamed, trained, and quenched yourself, it is quite impossible for you to help tame, train, and quench someone else. ",
  "mn8:16.4": "But if you are tamed, trained, and quenched yourself, it is quite possible for you to help tame, train, and quench someone else. ",
  "mn8:16.5": "In the same way, a cruel individual quenches it by not being cruel. An individual who kills quenches it by not killing. … ",
  "mn8:16.6": " ",
  "mn8:16.7": " ",
  "mn8:16.8": " ",
  "mn8:16.9": " ",
  "mn8:16.10": " ",
  "mn8:16.11": " ",
  "mn8:16.12": " ",
  "mn8:16.13": " ",
  "mn8:16.14": " ",
  "mn8:16.15": " ",
  "mn8:16.16": " ",
  "mn8:16.17": " ",
  "mn8:16.18": " ",
  "mn8:16.19": " ",
  "mn8:16.20": " ",
  "mn8:16.21": " ",
  "mn8:16.22": " ",
  "mn8:16.23": " ",
  "mn8:16.24": " ",
  "mn8:16.25": " ",
  "mn8:16.26": " ",
  "mn8:16.27": " ",
  "mn8:16.28": " ",
  "mn8:16.29": " ",
  "mn8:16.30": " ",
  "mn8:16.31": " ",
  "mn8:16.32": " ",
  "mn8:16.33": " ",
  "mn8:16.34": " ",
  "mn8:16.35": " ",
  "mn8:16.36": " ",
  "mn8:16.37": " ",
  "mn8:16.38": " ",
  "mn8:16.39": " ",
  "mn8:16.40": " ",
  "mn8:16.41": " ",
  "mn8:16.42": " ",
  "mn8:16.43": " ",
  "mn8:16.44": " ",
  "mn8:16.45": " ",
  "mn8:16.46": " ",
  "mn8:16.47": "An individual who is attached to their own views, holding them tight, and refusing to let go, quenches it by not being attached to their own views, not holding them tight, but letting them go easily. ",
  "mn8:17.1": "So, Cunda, I’ve taught the expositions of wearing away, arousing intent, the way around, going up, and quenching. ",
  "mn8:17.2": "Out of compassion, I’ve done what a teacher should do who wants what’s best for his disciples. ",
  "mn8:17.3": "Here are these roots of trees, and here are these empty huts. Develop jhāna, Cunda! Don’t be negligent! Don’t regret it later! This is my instruction.” ",
  "mn8:17.4": "That is what the Buddha said. ",
  "mn8:17.5": "Pleased, Venerable Mahācunda delighted in what the Buddha said. ",
  "mn8:17.6": "″Forty-four items have been stated, ",
  "mn8:17.7": "organized into five sections. ",
  "mn8:17.8": "‘Wearing Away’ is the name of this discourse, ",
  "mn8:17.9": "which is deep as the ocean.” "
}
