{
    "mn9:0.1": "Middle Discourses 9 ",
    "mn9:0.2": "Right View ",
    "mn9:1.1": "So I have heard. ",
    "mn9:1.2": "At one time, the Auspicious One was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
    "mn9:1.3": "There Venerable Sāriputta addressed the bhikkhus: ",
    "mn9:1.4": "“Venerable bhikkhus!” ",
    "mn9:1.5": "“Venerable,” they replied. ",
    "mn9:1.6": "Venerable Sāriputta said this: ",
    "mn9:2.1": "“Venerables, it is said: ‘Right view, right view.’ ",
    "mn9:2.2": "To what extent is a noble disciple one of right and correct view, who is endowed with absolute confidence in the Dhamma, and has come to the true Dhamma?” ",
    "mn9:2.3": "“Venerable, we would travel a long way to learn the meaning of this statement in the presence of Venerable Sāriputta. ",
    "mn9:2.4": "May Venerable Sāriputta himself please clarify the meaning of this. ",
    "mn9:2.5": "The bhikkhus will listen and remember it.” ",
    "mn9:2.6": "“Well then, venerables, listen and apply your mind well, I will speak.” ",
    "mn9:2.7": "“Yes, venerable,” they replied. ",
    "mn9:2.8": "Venerable Sāriputta said this: ",
    "mn9:3.1": "“A noble disciple understands the unbeneficial and its root, and the beneficial and its root. ",
    "mn9:3.2": "To this extent, a noble disciple is one of right and correct view, who has absolute confidence in the Dhamma, and has come to the true Dhamma. ",
    "mn9:4.1": "But what is the unbeneficial and what is its root? And what is the beneficial and what is its root? ",
    "mn9:4.2": "Killing living creatures, taking what is not given, and misconduct with regard to sense pleasures; speech that is false, divisive, harsh, or frivolous; longing, ill will, and wrong view. ",
    "mn9:4.3": "This is called the unbeneficial. ",
    "mn9:5.1": "And what is the root of the unbeneficial? ",
    "mn9:5.2": "Greed, aversion, and muddledness. ",
    "mn9:5.3": "This is called the root of the unbeneficial. ",
    "mn9:6.1": "And what is the beneficial? ",
    "mn9:6.2": "Abstaining from killing living creatures, taking what is not given, and misconduct with regard to sense pleasures; avoiding speech that is false, divisive, harsh, or frivolous; non-longing, non-ill-will, and right view. ",
    "mn9:6.3": "This is called the beneficial. ",
    "mn9:7.1": "And what is the root of the beneficial? ",
    "mn9:7.2": "Non-greed, non-aversion, and non-muddledness. ",
    "mn9:7.3": "This is called the root of the beneficial. ",
    "mn9:8.1": "When a noble disciple understands in this way the unbeneficial and its root, and the beneficial and its root, and has completely abandoned the underlying tendency to passion, eliminated the underlying tendency to resistance, eradicated the underlying tendency to the view and conceit ‘I am’, abandoned ignorance and given rise to knowledge, he makes an end of suffering right in the present experience. ",
    "mn9:8.2": "To this extent too, a noble disciple is one of right and correct view, who has absolute confidence in the Dhamma, and has come to the true Dhamma. ",
    "mn9:9.1": "Saying “Good, venerable,” those bhikkhus delighted in and expressed appreciation for what Venerable Sāriputta said. Then they asked another question: ",
    "mn9:9.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view, who has absolute confidence in the Dhamma, and has come to the true Dhamma?” ",
    "mn9:10.1": "“There might, venerables. ",
    "mn9:10.2": "A noble disciple understands nutriment, its origin, its cessation, and the practice that leads to its cessation. ",
    "mn9:10.3": "To this extent too, a noble disciple is one of right and correct view, who has absolute confidence in the Dhamma, and has come to the true Dhamma.” ",
    "mn9:11.1": "But what is nutriment? What is its origin, its cessation, and the practice that leads to its cessation? ",
    "mn9:11.2": "There are these four nutriments. They maintain beings that have been born and help those that seek to be born. ",
    "mn9:11.3": "What four? ",
    "mn9:11.4": "Solid food, whether coarse or fine; pressure is the second, mental intention the third, and consciousness the fourth. ",
    "mn9:11.5": "Nutriment comes with craving. Nutriment ceases when craving ceases. The practice that leads to the cessation of nutriment is simply this Noble Eightfold Path, that is: ",
    "mn9:11.6": "right view, right intention, right speech, right action, right livelihood, right effort, right remembrance, and right composure. ",
    "mn9:12.1": "When a noble disciple understands in this way nutriment, the origin of nutriment, the cessation of nutriment, and the practice that leads to its cessation, and has completely abandoned the underlying tendency to passion, eliminated the underlying tendency to resistance, eradicated the underlying tendency to the view and conceit ‘I am’, and abandoned ignorance and given rise to knowledge, he makes an end of suffering right in the present experience. ",
    "mn9:12.2": "To this extent too, a noble disciple is one of right and correct view, who has absolute confidence in the Dhamma, and has come to the true Dhamma.” ",
    "mn9:13.1": "Saying “Good, venerable,” those bhikkhus … asked another question: ",
    "mn9:13.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view … ?” ",
    "mn9:14.1": "“There might, venerables. ",
    "mn9:14.2": "A noble disciple understands suffering, its origin, its cessation, and the practice that leads to its cessation. ",
    "mn9:14.3": "To this extent too, a noble disciple is one of right view … and has come to the true Dhamma. ",
    "mn9:15.1": "But what is suffering? What is its origin, its cessation, and the practice that leads to its cessation? ",
    "mn9:15.2": "Birth is suffering; aging is suffering; death is suffering; sorrow, lamentation, displeasure, sadness, and distress are suffering; association with the disliked is suffering; separation from the liked is suffering; not getting what you wish for is suffering. In brief, the five assumption-aggregates are suffering. ",
    "mn9:15.3": "This is called suffering. ",
    "mn9:16.1": "And what is the origin of suffering? ",
    "mn9:16.2": "It is the craving that leads to renewed being, accompanied by delight-and-passion, which delights now here, now there. That is, ",
    "mn9:16.3": "craving for sensuality, craving for being, and craving for non-being. ",
    "mn9:16.4": "This is called the origin of suffering. ",
    "mn9:17.1": "And what is the cessation of suffering? ",
    "mn9:17.2": "It is the fading and cessation of that very same craving without remainder; relinquishing it, forsaking it, releasing it, and not resting upon it. ",
    "mn9:17.3": "This is called the cessation of suffering. ",
    "mn9:18.1": "And what is the practice that leads to the cessation of suffering? ",
    "mn9:18.2": "It is simply this Noble Eightfold Path, that is: ",
    "mn9:18.3": "right view … right composure. ",
    "mn9:18.4": "This is called the practice that leads to the cessation of suffering. ",
    "mn9:19.1": "When a noble disciple understands in this way, suffering, the origin of suffering, the cessation of suffering, and the practice that leads to its cessation, and has completely abandoned the underlying tendency to passion, eliminated the underlying tendency to resistance, eradicated the underlying tendency to the view and conceit ‘I am’, and abandoned ignorance and given rise to knowledge, he makes an end of suffering right in the present experience. ",
    "mn9:19.2": "To this extent too, a noble disciple is one of right and correct view, who has absolute confidence in the Dhamma, and has come to the true Dhamma.” ",
    "mn9:20.1": "Saying “Good, venerable,” those bhikkhus … asked another question: ",
    "mn9:20.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view … ?” ",
    "mn9:21.1": "“There might, venerables. ",
    "mn9:21.2": "A noble disciple understands aging and death, their origin, their cessation, and the practice that leads to their cessation … ",
    "mn9:22.1": "But what are aging and death? What is their origin, their cessation, and the practice that leads to their cessation? ",
    "mn9:22.2": "The aging, decrepitude, broken teeth, gray hair, wrinkled skin, diminished vitality, and failing faculties of the various beings in the various orders of beings. ",
    "mn9:22.3": "This is called aging. ",
    "mn9:22.4": "And what is death? ",
    "mn9:22.5": "The passing away of the various beings from the various orders of beings: the perishing, disintegration, demise, mortality, death, decease, dissolution of the aggregates, laying to rest of the corpse, and cutting off of the life faculty. ",
    "mn9:22.6": "This is called death. ",
    "mn9:22.7": "Such is aging, and such is death. ",
    "mn9:22.8": "This is called aging and death. ",
    "mn9:22.9": "Aging and death come with birth. Aging and death cease when birth ceases. The practice that leads to the cessation of aging and death is simply this Noble Eightfold Path …” ",
    "mn9:24.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view … ?” ",
    "mn9:25.1": "“There might, venerables. ",
    "mn9:25.2": "A noble disciple understands birth, its origin, its cessation, and the practice that leads to its cessation … ",
    "mn9:26.1": "But what is birth? What is its origin, its cessation, and the practice that leads to its cessation? ",
    "mn9:26.2": "The birth, inception, conception, production, manifestation of the aggregates, and acquisition of the sense fields of the various beings in the various orders of beings. ",
    "mn9:26.3": "This is called birth. ",
    "mn9:26.4": "Birth comes with being. Birth ceases when being ceases. The practice that leads to the cessation of birth is simply this Noble Eightfold Path …” ",
    "mn9:28.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view … ?” ",
    "mn9:29.1": "“There might, venerables. ",
    "mn9:29.2": "A noble disciple understands being, its origin, its cessation, and the practice that leads to its cessation. ",
    "mn9:30.1": "But what is being? What is its origin, its cessation, and the practice that leads to its cessation? ",
    "mn9:30.2": "“There are these three states of existence. ",
    "mn9:30.3": "Sensual being, material being, and immaterial being. ",
    "mn9:30.4": "Being comes with assumption. Being ceases when assumption ceases. The practice that leads to the cessation of being is simply this Noble Eightfold Path …” ",
    "mn9:32.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view … ?” ",
    "mn9:33.1": "“There might, venerables. ",
    "mn9:33.2": "A noble disciple understands assumption, its origin, its cessation, and the practice that leads to its cessation … ",
    "mn9:34.1": "But what is assumption? What is its origin, its cessation, and the practice that leads to its cessation? ",
    "mn9:34.2": "There are these four assumptions. ",
    "mn9:34.3": "The assumption of sensuality, the assumption of views, the assumption of virtue-and-duty, and the assumption of a view of self. ",
    "mn9:34.4": "Assumption comes with craving. Assumption ceases when craving ceases. The practice that leads to the cessation of assumption is simply this Noble Eightfold Path …” ",
    "mn9:36.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view … ?” ",
    "mn9:37.1": "“There might, venerables. ",
    "mn9:37.2": "A noble disciple understands craving, its origin, its cessation, and the practice that leads to its cessation … ",
    "mn9:38.1": "But what is craving? What is its origin, its cessation, and the practice that leads to its cessation? ",
    "mn9:38.2": "There are these six classes of craving. ",
    "mn9:38.3": "Craving for forms, sounds, smells, tastes, touches, and phenomena. ",
    "mn9:38.4": "The practice that leads to the cessation of craving is simply this Noble Eightfold Path … ",
    "mn9:40.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view … ?” ",
    "mn9:41.1": "“There might, venerables. ",
    "mn9:41.2": "A noble disciple understands feeling, its origin, its cessation, and the practice that leads to its cessation … ",
    "mn9:42.1": "But what is feeling? What is its origin, its cessation, and the practice that leads to its cessation? ",
    "mn9:42.2": "There are these six classes of feeling. ",
    "mn9:42.3": "Feeling born of pressure through the eye, ear, nose, tongue, body, and mental faculty. ",
    "mn9:42.4": "Feeling comes with pressure. Feeling ceases when pressure ceases. The practice that leads to the cessation of feeling is simply this Noble Eightfold Path …” ",
    "mn9:44.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view … ?” ",
    "mn9:45.1": "“There might, venerables. ",
    "mn9:45.2": "A noble disciple understands pressure, its origin, its cessation, and the practice that leads to its cessation … ",
    "mn9:46.1": "But what is pressure? What is its origin, its cessation, and the practice that leads to its cessation? ",
    "mn9:46.2": "There are these six classes of pressure. ",
    "mn9:46.3": "Pressure through the eye, ear, nose, tongue, body, and mental faculty. ",
    "mn9:46.4": "Pressure comes with the six sense fields. Pressure ceases when the six sense fields cease. The practice that leads to the cessation of pressure is simply this Noble Eightfold Path …” ",
    "mn9:48.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view … ?” ",
    "mn9:49.1": "“There might, venerables. ",
    "mn9:49.2": "A noble disciple understands the six sense fields, their origin, their cessation, and the practice that leads to their cessation … ",
    "mn9:50.1": "But what are the six sense fields? What is their origin, their cessation, and the practice that leads to their cessation? ",
    "mn9:50.2": "There are these six sense fields. ",
    "mn9:50.3": "The sense fields of the eye, ear, nose, tongue, body, and mental faculty. ",
    "mn9:50.4": "The six sense fields come with name-and-form. The six sense fields cease when name-and-form ceases. The practice that leads to the cessation of the six sense fields is simply this Noble Eightfold Path …” ",
    "mn9:52.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view … ?” ",
    "mn9:53.1": "“There might, venerables. ",
    "mn9:53.2": "A noble disciple understands name-and-form, its origin, its cessation, and the practice that leads to its cessation … ",
    "mn9:54.1": "But what is name-and-form? What is its origin, its cessation, and the practice that leads to its cessation? ",
    "mn9:54.2": "Feeling, perception, intention, pressure, and attention— ",
    "mn9:54.3": "this is called name. ",
    "mn9:54.4": "The four primary elements, and form derived from the four primary elements— ",
    "mn9:54.5": "this is called form. ",
    "mn9:54.6": "Such is name and such is form. ",
    "mn9:54.7": "This is called name-and-form. ",
    "mn9:54.8": "Name-and-form comes with consciousness. Name-and-form ceases when consciousness ceases. The practice that leads to the cessation of name-and-form is simply this Noble Eightfold Path …” ",
    "mn9:56.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view … ?” ",
    "mn9:57.1": "“There might, venerables. ",
    "mn9:57.2": "A noble disciple understands consciousness, its origin, its cessation, and the practice that leads to its cessation … ",
    "mn9:58.1": "But what is consciousness? What is its origin, its cessation, and the practice that leads to its cessation? ",
    "mn9:58.2": "There are these six classes of consciousness. ",
    "mn9:58.3": "Eye, ear, nose, tongue, body, and mental faculty consciousness. ",
    "mn9:58.4": "Consciousness comes with activations. Consciousness ceases when activations cease. The practice that leads to the cessation of consciousness is simply this Noble Eightfold Path …” ",
    "mn9:60.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view … ?” ",
    "mn9:61.1": "“There might, venerables. ",
    "mn9:61.2": "A noble disciple understands activations, their origin, their cessation, and the practice that leads to their cessation … ",
    "mn9:62.1": "But what are activations? What is their origin, their cessation, and the practice that leads to their cessation? ",
    "mn9:62.2": "There are these three kinds of activations. ",
    "mn9:62.3": "The bodily activity, the verbal activity, and the mind-activity. ",
    "mn9:62.4": "Activities come with ignorance. Activities cease when ignorance ceases. The practice that leads to the cessation of activations is simply this Noble Eightfold Path …” ",
    "mn9:64.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view …?” ",
    "mn9:64.3": "“There might, venerables. ",
    "mn9:65.1": "A noble disciple understands ignorance, its origin, its cessation, and the practice that leads to its cessation … ",
    "mn9:65.3": "But what is ignorance? What is its origin, its cessation, and the practice that leads to its cessation? ",
    "mn9:65.4": "Not knowing suffering, the origin of suffering, the cessation of suffering, and the practice that leads to the cessation of suffering. ",
    "mn9:65.5": "This is called ignorance. ",
    "mn9:66.1": "Ignorance comes with influxes. Ignorance ceases when influxes cease. The practice that leads to the cessation of ignorance is simply this Noble Eightfold Path …” ",
    "mn9:68.1": "Saying “Good, venerable,” those bhikkhus delighted in and expressed appreciation for what Venerable Sāriputta said. Then they asked another question: ",
    "mn9:68.2": "“But venerable, might there be another explanation for how a noble disciple is one of right and correct view … who has right view, whose view is correct, who has absolute confidence in the Dhamma, and has come to the true Dhamma?” ",
    "mn9:69.1": "“There might, venerables. ",
    "mn9:69.2": "A noble disciple understands influx, its origin, its cessation, and the practice that leads to its cessation. ",
    "mn9:69.3": "To this extent too, a noble disciple is one of right and correct view, who has absolute confidence in the Dhamma, and has come to the true Dhamma.” ",
    "mn9:70.1": "But what is influx? What is its origin, its cessation, and the practice that leads to its cessation? ",
    "mn9:70.2": "There are these three influxes. ",
    "mn9:70.3": "The influx of sensuality, the influx of being, and the influx of ignorance. ",
    "mn9:70.4": "Influx comes with ignorance. Influx ceases when ignorance ceases. The practice that leads to the cessation of influx is simply this Noble Eightfold Path, that is: ",
    "mn9:70.5": "right view, right intention, right speech, right action, right livelihood, right effort, right remembrance, and right composure. ",
    "mn9:71.1": "When a noble disciple understands in this way, influx, the origin of influx, the cessation of influx, and the practice that leads to its cessation, and has completely abandoned the underlying tendency to passion, eliminated the underlying tendency to resistance, eradicated the underlying tendency to the view and conceit ‘I am’, abandoned ignorance, and given rise to knowledge, he makes an end of suffering right in the present experience. ",
    "mn9:71.2": "To this extent too, a noble disciple is one of right and correct view, who has absolute confidence in the Dhamma, and has come to the true Dhamma.” ",
    "mn9:71.3": "This is what Venerable Sāriputta said. ",
    "mn9:71.4": "Pleased, the bhikkhus delighted in what Venerable Sāriputta said. "
}