{
    "dn10": "The Buddha taught, praised, and encouraged the three noble aggregates—<em>sīla, samādhi,</em> and <em>paññā</em>—each serving as a necessary foundation for the development of the next.",
    "mn2": "The realization of the Dhamma is for one who, having understood yoniso manasikāra, gives up seven kinds of influxes.",
    "mn16": "A trainee needs to abandon ten impediments to achieve maturity in the Dhamma. With this foundation, they can develop right composure (samādhi).",
    "mn18": "If one abandons delight in that because of which perceptions arise—the sense organs and their counterparts—then one will be free from defilements even amidst those perceptions. This, and not focusing on one object, is also how “proliferation” (<em>papañca</em>) is abandoned.",
    "mn19": "Fostering the context of danger and harm of unbeneficial thoughts—of sensuality, ill will, and cruelty—and by doing so inclining the mind in the opposite direction, is how one develops jhāna.",
    "mn22": "The Buddha strongly disparages the view that one can engage in such acts of sensual nature—chiefly sexual activity—without hindering progress on the path. He calls this view “pernicious” and, amidst an assembly of monks, intensely rebukes a monk who stubbornly adhered to it, causing him great embarrassment.",
    "mn24": "The path to Nibbāna progresses through successive stages of purification, each laying the foundation for the next, ultimately leading to the total cessation of assumption.",
    "mn38": "Dependent origination is not a temporal sequence of causes and effect but the discernment of a simultaneous interdependence of two phenomena in the present experience. It's about knowing the uncontrollable underlying foundation of one's experience while it is enduring so that any appropriation of anything within it ceases.",
    "mn39": "One seeking to be a true ascetic and to realize the goal of the ascetic life must undertake the training laid down by the Buddha and progress through its various stages, never resting content with what has already been achieved.",
    "mn53": "To qualify as a “practicing trainee,” a noble disciple must possess various qualities, all of which are on the side of renunciation.",
    "mn61": "The purification of one's physical, verbal, and mental actions is done by repeatedly inspecting whether they are beneficial before, while, and after performing them; and acting accordingly.",
    "mn107": "The exposition of the gradual training, outlining a certain order of practice to achieve Nibbāna. Each stage addresses increasingly subtle defilements, which can only be recognized and properly dealt with once the coarser ones have been addressed. Disregarding this order is likely to lead one astray.",
    "sn1.1": "The Middle Way does not lie in “moderation” but in neither indulgence nor denial, transcending these limited perspectives of an ordinary person.",
    "sn12.67": "An exposition of dependent origination underlining how this principle does not describe a process across multiple lifetimes nor an complex sequence of “mind moments” in the present, but rather the simultaneous interdependence of two phenomena right here and now. Seeing this interdependence is how the entire mass of suffering ceases, and the right dispassion, rooted in understanding, is achieved.",
    "sn35.94": "One wanting to put an end to suffering must guard and restrain their senses. Not inclining towards the pleasant and away from the unpleasant, not proliferating over these aspects of perception, one trains to remain unwavering in the face of pressure.",
    "an5.24": "The path to liberation relies on distinct conditions, each establishing the foundation for the next, beginning with the cultivation of virtue.",
    "an5.114": "The Buddha encouraged beginners to establish themselves in five principles, none related to “meditation instructions” in the modern sense."
}
