{
    "dn10": "The Buddha taught, praised, and encouraged the three noble aggregates—Sīla, Samādhi, and Paññā—each serving as a necessary foundation for the development of the next.",
    "mn2": "The realization of the Dhamma is for one who, having developed and understood how to attend to phenomena with yoniso manasikāra, gives up influxes in seven distinct ways.",
    "mn16": "A trainee wishing to progress on the path should do away with ten impediments so that their mind may become fertile ground for achieving maturity in the Dhamma. With this foundation, they can develop composure and zeal—the final essential factors for attaining complete liberation and freedom from suffering.",
    "mn18": "The work of overcoming one's defilements does not depend on something outside of their control; no matter the circumstances one who has developed yoniso manasikāra can strive toward equanimity by attending to the besetting perceptions “in light of their origin”; being unmoved by them one has removed the need for indulgence and denial, they have achieved the Middle Way.",
    "mn19": "Fostering the context of danger and harm of unbeneficial thoughts, while also making efforts to not think along thoughts stemming from an arisen harmful mental state—and by doing so, inclining the mind in the opposite direction—is how one can bring about the “starvation” of hindrances and develop jhāna.",
    "mn22": "The actions the Buddha warned against as obstructive cannot be performed without there being a harmful mental state, the very root of suffering. The view that one can engage in such acts without impeding progress on the path to awakening is a pernicious misconception.",
    "mn24": "The path to Nibbāna progresses through successive stages of purification, each laying the foundation for the next, ultimately leading to the total cessation of assumption.",
    "mn38": "Misconceptions about dependent origination have the potential to entirely derail one's practice. It is not a temporal sequence of causes and effect but the discernment of a simultaneous interdependence of two phenomena in the present experience. It's about knowing the uncontrollable underlying foundation of one's experience while it is enduring so appropriation in regard to anything within it is ceases.",
    "mn39": "One seeking to be a true ascetic and to realize the goal of the ascetic life must undertake the training laid down by the Buddha and progress through its various stages, never resting content with what has already been achieved.",
    "mn53": "A noble disciple has to be endowed with various qualities to be a practicing trainee, all of which need to be fostered to progress in the practice, whether it’s towards stream-entry or towards Arahantship.",
    "mn61": "The purification of one's physical, verbal, and mental actions is done by repeatedly inspecting whether they are beneficial before, while, and after performing them; and acting accordingly.",
    "mn107": "The exposition of the gradual training, outlining a certain order of practice to achieve Nibbāna. Each stage addresses increasingly subtle defilements, which can only be recognized and properly dealt with once the coarser ones have been addressed. Disregarding this order is likely to lead one astray from the path the Buddha taught.",
    "sn1.1": "The Middle Way does not lie in “moderation” but in neither indulgence nor denial, transcending these limited perspectives that an ordinary person has toward phenomena.",
    "sn12.67": "An exposition of dependent origination underlining how this principle does not describe a process across multiple lifetimes nor “mind moments”, but rather the simultaneous interdependence of two phenomena right here and now—the very reason one has the possibility to uproot ownership over aspects of one's experience that are causes of suffering.",
    "sn35.94": "One wanting to put an end to suffering must guard and restrain their senses. Not inclining towards the pleasant and away from the unpleasant, not proliferating over these aspects of perception, one trains to remain unwavering in the face of pressure."
}
