{
    "dn10": "The Buddha taught, praised, and encouraged the three noble aggregates—<em>sīla, samādhi,</em> and <em>paññā</em>—each serving as a necessary foundation for the development of the next.",
    "mn2": "The realization of the Dhamma is for one who, having understood yoniso manasikāra, gives up seven kinds of influxes.",
    "mn16": "A trainee needs to abandon ten impediments to achieve maturity in the Dhamma. With this foundation, they can develop right composure (samādhi).",
    "mn18": "Having abandoned delight in that because of which perceptions arise—the sense organs and their counterparts—then one is from defilements even amidst those perceptions. This, and not focusing on an object, is how “proliferation” (<em>papañca</em>) is abandoned.",
    "mn19": "Fostering the context of danger and harm of unbeneficial thoughts—of sensuality, ill will, and cruelty—and by doing so inclining the mind in the opposite direction, is how you develop jhāna.",
    "mn22": "The Buddha strongly disparages the view that engaging in sensuality is not an impediment. He calls this view “pernicious” and, amidst an assembly of monks, intensely rebukes a monk who stubbornly adhered to it, causing him great embarrassment.",
    "mn24": "The path to Nibbāna progresses through successive stages of purification, each laying the foundation for the next, ultimately leading to the total cessation of assumption.",
    "mn38": "Dependent origination is not a temporal sequence of causes and effects but the discernment of a simultaneous interdependence of phenomena in the present experience.",
    "mn39": "One seeking to realize the goal of the contemplative life must work in stages, never resting content with what has already been achieved.",
    "mn53": "To qualify as a “practicing trainee,” a noble disciple must possess various qualities, all of which are on the side of renunciation.",
    "mn61": "Physical, verbal, and mental conduct are purified by repeatedly inspecting the intent behind your actions—before, while, and after performing them.",
    "mn107": "The practice must unfold in a certain order, beginning with strict adherence to the precepts. Ignoring this order is like skipping steps when building a staircase.",
    "sn1.1": "The Middle Way does not lie in “moderate” indulgence, but in abstinence from all indulgence and all denial.",
    "sn12.67": "An exposition of dependent origination underlining how it's not a process across multiple lifetimes nor a sequence of “mind moments” in the present, but rather the simultaneous interdependence of phenomena right here and now. Seeing this interdependence sufficiently is how the entire mass of suffering ceases.",
    "sn35.94": "Restraining one's sense desires is what leads to genuine, unconditional happiness. ",
    "sn35.246": "To tame the mind, one must recognize when it harbors passion, aversion, or carelessness in regard to any experience. Perceiving the danger in following such directions and abstaining from following them is how they subside.",
    "sn47.8": "The Buddha compares picking up the signs or “hints” of one's own mind with a skilled cook picking up the preferences dishes of his master. Without this discernment, a monk will fail to not only purify his mind from hindrances, but to be recollected-and-aware (*satisampajaññā*) in the right sense. ",
    "an3.63": "The four jhānas are not states of absorption. The Buddha recounts how he is able to walk, stand, sit, or lie down while dwelling in them. ",
    "an3.101": "Just as a gold panner would gradually remove ever finer impurities until only gold dust remains, so too should one dedicated to the higher mind focus on giving up the coarsest impurities that remain—misconduct of body, speech, and mind being the first.",
    "an4.162": "Whether your practice is pleasant or unpleasant is not a up to you, but depends on the degree of defilements you carry.",
    "an5.24": "The path to liberation relies on distinct conditions, each establishing the foundation for the next, beginning with the cultivation of virtue.",
    "an5.114": "The Buddha encouraged new monks to establish themselves in five principles, none related to “meditation” in the modern understanding.",
    "an6.68": "Delighting in company is an obstacle to liberation, as it blocks you from discerning your own mind, the precondition for Right View.",
    "an8.53": "The Buddha lists the eight aspects where Dhamma can be distinguished from non-Dhamma, and the right training from that which isn't.",
    "an9.41": "The first jhāna comes not from a special technique, but from reflecting on the perils of sensuality so that your mind ceases to delight in it completely and leaps at renunciation instead—by itself, just like it leapt at sensuality before."
}
