{
    "mn10:0.1": "Middle Discourses 10 ",
    "mn10:0.2": "Establishments of Recollection ",
    "mn10:1.1": "So I have heard. ",
    "mn10:1.2": "At one time the Buddha was staying in the land of the Kurus, near the Kuru town named Kammāsadhamma. ",
    "mn10:1.3": "There the Buddha addressed the bhikkhus, ",
    "mn10:1.4": "“Bhikkhus!” ",
    "mn10:1.5": "“Bhante,” they replied. ",
    "mn10:1.6": "The Buddha said this: ",
    "mn10:2.1": "“Bhikkhus, this is the converging path to: the purification of beings, getting past sorrow and lamentation, making an end of suffering and upset, accomplishing the method, and realizing Nibbāna, namely the four establishments of recollection. ",
    "mn10:3.1": "What four? ",
    "mn10:3.2": "What four? Here, a bhikkhu dwells contemplating a body within the body—ardent, aware, and recollected, having dispelled longing and upset regarding the world. ",
    "mn10:3.3": "He dwells contemplating a feeling within feelings —ardent, aware, and recollected, having dispelled longing and upset regarding the world. ",
    "mn10:3.4": "He dwells contemplating a mind within the mind—ardent, aware, and recollected, having dispelled longing and upset regarding the world. ",
    "mn10:3.5": "He dwells contemplating a phenomenon within phenomena—ardent, aware, and recollected, having dispelled longing and upset regarding the world. ",
    "mn10:3.6": " ",
    "mn10:4.0.1": "1. The Body ",
    "mn10:4.0.2": "1.1. Recollection of Breathing ",
    "mn10:4.1": "And how does a bhikkhu dwell contemplating a body within the body? ",
    "mn10:4.2": "Here, a bhikkhu—gone to a wilderness, or to the root of a tree, or to an empty hut—sits down cross-legged, sets his body straight, and establishes recollection at the fore. ",
    "mn10:4.3": "Recollected, he breathes in; recollected, he breathes out. ",
    "mn10:4.4": "Breathing in long he understands: ‘I’m breathing in long.’ Breathing out long he understands: ‘I’m breathing out long.’ ",
    "mn10:4.5": "Breathing in short he understands: ‘I’m breathing in short.’ Breathing out short he understands: ‘I’m breathing out short.’ ",
    "mn10:4.6": "He trains like this: ‘I’ll breathe in experiencing the whole body.’ He trains like this: ‘I’ll breathe out experiencing the whole body.’ ",
    "mn10:4.7": "He trains like this: ‘I’ll breathe in calming the bodily activity.’ He trains like this: ‘I’ll breathe out calming the bodily activity.’ ",
    "mn10:4.8": "Just as a skilled lathe worker or his apprentice, when making a long turn understands ‘I am making a long turn.’, or when making a short turn understands ‘I am making a short turn.’; so too, breathing in long, a bhikkhu understands ‘I am breathing in long’ … he trains like this: ‘I’ll breathe out calming the bodily activity.’ ",
    "mn10:4.9": " ",
    "mn10:4.10": " ",
    "mn10:4.11": " ",
    "mn10:5.1": "And so he dwells contemplating a body within the body internally, externally, and both internally and externally. ",
    "mn10:5.2": "He dwells contemplating the body as liable to rise, as liable to wane, and as liable to both rise and wane. ",
    "mn10:5.3": "Or the memory that ‘the body is there’ is established for him just to the extent necessary for knowledge and recollection. He dwells disengaged, not taking up anything in the world. ",
    "mn10:5.4": "That’s how a bhikkhu dwells contemplating a body within the body. ",
    "mn10:5.5": " ",
    "mn10:6.0": "1.2. The Postures ",
    "mn10:6.1": "Furthermore, when a bhikkhu is walking he understands: ‘I am walking.’ When standing he understands: ‘I am standing.’ When sitting he understands: ‘I am sitting.’ And when lying down he understands: ‘I am lying down.’ ",
    "mn10:6.2": "Whatever posture his body is in, he understands that. ",
    "mn10:7.1": "And so he dwells contemplating a body within the body internally, externally, and both internally and externally. ",
    "mn10:7.2": "He dwells contemplating the body as liable to rise, as liable to wane, and as liable to both rise and wane. ",
    "mn10:7.3": "Or the memory that ‘the body is there’ is established for him just to the extent necessary for knowledge and recollection. He dwells disengaged, not taking up anything in the world. ",
    "mn10:7.4": "That too is how a bhikkhu dwells contemplating a body within the body. ",
    "mn10:7.5": " ",
    "mn10:8.0": "1.3. Comprehension ",
    "mn10:8.1": "Furthermore, a bhikkhu acts with comprehension when going out and coming back; when looking ahead and aside; when bending and extending the limbs; when bearing the outer robe, bowl and robes; when eating, drinking, chewing, and tasting; when urinating and defecating; when walking, standing, sitting, sleeping, waking, speaking, and keeping silent. ",
    "mn10:9.1": "And so he dwells contemplating a body within the body internally … ",
    "mn10:9.2": "That too is how a bhikkhu dwells contemplating a body within the body. ",
    "mn10:9.3": " ",
    "mn10:10.0": "1.4. Non-beauty ",
    "mn10:10.1": "Furthermore, a bhikkhu reflects on his own body, up from the soles of the feet, and down from the tips of the hairs, as full of many kinds of impure things surrounded by skin. ",
    "mn10:10.2": "‘In this body there is head hair, body hair, nails, teeth, skin, flesh, sinews, bones, bone marrow, kidneys, heart, liver, diaphragm, spleen, lungs, intestines, mesentery, undigested food, feces, bile, phlegm, pus, blood, sweat, fat, tears, grease, saliva, snot, synovial fluid, urine.’ ",
    "mn10:10.3": "It’s as if there were a bag with openings at both ends, filled with various kinds of grains, such as fine rice, wheat, mung beans, peas, sesame, and ordinary rice. And someone with clear vision were to open it and reflect on the contents: ‘These grains are fine rice, these are wheat, these are mung beans, these are peas, these are sesame, and these are ordinary rice.’ ",
    "mn10:10.4": " ",
    "mn10:10.5": " ",
    "mn10:11.1": "And so he dwells contemplating a body within the body internally … ",
    "mn10:11.2": "That too is how a bhikkhu dwells contemplating a body within the body. ",
    "mn10:11.3": " ",
    "mn10:12.0": "1.5. The Elements ",
    "mn10:12.1": "Furthermore, a bhikkhu reflects on his own body, regardless of its placement or posture, according to the elements: ",
    "mn10:12.2": "‘In this body there is the earth element, the water element, the fire element, and the air element.’ ",
    "mn10:12.3": "It’s as if a skilled butcher or butcher’s apprentice were to kill a cow and sit down at the crossroads with the meat cut into portions. ",
    "mn10:12.4": " ",
    "mn10:12.5": " ",
    "mn10:13.1": "And so he dwells contemplating a body within the body internally … ",
    "mn10:13.2": "That too is how a bhikkhu dwells contemplating a body within the body. ",
    "mn10:13.3": " ",
    "mn10:14.0": "1.6. The Charnel Ground Contemplations ",
    "mn10:14.1": "Furthermore, suppose a bhikkhu were to see a corpse discarded in a charnel ground. And it had been dead for one, two, or three days, bloated, livid, and festering. ",
    "mn10:14.2": "He’d compare it with his own body: ",
    "mn10:14.3": "‘This body is also of that same nature, that same kind, and cannot go beyond that.’ ",
    "mn10:15.1": "And so he dwells contemplating a body within the body internally … ",
    "mn10:15.2": "That too is how a bhikkhu dwells contemplating a body within the body. ",
    "mn10:16.1": "Furthermore, suppose he were to see a corpse discarded in a charnel ground being devoured by crows, hawks, vultures, herons, dogs, tigers, leopards, jackals, and many kinds of little creatures. ",
    "mn10:16.2": "He’d compare it with his own body: ",
    "mn10:16.3": "‘This body is also of that same nature, that same kind, and cannot go beyond that.’ ",
    "mn10:17.1": "And so he dwells contemplating a body within the body internally … ",
    "mn10:17.2": "That too is how a bhikkhu dwells contemplating a body within the body. ",
    "mn10:18-23.1": "Furthermore, suppose he were to see a corpse discarded in a charnel ground, a skeleton with flesh and blood, held together by sinews … ",
    "mn10:18-23.2": "A skeleton without flesh but smeared with blood, and held together by sinews … ",
    "mn10:18-23.3": "A skeleton rid of flesh and blood, held together by sinews … ",
    "mn10:24.1": "Bones rid of sinews scattered in every direction. Here a hand-bone, there a foot-bone, here a shin-bone, there a thigh-bone, here a hip-bone, there a rib-bone, here a back-bone, there an arm-bone, here a neck-bone, there a jaw-bone, here a tooth, there the skull … ",
    "mn10:24.2": " ",
    "mn10:24.3": " ",
    "mn10:25.1": " ",
    "mn10:25.2": " ",
    "mn10:26-28.1": "White bones, the color of shells … ",
    "mn10:29.1": "Decrepit bones, heaped in a pile … ",
    "mn10:30.1": "Bones rotted and crumbled to powder. ",
    "mn10:30.2": "He’d compare it with his own body: ",
    "mn10:30.3": "‘This body is also of that same nature, that same kind, and cannot go beyond that.’ ",
    "mn10:31.1": "And so he dwells contemplating a body within the body internally, externally, and both internally and externally. ",
    "mn10:31.2": "He dwells contemplating the body as liable to rise, as liable to wane, and as liable to both rise and wane. ",
    "mn10:31.3": "Or the memory that ‘the body is there’ is established for him just to the extent necessary for knowledge and recollection. He dwells disengaged, not taking up anything in the world. ",
    "mn10:31.4": "That too is how a bhikkhu dwells contemplating a body within the body. ",
    "mn10:31.5": " ",
    "mn10:31.6": " ",
    "mn10:32.0": "2.  Feelings ",
    "mn10:32.1": "And how does a bhikkhu dwell contemplating a feeling within feelings? ",
    "mn10:32.2": "Here, a bhikkhu who feels a pleasant feeling understands: ‘I feel a pleasant feeling.’ ",
    "mn10:32.3": "When he feels an unpleasant feeling, he understands: ‘I feel an unpleasant feeling.’ ",
    "mn10:32.4": "When he feels a neither-pleasant-nor-unpleasant feeling, he understands: ‘I feel a neither-pleasant-nor-unpleasant feeling.’ ",
    "mn10:32.5": "When he feels a mundane pleasant feeling, he understands: ‘I feel a mundane pleasant feeling .’ ",
    "mn10:32.6": "When he feels a supramundane pleasant feeling, he understands: ‘I feel a supramundane pleasant feeling.’ ",
    "mn10:32.7": "When he feels a mundane unpleasant feeling, he understands: ‘I feel a supramundane unpleasant feeling.’ ",
    "mn10:32.8": "When he feels a supramundane unpleasant feeling, he understands: ‘I feel a supramundane unpleasant feeling.’ ",
    "mn10:32.9": "When he feels a mundane neither-pleasant-nor-unpleasant feeling, he understands: ‘I feel a mundane neither-pleasant-nor-unpleasant feeling.’ ",
    "mn10:32.10": "When he feels a supramundane neither-pleasant-nor-unpleasant feeling, he understands: ‘I feel a supramundane neither-pleasant-nor-unpleasant feeling.’ ",
    "mn10:33.1": "And so he dwells contemplating a feeling within feelings internally, externally, and both internally and externally. ",
    "mn10:33.2": "He dwells contemplating feelings as liable to rise, as liable to wane, and as liable to both rise and wane. ",
    "mn10:33.3": "Or the memory that ‘feeling is there’ is established for him just to the extent necessary for knowledge and recollection. He dwells disengaged, not taking up anything in the world. ",
    "mn10:33.4": "That’s how a bhikkhu dwells contemplating a feeling within feelings. ",
    "mn10:33.5": " ",
    "mn10:34.0": "3.  Mind ",
    "mn10:34.1": "And how does a bhikkhu dwell contemplating a mind within the mind? ",
    "mn10:34.2": "Here, a bhikkhu understands mind with passion as ‘mind with passion,’ ",
    "mn10:34.3": "and mind without passion as ‘mind without passion.’ ",
    "mn10:34.4": "He understands mind with aversion as ‘mind with aversion,’ ",
    "mn10:34.5": "and mind without aversion as ‘mind without aversion.’ ",
    "mn10:34.6": "He understands mind with muddledness as ‘mind with muddledness,’ ",
    "mn10:34.7": "and mind without muddledness as ‘mind without muddledness.’ ",
    "mn10:34.8": "He understands constricted mind as ‘constricted mind,’ ",
    "mn10:34.9": "and scattered mind as ‘scattered mind.’ ",
    "mn10:34.10": "He understands expansive mind as ‘expansive mind,’ ",
    "mn10:34.11": "and unexpansive mind as ‘unexpansive mind.’ ",
    "mn10:34.12": "He understands mind that is not supreme as ‘mind that is not supreme,’ ",
    "mn10:34.13": "and mind that is supreme as ‘mind that is supreme.’ ",
    "mn10:34.14": "He understands mind composed as ‘mind composed,’ ",
    "mn10:34.15": "and mind not composed as ‘mind not composed.’ ",
    "mn10:34.16": "He understands freed mind as ‘freed mind,’ ",
    "mn10:34.17": "and unfreed mind as ‘unfreed mind.’ ",
    "mn10:35.1": "And so he dwells contemplating a mind within the mind internally, externally, and both internally and externally. ",
    "mn10:35.2": "He dwells contemplating the mind as liable to rise, as liable to wane, and as liable to both rise and wane. ",
    "mn10:35.3": "Or the memory that ‘the mind is there’ is established for him just to the extent necessary for knowledge and recollection. He dwells disengaged, not taking up anything in the world. ",
    "mn10:35.4": "That’s how a bhikkhu dwells contemplating a mind within the mind. ",
    "mn10:35.5": " ",
    "mn10:36.0.1": "4. Phenomena ",
    "mn10:36.0.2": "4.1. The Hindrances ",
    "mn10:36.1": "And how does a bhikkhu dwell contemplating a phenomenon within phenomena? ",
    "mn10:36.2": "Here, a bhikkhu dwells contemplating a phenomenon within phenomena with regard to the five hindrances. ",
    "mn10:36.3": "And how does a bhikkhu dwell contemplating a phenomenon within phenomena with regard to the five hindrances? ",
    "mn10:36.4": "Here, a bhikkhu, when there is sense desire internally, understands ‘There is sense desire internally for me.’ When there is no sense desire internally, he understands ‘There is no sense desire internally for me.’ He understands how sense desire arises; how, when it’s already arisen, it’s given up; and how, once it’s given up, it doesn’t arise again in the future. ",
    "mn10:36.5": "When there is aversion internally, understands ‘There is aversion internally for me.’ When there is no aversion internally, he understands: ‘There is no aversion internally for me.’ He understands how aversion arises; how, when it’s already arisen, it’s given up; and how, once it’s given up, it doesn’t arise again in the future. ",
    "mn10:36.6": "When there is sluggishness and lethargy internally, understands ‘There is sluggishness and lethargy internally for me.’ When there is no sluggishness and lethargy internally, he understands, ‘There is no sluggishness and lethargy internally for me.’ He understands how sluggishness and lethargy arises; how, when it’s already arisen, it’s given up; and how, once it’s given up, it doesn’t arise again in the future. ",
    "mn10:36.7": "When there is restlessness and anxiety internally, understands ‘there is restlessness and anxiety internally for me.’ When there is no restlessness and anxiety internally, he understands: ‘There is no restlessness and anxiety internally for me.’ He understands how restlessness and anxiety arises; how, when it’s already arisen, it’s given up; and how, once it’s given up, it doesn’t arise again in the future. ",
    "mn10:36.8": "When there is doubt internally, understands ‘There is doubt internally for me.’ When there is no doubt internally, he understands: ‘There is no doubt internally for me.’ He understands how doubt arises; how, when it’s already arisen, it’s given up; and how, once it’s given up, it doesn’t arise again in the future. ",
    "mn10:37.1": "And so he dwells contemplating a phenomenon within phenomena internally, externally, and both internally and externally. ",
    "mn10:37.2": "He dwells contemplating phenomena as liable to rise, as liable to wane, and as liable to both rise and wane. ",
    "mn10:37.3": "Or the memory that ‘phenomena are there’ is established for him just to the extent necessary for knowledge and recollection. He dwells disengaged, not taking up anything in the world. ",
    "mn10:37.4": "That’s how a bhikkhu dwells contemplating a phenomenon within phenomena with respect to the five hindrances. ",
    "mn10:37.5": " ",
    "mn10:38.0": "4.2. The Aggregates ",
    "mn10:38.1": "Furthermore, a bhikkhu dwells contemplating a phenomenon within phenomena with respect to the five-assumption-aggregates. ",
    "mn10:38.2": "And how does a bhikkhu dwell contemplating a phenomenon within phenomena with respect to the five-assumption-aggregates? ",
    "mn10:38.3": "Here, a bhikkhu sees: ",
    "mn10:38.4": "‘Such is form, such is the origin of form, such is the ending of form. ",
    "mn10:38.5": "Such is feeling, such is the origin of feeling, such is the ending of feeling. ",
    "mn10:38.6": "Such is perception, such is the origin of perception, such is the ending of perception. ",
    "mn10:38.7": "Such are activities, such is the origin of activities, such is the ending of activities. ",
    "mn10:38.8": "Such is consciousness, such is the origin of consciousness, such is the ending of consciousness.’ ",
    "mn10:39.1": "And so he dwells contemplating a phenomenon within phenomena internally … ",
    "mn10:39.2": " ",
    "mn10:39.3": " ",
    "mn10:39.4": "That’s how a bhikkhu dwells contemplating a phenomenon within phenomena with respect to the five-assumption-aggregates. ",
    "mn10:39.5": " ",
    "mn10:40.0": "4.3. The Sense Fields ",
    "mn10:40.1": "Furthermore, a bhikkhu dwells contemplating a phenomenon within phenomena with respect to the six internal and external sense fields. ",
    "mn10:40.2": "And how does a bhikkhu dwell contemplating a phenomenon within phenomena with respect to the six internal and external sense fields? ",
    "mn10:40.3": "Here, a bhikkhu understands the eye, sights, and the fetter that arises dependent on both of these. He understands how the fetter that has not arisen comes to arise; how the arisen fetter comes to be abandoned; and how the abandoned fetter comes to not rise again in the future. ",
    "mn10:40.4": "He understands the ear, sounds, and the fetter … ",
    "mn10:40.5": "He understands the nose, smells, and the fetter … ",
    "mn10:40.6": "He understands the tongue, tastes, and the fetter … ",
    "mn10:40.7": "He understands the body, touches, and the fetter … ",
    "mn10:40.8": "He understands the mind-sense, phenomena, and the fetter that arises dependent on both of these. He understands how the fetter that has not arisen comes to arise; how the arisen fetter comes to be abandoned; and how the abandoned fetter comes to not rise again in the future. ",
    "mn10:41.1": "And so he dwells contemplating a phenomenon within phenomena internally … ",
    "mn10:41.2": " ",
    "mn10:41.3": " ",
    "mn10:41.4": "That’s how a bhikkhu dwells contemplating a phenomenon within phenomena with respect to the six internal and external sense fields. ",
    "mn10:41.5": " ",
    "mn10:42.0": "4.4. The Awakening Factors ",
    "mn10:42.1": "Furthermore, a bhikkhu dwells contemplating a phenomenon within phenomena with respect to the seven awakening factors. ",
    "mn10:42.2": "And how does a bhikkhu dwell contemplating a phenomenon within phenomena with respect to the seven awakening factors? ",
    "mn10:42.3": "Here, when the awakening factor of recollection is present internally, a bhikkhu understands: ‘There is the awakening factor of recollection internally for me.’ When the awakening factor of recollection is absent internally, he understands: ‘There is no awakening factor of recollection internally for me.’ He understands how the awakening factor of recollection that has not arisen comes to arise; and how the awakening factor of recollection that has arisen becomes fulfilled by development. ",
    "mn10:42.4": "When he has the awakening factor of investigation of phenomena … ",
    "mn10:42.5": "effort … ",
    "mn10:42.6": "joy … ",
    "mn10:42.7": "calm … ",
    "mn10:42.8": "composure … ",
    "mn10:42.9": "equanimity in him, he understands: ‘There is the awakening factor of equanimity internally for me.’ When the awakening factor of equanimity is absent internally, he understands: ‘There is no awakening factor of equanimity internally for me.’ He understands how the awakening factor of equanimity that has not arisen comes to arise; and how the awakening factor of equanimity that has arisen becomes fulfilled by development. ",
    "mn10:43.1": "And so he dwells contemplating a phenomenon within phenomena internally, externally, and both internally and externally. ",
    "mn10:43.2": "He dwells contemplating phenomena as liable to rise, as liable to wane, and as liable to both rise and wane. ",
    "mn10:43.3": "Or the memory that ‘phenomena are there’ is established for him just to the extent necessary for knowledge and recollection. He dwells disengaged, not taking up anything in the world. ",
    "mn10:43.4": "That’s how a bhikkhu dwells contemplating a phenomenon within phenomena with respect to the seven awakening factors. ",
    "mn10:43.5": " ",
    "mn10:44.0": "4.5. The Truths ",
    "mn10:44.1": "Furthermore, a bhikkhu dwells contemplating a phenomenon within phenomena with respect to the four noble truths. ",
    "mn10:44.2": "And how does a bhikkhu dwell contemplating a phenomenon within phenomena with respect to the four noble truths? ",
    "mn10:44.3": "Here, a bhikkhu understands as it is: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering.’ ",
    "mn10:45.1": "And so he dwells contemplating a phenomenon within phenomena internally, externally, and both internally and externally. ",
    "mn10:45.2": "He dwells contemplating phenomena as liable to rise, as liable to wane, and as liable to both rise and wane. ",
    "mn10:45.3": "Or the memory that ‘phenomena are there’ is established for him just to the extent necessary for knowledge and recollection. He dwells disengaged, not taking up anything in the world. ",
    "mn10:45.4": "That’s how a bhikkhu dwells contemplating a phenomenon within phenomena with respect to the four noble truths. ",
    "mn10:45.5": " ",
    "mn10:45.6": " ",
    "mn10:46.1": "Anyone who develops these four establishments of recollection in this way for seven years can expect one of two results: ",
    "mn10:46.2": "ultimate knowledge in the present life, or if there’s a residue, non-return. ",
    "mn10:46.3": "Let alone seven years, ",
    "mn10:46.4": "anyone who develops these four establishments of recollection in this way for six years … ",
    "mn10:46.5": "five years … ",
    "mn10:46.6": "four years … ",
    "mn10:46.7": "three years … ",
    "mn10:46.8": "two years … ",
    "mn10:46.9": "one year … ",
    "mn10:46.10": " ",
    "mn10:46.11": "seven months … ",
    "mn10:46.12": " ",
    "mn10:46.13": " ",
    "mn10:46.14": "six months … ",
    "mn10:46.15": "five months … ",
    "mn10:46.16": "four months … ",
    "mn10:46.17": "three months … ",
    "mn10:46.18": "two months … ",
    "mn10:46.19": "one month … ",
    "mn10:46.20": "a fortnight … ",
    "mn10:46.21": "Let alone a fortnight, ",
    "mn10:46.22": "anyone who develops these four establishments of recollection in this way for seven days can expect one of two results: ",
    "mn10:46.23": "ultimate knowledge in the present life, or if there’s a residue, non-return. ",
    "mn10:47.1": "‘Bhikkhus, this is the converging path to: the purification of beings, getting past sorrow and lamentation, making an end of suffering and upset, accomplishing the method, and realizing Nibbāna, namely the four establishments of recollection. ’ ",
    "mn10:47.2": "That’s what I said, and this is why I said it.” ",
    "mn10:47.3": "That is what the Buddha said. ",
    "mn10:47.4": "Satisfied, the bhikkhus delighted in what the Buddha said. ",
    "mn10:47.5": " ",
    "mn10:47.6": " ",
    "mn10:48.1": " ",
    "mn10:48.2": " ",
    "mn10:48.3": " "
}