{
    "mn16:0.1": "Middle Discourses 16 ",
    "mn16:0.2": "Obstinacies ",
    "mn16:1.1": "So I have heard. ",
    "mn16:1.2": "At one time the Buddha was staying near Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s monastery. ",
    "mn16:1.3": "There the Buddha addressed the bhikkhus, ",
    "mn16:1.4": "“Bhikkhus!” ",
    "mn16:1.5": "“Bhante,” they replied. ",
    "mn16:1.6": "The Buddha said this: ",
    "mn16:2.1": "“Bhikkhus, when a bhikkhu has not given up five obstinacies and cut off five shackles of mind, it’s not possible for them to achieve growth, improvement, or maturity in this teaching and training. ",
    "mn16:3.1": "What are the five obstinacies he hasn’t given up? ",
    "mn16:3.2": "Firstly, a bhikkhu has doubts about the Teacher. He’s uncertain, undecided, and lacking confidence. ",
    "mn16:3.3": "This being so, his mind doesn’t incline to ardency, dedication, persistence, and striving. ",
    "mn16:3.4": "This is the first obstinacy he hasn’t given up. ",
    "mn16:4.1": "Furthermore, a bhikkhu has doubts about the Dhamma … ",
    "mn16:4.2": "This is the second obstinacy. ",
    "mn16:5.1": "He has doubts about the Saṅgha … ",
    "mn16:5.2": "This is the third obstinacy. ",
    "mn16:6.1": "He has doubts about the training … ",
    "mn16:6.2": " ",
    "mn16:6.3": "This is the fourth obstinacy. ",
    "mn16:7.1": "Furthermore, a bhikkhu is angry and upset with his spiritual companions, resentful and obstinate. ",
    "mn16:7.2": "This being so, his mind doesn’t incline to ardency, dedication, persistence, and striving. ",
    "mn16:7.3": "This is the fifth obstinacy he hasn’t given up. ",
    "mn16:7.4": "These are the five obstinacies he hasn’t given up. ",
    "mn16:8.1": "What are the five shackles of mind he hasn’t cut off? ",
    "mn16:8.2": "Firstly, a bhikkhu isn’t free from passion, desire, fondness, thirst, burning, and craving for sensuality. ",
    "mn16:8.3": "This being so, his mind doesn’t incline to ardency, dedication, persistence, and striving. ",
    "mn16:8.4": "This is the first shackle of mind he hasn’t cut off. ",
    "mn16:9.1": "Furthermore, a bhikkhu isn’t free from passion for the body … ",
    "mn16:9.2": "This is the second shackle of mind. ",
    "mn16:10.1": "Furthermore, a bhikkhu isn’t free from passion for form … ",
    "mn16:10.2": "This is the third shackle of mind. ",
    "mn16:11.1": "He eats as much as he likes until his belly is full, then indulges in the sensuality of sleeping, lying down, and drowsing … ",
    "mn16:11.2": " ",
    "mn16:11.3": "This is the fourth shackle of mind. ",
    "mn16:12.1": "He leads the spiritual life for the sake of a certain heavenly existence, thinking: ‘By this precept or observance or fervent austerity or spiritual life, may I become one of the gods!’ ",
    "mn16:12.2": "This being so, his mind doesn’t incline to ardency, dedication, persistence, and striving. ",
    "mn16:12.3": "This is the fifth shackle of mind he hasn’t cut off. ",
    "mn16:12.4": "These are the five shackles of mind he hasn’t cut off. ",
    "mn16:13.1": "When a bhikkhu has not given up these five obstinacies and cut off these five shackles of mind, it’s not possible for him to achieve growth, improvement, or maturity in this teaching and training. ",
    "mn16:14.1": "When a bhikkhu has given up these five obstinacies and cut off these five shackles of mind, it is possible for him to achieve growth, improvement, and maturity in this teaching and training. ",
    "mn16:15.1": "What are the five obstinacies he’s given up? ",
    "mn16:15.2": "Firstly, a bhikkhu has no doubts about the Teacher. He’s not uncertain, undecided, or lacking confidence. ",
    "mn16:15.3": "This being so, his mind inclines to ardency, dedication, persistence, and striving. ",
    "mn16:15.4": "This is the first obstinacy he’s given up. ",
    "mn16:16.1": "Furthermore, a bhikkhu has no doubts about the Dhamma … ",
    "mn16:16.2": " ",
    "mn16:17.1": "He has no doubts about the Saṅgha … ",
    "mn16:17.2": " ",
    "mn16:18.1": "He has no doubts about the training … ",
    "mn16:18.2": " ",
    "mn16:19.1": "He’s not angry and upset with his spiritual companions, not resentful or closed off. ",
    "mn16:19.2": "This being so, his mind inclines to ardency, dedication, persistence, and striving. ",
    "mn16:19.3": "This is the fifth obstinacy he’s given up. ",
    "mn16:19.4": "These are the five obstinacies he’s given up. ",
    "mn16:20.1": "What are the five shackles of mind he’s cut off? ",
    "mn16:20.2": "Firstly, a bhikkhu is free from passion, desire, fondness, thirst, burning, and craving for sensuality. ",
    "mn16:20.3": "This being so, his mind inclines to ardency, zeal, persistence, and striving. ",
    "mn16:20.4": "This is the first shackle of mind he’s cut off. ",
    "mn16:21.1": "Furthermore, a bhikkhu is rid of passion for the body … ",
    "mn16:22.1": "He’s rid of passion for form … ",
    "mn16:23.1": "He doesn’t eat as much as he likes  until his belly is full, then indulge in the sensuality of sleeping, lying down, and drowsing … ",
    "mn16:23.2": " ",
    "mn16:23.3": " ",
    "mn16:24.1": "He doesn’t lead the spiritual life for the sake of a certain heavenly existence, thinking: ‘By this precept or observance or fervent austerity or spiritual life, may I become one of the gods!’ ",
    "mn16:24.2": "This being so, his mind inclines to ardency, dedication, persistence, and striving. ",
    "mn16:24.3": "This is the fifth shackle of mind he’s cut off. ",
    "mn16:24.4": "These are the five shackles of mind he’s cut off. ",
    "mn16:25.1": "When a bhikkhu has given up these five obstinacies and cut off these five shackles of mind, it is possible for them to achieve growth, improvement, or maturity in this teaching and training. ",
    "mn16:26.1": "He develops the basis of spiritual ability that has composure due to interest, together with active striving … ",
    "mn16:26.2": "the basis of spiritual ability that has composure due to effort, together with active striving … ",
    "mn16:26.3": "the basis of spiritual ability that has composure due to intent, together with active striving … ",
    "mn16:26.4": "the basis of spiritual ability that has composure due to investigation, together with active striving. And the fifth is simply zeal. ",
    "mn16:27.1": "A bhikkhu who possesses these fifteen factors, including zeal, is capable of breaking out, becoming awakened, and reaching the supreme sanctuary from the yoke. ",
    "mn16:27.2": "Suppose there was a chicken with eight or ten or twelve eggs. ",
    "mn16:27.3": "And she properly sat on them to keep them warm and incubated. ",
    "mn16:27.4": "Even if that chicken doesn’t wish: ",
    "mn16:27.5": "‘If only my chicks could break out of the eggshell with their claws and beak and hatch safely!’ ",
    "mn16:27.6": "Still they can break out and hatch safely. ",
    "mn16:27.7": "In the same way, a bhikkhu who possesses these fifteen factors, including zeal, is capable of breaking out, becoming awakened, and reaching the supreme sanctuary from the yoke.” ",
    "mn16:27.8": "That is what the Buddha said. ",
    "mn16:27.9": "Satisfied, the bhikkhus delighted in what the Buddha said. "
}