{
  "an3.63:0.1": "Numbered Discourses 3.63 ",
  "an3.63:0.2": "7. The Great Chapter ",
  "an3.63:0.3": "At Venāgapura ",
  "an3.63:1.1": "At one time the Buddha was wandering in the land of the Kosalans together with a large Saṅgha of bhikkhus when he arrived at a village of the Kosalan brahmins named Venāgapura. ",
  "an3.63:1.2": "The brahmins and householders of Venāgapura heard: ",
  "an3.63:1.3": "“It seems the ascetic Gotama—a Sakyan, gone forth from a Sakyan family—has arrived at Venāgapura. ",
  "an3.63:1.4": "He has this good reputation: ",
  "an3.63:1.5": "‘That Auspicious One is an Arahant, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed.’ ",
  "an3.63:1.6": "Having for himself comprehended and experienced this world—with its gods, Māras and Brahmās, this population with its ascetics and brahmins, gods and humans—he makes it known to others. ",
  "an3.63:1.7": "He teaches a Dhamma that’s good in the beginning, good in the middle, and good in the end, meaningful and well-phrased. And he reveals a renunciate life that’s entirely complete and pure. ",
  "an3.63:1.8": "It’s good to see such Arahants.” ",
  "an3.63:2.1": "Then the brahmins and householders of Venāgapura went up to the Buddha. Before sitting down to one side, some bowed, some exchanged pleasantries, some held up their joined palms toward the Buddha, some announced their name and clan, while some kept silent. Seated to one side they said to the Buddha: ",
  "an3.63:3.1": "“It is remarkable, Master Gotama, it is extraordinary, ",
  "an3.63:3.2": "how your faculties are so very clear, and the complexion of your skin is pure and bright. ",
  "an3.63:3.3": "It’s like a golden brown jujube in the autumn, ",
  "an3.63:3.4": "",
  "an3.63:3.5": "or a palm fruit freshly plucked from the stalk, ",
  "an3.63:3.6": "",
  "an3.63:3.7": "or a pendant of river gold, fashioned by a deft smith, well-wrought in the forge, and placed on a cream rug where it shines and glows and radiates. ",
  "an3.63:3.8": "In the same way, your faculties are so very clear, and the complexion of your skin is pure and bright. ",
  "an3.63:3.9": "Surely Master Gotama gets when he wants, without trouble or difficulty, various kinds of high and luxurious bedding, such as: ",
  "an3.63:3.10": "sofas, couches, woolen covers—shag-piled, colorful, white, embroidered with flowers, quilted, embroidered with animals, double-or single-fringed—and silk covers studded with gems, as well as silken sheets, woven carpets, rugs for elephants, horses, or chariots, antelope hide rugs, and spreads of fine deer hide, with a canopy above and red cushions at both ends.” ",
  "an3.63:4.1": "“Brahmin, these various kinds of high and luxurious bedding ",
  "an3.63:4.2": "",
  "an3.63:4.3": "are hard for renunciates to find. And even if they do get them, they’re not allowed. ",
  "an3.63:5.1": "There are, brahmin, these three high and luxurious beds that I get these days when I want, without trouble or difficulty. ",
  "an3.63:5.2": "What three? ",
  "an3.63:5.3": "The divine high and luxurious bed, the godly high and luxurious bed, and the noble high and luxurious bed. ",
  "an3.63:5.4": "These are the three high and luxurious beds that I get these days when I want, without trouble or difficulty.” ",
  "an3.63:6.1": "“But what, Master Gotama, is the heavenly high and luxurious bed?” ",
  "an3.63:6.2": "“Brahmin, when I am living supported by a village or town, I robe up in the morning and, taking my bowl and robe, enter the town or village for alms. ",
  "an3.63:6.3": "After the meal, on my return from almsround, I enter within a forest. ",
  "an3.63:6.4": "I gather up some grass or leaves into a pile and sit down cross-legged, setting my body straight, and establishing recollection at the fore. ",
  "an3.63:6.5": "Having thoroughly withdrawn from sensuality, having withdrawn from unbeneficial phenomena, with thinking and with pondering, with joy and ease born of withdrawal, I abide having entered upon the first jhāna. ",
  "an3.63:6.6": "With the appeasement of thinking and pondering, with internal confidence and collectedness of mind, without thinking or pondering and with joy and ease born of composure, I abide having entered upon the second jhāna. ",
  "an3.63:6.7": "With the fading of joy, I abide equanimous, recollected, and aware, experiencing ease with the body. I abide having entered upon the third jhāna, with regard to which the noble ones say “one abides equanimous, recollected, and at ease.” ",
  "an3.63:6.8": "With the giving up of ease and unease—and with the ending of joys and upsets beforehand—without ease or unease, with purity of equanimity and recollection, I abide having entered upon the fourth jhāna. ",
  "an3.63:6.9": "If while I am like this I walk, at that time my walking is divine. ",
  "an3.63:6.10": "If while I am like this I stand, at that time my standing is divine. ",
  "an3.63:6.11": "If while I am like this I sit, at that time my sitting is divine. ",
  "an3.63:6.12": "If while I am like this I lie down, at that time my lying down is divine. ",
  "an3.63:6.13": "This is the heavenly high and luxurious bed that I get these days when I want, without trouble or difficulty.” ",
  "an3.63:7.1": "“It is remarkable, Master Gotama, it is extraordinary! ",
  "an3.63:7.2": "Who but Master Gotama could get such a divine high and luxurious bed when he wants, without trouble or difficulty? ",
  "an3.63:8.1": "But what, Master Gotama, is the godly high and luxurious bed?” ",
  "an3.63:8.2": "“Brahmin, when I am living supported by a village or town, I robe up in the morning and, taking my bowl and robe, enter the town or village for alms. ",
  "an3.63:8.3": "After the meal, on my return from almsround, I enter within a forest. ",
  "an3.63:8.4": "I gather up some grass or leaves into a pile and sit down cross-legged, setting my body straight, and establishing recollection at the fore. ",
  "an3.63:8.5": "I abide having pervaded with a mind of friendliness the first direction, likewise second, likewise third, likewise the fourth. In the same way above, below, across, everywhere, I abide having pervaded the whole world with a mind of friendliness—abundant, expansive, immeasurable, free of enmity and ill will. ",
  "an3.63:8.6": "I abide having pervaded with a mind of compassion … ",
  "an3.63:8.7": "a mind of contentment … ",
  "an3.63:8.8": "I abide having pervaded with a mind of equanimity the first direction, likewise the second, likewise the third, likewise the fourth. In the same way above, below, across, everywhere, I abide having pervaded the whole world with a mind of equanimity—abundant, expansive, immeasurable, free of enmity and ill will. ",
  "an3.63:8.9": "If while I am like this I walk, at that time my walking is godly. ",
  "an3.63:8.10": "… my standing is godly. ",
  "an3.63:8.11": "… my sitting is godly. ",
  "an3.63:8.12": "If while I am like this I lie down, at that time my lying down is godly. ",
  "an3.63:8.13": "This is the godly high and luxurious bed that I get these days when I want, without trouble or difficulty.” ",
  "an3.63:9.1": "“It is remarkable, Master Gotama, it is extraordinary! ",
  "an3.63:9.2": "Who but Master Gotama could get such a godly high and luxurious bed when he wants, without trouble or difficulty? ",
  "an3.63:10.1": "“But what, Master Gotama, is the noble high and luxurious bed?” ",
  "an3.63:10.2": "“Brahmin, when I am living supported by a village or town, I robe up in the morning and, taking my bowl and robe, enter the town or village for alms. ",
  "an3.63:10.3": "After the meal, on my return from almsround, I enter within a forest. ",
  "an3.63:10.4": "I gather up some grass or leaves into a pile and sit down cross-legged, setting my body straight, and establishing recollection at the fore. ",
  "an3.63:10.5": "I know this: ",
  "an3.63:10.6": "‘I’ve given up passion, cut it off at the root, made it like a palm stump, and obliterated it, so it’s unable to arise in the future.’ ",
  "an3.63:10.7": "‘I’ve given up aversion, cut it off at the root, made it like a palm stump, and obliterated it, so it’s unable to arise in the future.’ ",
  "an3.63:10.8": "‘I’ve given up muddledness, cut it off at the root, made it like a palm stump, and obliterated it, so it’s unable to arise in the future.’ ",
  "an3.63:10.9": "If while I am like this I walk, at that time my walking is noble. ",
  "an3.63:10.10": "… my standing is noble. ",
  "an3.63:10.11": "… my sitting is noble. ",
  "an3.63:10.12": "If while I am like this I lie down, at that time my lying down is noble. ",
  "an3.63:10.13": "This is the noble high and luxurious bed that I get these days when I want, without trouble or difficulty.” ",
  "an3.63:11.1": "“It is remarkable, Master Gotama, it is extraordinary! ",
  "an3.63:11.2": "Who but Master Gotama could get such a noble high and luxurious bed when he wants, without trouble or difficulty? ",
  "an3.63:12.1": "Excellent, Master Gotama! Excellent! ",
  "an3.63:12.2": "As if he were righting the overturned, or revealing the hidden, or pointing out the path to the lost, or lighting a lamp in the dark so people with clear eyes can see what’s there, Master Gotama has made the teaching clear in many ways. ",
  "an3.63:12.3": "We go for refuge to Master Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. ",
  "an3.63:12.4": "From this day forth, may Master Gotama remember us as lay followers who have gone for refuge for life.” "
}