{
    "an3.109:0.1": "Numbered Discourses 3.109 ",
    "an3.109:0.2": "11. Awakening ",
    "an3.109:0.3": "Unguarded ",
    "an3.109:1.1": "Then the householder Anāthapiṇḍika approached the Auspicious One, bowed, and sat down to one side. The Auspicious One said to him: ",
    "an3.109:1.2": "“Householder, when the <em>citta</em> is unguarded, actions of body, speech, and thought are unguarded. ",
    "an3.109:1.3": "For one whose actions by body, speech, and thought are unguarded, those actions are “soaked”. ",
    "an3.109:1.4": "For one whose actions by, body, speech, and thought are “soaked”, those actions become rotten. ",
    "an3.109:1.5": "For one whose actions of body, speech, and thought are rotten, there will not be a good death, a good passing. ",
    "an3.109:2.1": "It is like a bungalow with a bad roof. The roof peak, rafters, and walls are unguarded. ",
    "an3.109:2.2": "They become soaked, ",
    "an3.109:2.3": "and rotten. ",
    "an3.109:3.1": "In the same way, when the <em>citta</em> is unguarded, actions of body, speech, and thought are unguarded. … ",
    "an3.109:3.2": "",
    "an3.109:3.3": "",
    "an3.109:3.4": "For one whose actions of body, speech, and thought are rotten, there will not be a good death, a good passing. ",
    "an3.109:4.1": "“Householder, when the <em>citta</em> is guarded, actions of body, speech, and thought are guarded. ",
    "an3.109:4.2": "For one whose actions of body, speech, and thought are guarded, those actions do not become “soaked”. ",
    "an3.109:4.3": "For one whose actions by body, speech, and thought are not “soaked”, those actions do not become rotten. ",
    "an3.109:4.4": "For one whose actions of body, speech, and thought are not rotten, there will be a good death, a good passing. ",
    "an3.109:5.1": "It is like a bungalow with a good roof. The roof peak, rafters, and walls are guarded. ",
    "an3.109:5.2": "They do not become soaked, ",
    "an3.109:5.3": "and rotten. ",
    "an3.109:6.1": "In the same way, when the <em>citta</em> is guarded, actions of body, speech, and thought are guarded. … ",
    "an3.109:6.2": "",
    "an3.109:6.3": "",
    "an3.109:6.4": "For one whose actions of body, speech, and thought are not rotten, there will be a good death, a good passing.” "
}