{
    "an3.65:0.1": "Numbered Discourses 3.65 ",
    "an3.65:0.2": "7. The Great Chapter ",
    "an3.65:0.3": "With the Kālāmas of Kesamutta ",
    "an3.65:1.1": "So I have heard. ",
    "an3.65:1.2": "At one time the Buddha was wandering in the land of the Kosalans together with a large Saṅgha of bhikkhus when he arrived at a town of the Kālāmas named Kesamutta. ",
    "an3.65:1.3": "The Kālāmas of Kesamutta heard: ",
    "an3.65:1.4": "“It seems the ascetic Gotama—a Sakyan, gone forth from a Sakyan family—has arrived at Kesamutta. ",
    "an3.65:1.5": "He has this good reputation: ",
    "an3.65:1.6": "‘That Blessed One is an Arahant, a fully awakened Buddha …’ ",
    "an3.65:1.7": "It’s good to see such Arahants.” ",
    "an3.65:2.1": "Then the Kālāmas went up to the Buddha. Before sitting down to one side, some bowed, some exchanged pleasantries, some held up their joined palms toward the Buddha, some announced their name and clan, while some kept silent. Seated to one side the Kālāmas said to the Buddha: ",
    "an3.65:3.1": "“Bhante, there are some ascetics and brahmins who come to Kesamutta. ",
    "an3.65:3.2": "They explain and promote only their own doctrine, while they attack, deride, disparage, and smear the doctrines of others. ",
    "an3.65:3.3": "Then some other ascetics and brahmins come to Kesamutta. ",
    "an3.65:3.4": "They too explain and promote only their own doctrine, while they attack, deride, disparage, and smear the doctrines of others. ",
    "an3.65:3.5": "So, Bhante, we’re doubting and uncertain: ",
    "an3.65:3.6": "‘I wonder who of these respected ascetics and brahmins speaks the truth, and who speaks falsehood?’” ",
    "an3.65:3.7": "“It is appropriate, Kālāmas, for you to be doubting and uncertain. ",
    "an3.65:3.8": "Doubt has come up in you about an uncertain matter. ",
    "an3.65:4.1": "Kālāmas, don’t go by oral transmission,  by lineage, by hearsay, by canonical authority, by logic, by inference, by analysis of properties, by the acceptance of a view after consideration, by the appearance of competence, or by the thought ‘The ascetic is our respected teacher.’ ",
    "an3.65:4.2": "When you know for yourselves: ",
    "an3.65:4.3": "‘These things are unbeneficial, blameworthy, criticized by the wise, and when undertaken, they lead to harm and suffering’, then you should give them up. ",
    "an3.65:5.1": "What do you think, Kālāmas? ",
    "an3.65:5.2": "When greed arises in a person internally, does it do so for their welfare or harm?” ",
    "an3.65:6.1": "“Harm, Bhante.” ",
    "an3.65:7.1": "“A greedy individual, overcome by greed, kills living creatures, steals, commits adultery, lies, and encourages others to do the same. Is that for their lasting harm and suffering?” ",
    "an3.65:8.1": "“Yes, Bhante.” ",
    "an3.65:9.1": "“What do you think, Kālāmas? ",
    "an3.65:9.2": "When aversion arises in a person internally, does it do so for their welfare or harm?” ",
    "an3.65:10.1": "“Harm, Bhante.” ",
    "an3.65:11.1": "“A hateful individual, overcome by aversion, kills living creatures, steals, commits adultery, lies, and encourages others to do the same. Is that for their lasting harm and suffering?” ",
    "an3.65:12.1": "“Yes, Bhante.” ",
    "an3.65:13.1": "“What do you think, Kālāmas? ",
    "an3.65:13.2": "When muddledness arises in a person internally, does it do so for their welfare or harm?” ",
    "an3.65:14.1": "“Harm, Bhante.” ",
    "an3.65:15.1": "“A muddled individual, overcome by muddledness, kills living creatures, steals, commits adultery, lies, and encourages others to do the same. Is that for their lasting harm and suffering?” ",
    "an3.65:16.1": "“Yes, Bhante.” ",
    "an3.65:17.1": "“What do you think, Kālāmas, are these things beneficial or unbeneficial?” ",
  "an3.65:18.1": "“Unbeneficial, Bhante.” ",
    "an3.65:19.1": "“Blameworthy or blameless?” ",
    "an3.65:20.1": "“Blameworthy, Bhante.” ",
    "an3.65:21.1": "“Criticized or praised by the wise?” ",
    "an3.65:22.1": "“Criticized by the wise, Bhante.” ",
    "an3.65:23.1": "“When undertaken, do they lead to harm and suffering, or not? ",
    "an3.65:23.2": "Or how do you see this?” ",
    "an3.65:24.1": "“When undertaken, they lead to harm and suffering, Bhante. ",
    "an3.65:24.2": "That’s how we see it.” ",
    "an3.65:25.1": "“So, Kālāmas, when I said: ",
    "an3.65:25.2": "‘Kālāmas, ",
    "an3.65:25.3": "don’t go by oral transmission,  by lineage, by hearsay, by canonical authority, by logic, by inference, by analysis of properties, by the acceptance of a view after consideration, by the appearance of competence, or by the thought ‘The ascetic is our respected teacher.’ ",
    "an3.65:25.4": "But when you know for yourselves: ",
    "an3.65:25.5": "‘These things are unbeneficial, blameworthy, criticized by the wise, and when undertaken, they lead to harm and suffering’, then you should give them up. ",
    "an3.65:25.6": "That’s what I said, and this is why I said it. ",
    "an3.65:26.1": "Kālāmas, don’t go by oral transmission,  by lineage, by hearsay, by canonical authority, by logic, by inference, by analysis of properties, by the acceptance of a view after consideration, by the appearance of competence, or by the thought ‘The ascetic is our respected teacher.’ ",
    "an3.65:26.2": "But when you know for yourselves: ",
    "an3.65:26.3": "‘These things are beneficial, blameless, praised by the wise, and when undertaken, they lead to welfare and ease’, then you should abide having entered upon them. ",
    "an3.65:27.1": "What do you think, Kālāmas? ",
    "an3.65:27.2": "When non-greed arises in a person internally, does it do so for their welfare or harm?” ",
    "an3.65:28.1": "“Welfare, Bhante.” ",
    "an3.65:29.1": "“An individual who is not greedy, not overcome by greed, doesn’t kill living creatures, steal, commit adultery, lie, or encourage others to do the same. Is that for their lasting welfare and happiness?” ",
    "an3.65:30.1": "“Yes, Bhante.” ",
    "an3.65:31.1": "“What do you think, Kālāmas? ",
    "an3.65:31.2": "When non-aversion arises in a person internally, does it do so for their welfare or harm? … ",
    "an3.65:31.3": "When non-muddledness arises in a person internally, does it do so for their welfare or harm? … ",
    "an3.65:31.4": "Is that for their lasting welfare and happiness?” ",
    "an3.65:32.1": "“Yes, Bhante.” ",
    "an3.65:33.1": "“What do you think, Kālāmas, are these things beneficial or unbeneficial?” ",
    "an3.65:34.1": "“Beneficial, Bhante.” ",
    "an3.65:35.1": "“Blameworthy or blameless?” ",
    "an3.65:36.1": "“Blameless, Bhante.” ",
    "an3.65:37.1": "“Criticized or praised by the wise?” ",
    "an3.65:38.1": "“Praised by the wise, Bhante.” ",
    "an3.65:39.1": "“When you undertake them, do they lead to welfare and happiness, or not? ",
    "an3.65:39.2": "Or how do you see this?” ",
    "an3.65:40.1": "“When you undertake them, they lead to welfare and happiness. ",
    "an3.65:40.2": "That’s how we see it.” ",
    "an3.65:41.1": "“So, Kālāmas, when I said: ",
    "an3.65:41.2": "‘Kālāmas, ",
    "an3.65:41.3": "don’t go by oral transmission,  by lineage, by hearsay, by canonical authority, by logic, by inference, by analysis of properties, by the acceptance of a view after consideration, by the appearance of competence, or by the thought ‘The ascetic is our respected teacher.’ ",
    "an3.65:41.4": "But when you know for yourselves: ",
    "an3.65:41.5": "“These things are beneficial, blameless, praised by the wise, and when undertaken, they lead to welfare and ease”, then you should abide having entered upon them.’ ",
    "an3.65:41.6": "That’s what I said, and this is why I said it. ",
    "an3.65:42.1": "Then that noble disciple is rid of longing, rid of ill will, unmuddled, aware, and recollected. He abides having pervaded with a mind of friendliness the first direction, likewise second, likewise third, likewise the fourth. In the same way above, below, across, everywhere, he abides having pervaded the whole world with a mind of friendliness—abundant, expansive, immeasurable, free of enmity and ill will. ",
    "an3.65:42.2": "He abides having pervaded with a mind of compassion … ",
    "an3.65:42.3": "He abides having pervaded with a mind of contentment … ",
    "an3.65:42.4": "He abides having pervaded with a mind of equanimity the first direction, likewise the second, likewise the third, likewise the fourth. In the same way above, below, across, everywhere, he abides having pervaded the whole world with a mind of equanimity—abundant, expansive, immeasurable, free of enmity and ill will. ",
    "an3.65:43.1": "When that noble disciple has a mind that’s thus free of enmity and ill will, undefiled and purified, ",
    "an3.65:43.2": "they’ve won four consolations right in the present experience. ",
    "an3.65:43.3": "‘If it turns out there is another world, and good and bad actions have a result, then—when the body breaks up, after death—I’ll reappear in a good place, a heavenly realm.’ This is the first consolation they’ve won. ",
    "an3.65:44.1": "‘If it turns out there is no other world, and good and bad actions don’t have a result, then in the present life I’ll keep myself free of enmity and ill will, untroubled and at ease.’ This is the second consolation they’ve won. ",
    "an3.65:45.1": "‘If it turns out that bad things happen to one who does bad things, then I still don’t do anything bad. ",
    "an3.65:45.2": "Since I don’t do anything bad, how can suffering touch me?’ This is the third consolation they’ve won. ",
    "an3.65:46.1": "‘If it turns out that bad things don’t happen to one who does bad things, then I still see myself pure in both respects.’ This is the fourth consolation they’ve won. ",
    "an3.65:47.1": "When that noble disciple has a mind that’s thus free of enmity and ill will, undefiled and purified, ",
    "an3.65:47.2": "they’ve won these four consolations right in the present experience.” ",
    "an3.65:48.1": "“That’s so true, Blessed One! That’s so true, Excellent One! ",
    "an3.65:48.2": "When that noble disciple has a mind that’s thus free of enmity and ill will, undefiled and purified, ",
    "an3.65:48.3": "they’ve won four consolations right in the present experience. … ",
    "an3.65:48.4": "",
    "an3.65:49.1": "",
    "an3.65:50.1": "",
    "an3.65:51.1": "",
    "an3.65:52.1": "",
    "an3.65:52.2": "",
    "an3.65:53.1": "Excellent, Bhante! Excellent! … ",
    "an3.65:53.2": "We go for refuge to Master Gotama, to the teaching, and to the bhikkhu Saṅgha. ",
    "an3.65:53.3": "From this day forth, may the Buddha remember us as lay followers who have gone for refuge for life.” "
}