{
  "sn12.67:0.1": "Linked Discourses 12.67 ",
  "sn12.67:0.2": "7. The Great Chapter ",
  "sn12.67:0.3": "Bundles of Reeds ",
  "sn12.67:1.1": "At one time Venerable Sāriputta and Venerable Mahākoṭṭhita were staying near Varanasi, in the deer park at Isipatana. ",
  "sn12.67:1.2": "Then in the late afternoon, Venerable Mahākoṭṭhita came out of retreat, went to Venerable Sāriputta, and exchanged pleasantries with him. ",
  "sn12.67:1.3": "When the amicable and cordial talk was over, he sat down to one side and said to Sāriputta: ",
  "sn12.67:1.4": "“Well, Friend Sāriputta, are aging and death made by oneself? Or by another? Or by both oneself and another? Or do they originate without cause, not made by oneself or another?” ",
  "sn12.67:1.5": "“No, Friend Koṭṭhita, aging and death are not made by oneself, nor by another, nor by both oneself and another, nor do they originate without cause, not made by oneself or another. ",
  "sn12.67:1.6": "Rather, with birth as support, there is aging and death.” ",
  "sn12.67:2.1": "“Well, Friend Sāriputta, is birth made by oneself? Or by another? Or by both oneself and another? Or does it originate without cause, not made by oneself or another?” ",
  "sn12.67:2.2": "“No, Friend Koṭṭhita, birth is not made by oneself, nor by another, nor by both oneself and another, nor does it originate without cause, not made by oneself or another. ",
  "sn12.67:2.3": "Rather, with being as support, there is birth.” ",
  "sn12.67:3.1": "“Well, Friend Sāriputta, is being made by oneself? …” … ",
  "sn12.67:3.2": "“Is assumption made by oneself? …” … ",
  "sn12.67:3.3": "“Is craving made by oneself? …” … ",
  "sn12.67:3.4": "“Is feeling made by oneself? …” … ",
  "sn12.67:3.5": "“Is pressure made by oneself? …” … ",
  "sn12.67:3.6": "“Are the six sense fields made by oneself? …” … ",
  "sn12.67:3.7": "“Well, Friend Sāriputta, is name-and-form made by oneself? Or by another? Or by both oneself and another? Or does it originate without cause, not made by oneself or another?” ",
  "sn12.67:3.8": "“No, Friend Koṭṭhita, name-and -form is not made by oneself, nor by another, nor by both oneself and another, nor does it originate without cause, not made by oneself or another. ",
  "sn12.67:3.9": "Rather, with consciousness as support, there is name-and-form.” ",
  "sn12.67:4.1": "“Well, Friend Sāriputta, is consciousness made by oneself? Or by another? Or by both oneself and another? Or does it originate without cause, not made by oneself or another?” ",
  "sn12.67:4.2": "“No, Friend Koṭṭhita, consciousness is not made by oneself, nor by another, nor by both oneself and another, nor does it originate without cause, not made by oneself or another. ",
  "sn12.67:4.3": "Rather, with name-and-form as support, there is consciousness.” ",
  "sn12.67:5.1": "“Friend Sāriputta, just now I understood you to say: ",
  "sn12.67:5.2": "‘No, Friend Koṭṭhita, name-and -form is not made by oneself, nor by another, nor by both oneself and another, nor does it originate without cause, not made by oneself or another. ",
  "sn12.67:5.3": "Rather, with consciousness as support, there is name-and-form.’ ",
  "sn12.67:6.1": "But I also understood you to say: ",
  "sn12.67:6.2": "‘No, Friend Koṭṭhita, consciousness is not made by oneself, nor by another, nor by both oneself and another, nor does it originate without cause, not made by oneself or another. ",
  "sn12.67:6.3": "Rather, with name-and-form as support, there is consciousness.” ",
  "sn12.67:7.1": "How then should we see the meaning of this statement?” ",
  "sn12.67:7.2": "“Well then, friend, I shall give you a simile. ",
  "sn12.67:7.3": "For by means of a simile some sensible people understand the meaning of what is said. ",
  "sn12.67:7.4": "Suppose there were two bundles of reeds leaning up against each other. ",
  "sn12.67:7.5": "In the same way, with name-and-form as support, there is consciousness. ",
  "sn12.67:7.6": "With consciousness as support, there is name-and-form. ",
  "sn12.67:7.7": "With name-and-form as support, there are the six sense fields. ",
  "sn12.67:7.8": "With the six sense fields as support, there is pressure … ",
  "sn12.67:7.9": "That is how this entire mass of suffering originates. ",
  "sn12.67:7.10": "If the first of those bundles of reeds were to be pulled away, the other would collapse. ",
  "sn12.67:7.11": "And if the other were to be pulled away, the first would collapse. ",
  "sn12.67:7.12": "In the same way, with the cessation of name-and-form, cessation of consciousness. ",
  "sn12.67:7.13": "With the cessation of consciousness, cessation of name-and-form. ",
  "sn12.67:7.14": "With the cessation of name-and-form, cessation of the six sense fields. ",
  "sn12.67:7.15": "With the cessation of the six sense fields, cessation of pressure … ",
  "sn12.67:7.16": "That is how this entire mass of suffering ceases.” ",
  "sn12.67:8.1": "“It’s incredible, Friend Sāriputta, it’s amazing! ",
  "sn12.67:8.2": "",
  "sn12.67:8.3": "How well spoken this was by Venerable Sāriputta! ",
  "sn12.67:8.4": "And we can express our agreement with Venerable Sāriputta’s statement on these thirty-six grounds. ",
  "sn12.67:9.1": "If a bhikkhu teaches Dhamma for disenchantment, dispassion, and cessation regarding aging and death, he’s qualified to be called a ‘bhikkhu who speaks on Dhamma’. ",
  "sn12.67:9.2": "If he practices for disenchantment, dispassion, and cessation regarding aging and death, he’s qualified to be called a ‘bhikkhu who practices in line with the Dhamma’. ",
  "sn12.67:9.3": "If he’s liberated through non-assumption by disenchantment, dispassion, and cessation regarding aging and death, he’s qualified to be called a ‘bhikkhu who has attained quenching in the present experience’. ",
  "sn12.67:9.4": "If a bhikkhu teaches Dhamma for disenchantment regarding birth … ",
  "sn12.67:9.5": "being … ",
  "sn12.67:9.6": "assumption … ",
  "sn12.67:9.7": "craving … ",
  "sn12.67:9.8": "feeling … ",
  "sn12.67:9.9": "pressure … ",
  "sn12.67:9.10": "the six sense fields … ",
  "sn12.67:9.11": "name-and-form … ",
  "sn12.67:9.12": "consciousness … ",
  "sn12.67:9.13": "activities … ",
  "sn12.67:9.14": "If a bhikkhu teaches Dhamma for disenchantment, dispassion, and cessation regarding ignorance, he’s qualified to be called a ‘bhikkhu who speaks on Dhamma’. ",
  "sn12.67:9.15": "If he practices for disenchantment, dispassion, and cessation regarding ignorance, he’s qualified to be called a ‘bhikkhu who practices in line with the teaching’. ",
  "sn12.67:9.16": "If he’s liberated through non-assumption by disenchantment, dispassion, and cessation regarding ignorance, he’s qualified to be called a ‘bhikkhu who has attained quenching in the present experience’.” "
}