{
    "sn36.6:0.1": "Saṁyutta Nikāya 36.6 ",
    "sn36.6:0.2": "1. With Verses ",
    "sn36.6:0.3": "The Arrow ",
    "sn36.6:1.1": "Bhikkhus, an unlearned ordinary person feels pleasant, unpleasant, and neither-pleasant-nor-unpleasant feelings. ",
    "sn36.6:1.2": "A learned noble disciple also feels pleasant, unpleasant, and neither-pleasant-nor-unpleasant feelings. ",
    "sn36.6:1.3": "What, then, is the distinction, disparity, and difference between a learned noble disciple and an unlearned ordinary person?” ",
    "sn36.6:1.4": "Our teachings are rooted in the Auspicious One. …” ",
    "sn36.6:1.5": "An unlearned ordinary person, when struck by unpleasant feeling, sorrows, wails, laments, beats their breast, and falls into a muddle. ",
    "sn36.6:1.6": "They feel two feelings: ",
    "sn36.6:1.7": "a bodily one as well as one pertaining to the <em>citta</em>. ",
    "sn36.6:1.8": "It is like someone who is pierced by an arrow, ",
    "sn36.6:1.9": "and is further pierced by a second arrow. ",
    "sn36.6:1.10": "Thus, they feel the feeling of two arrows. ",
    "sn36.6:1.11": "In the same way, bhikkhus, an unlearned ordinary person, when struck by unpleasant feeling, sorrows, wails, laments, beats their breast, and falls in to a muddle. ",
    "sn36.6:1.12": "They feel two feelings: ",
    "sn36.6:1.13": "a bodily one as well as one pertaining to the <em>citta</em>. ",
    "sn36.6:1.14": "Struck by that same unpleasant feeling, they resist it. ",
    "sn36.6:1.15": "Thus, the underlying tendency to resistance against unpleasant feeling underlies them. ",
    "sn36.6:1.16": "Struck by unpleasant feeling, they delight in the pleasure of sensuality. ",
    "sn36.6:1.17": "Why is that? ",
    "sn36.6:1.18": "Because, bhikkhus, an unlearned ordinary person does not understand any escape from unpleasant feeling apart from the pleasure of sensuality. ",
    "sn36.6:1.19": "Since they delight in the pleasure of sensuality, the underlying tendency to passion for pleasant feeling underlies them. ",
    "sn36.6:1.20": "They do not understand as they are the origin, ending, gratification, peril, and escape from those feelings. ",
    "sn36.6:1.21": "Since they do not understand as they are the origin, ending, gratification, peril, and escape from those feelings, the underlying tendency to ignorance with regard to neither-pleasant-nor-unpleasant feeling underlies them. ",
    "sn36.6:1.22": "If they feel a pleasant feeling, they feel it yoked. ",
    "sn36.6:1.23": "If they feel an unpleasant feeling, they feel it yoked. ",
    "sn36.6:1.24": "If they feel a neither-pleasant-nor-unpleasant feeling, they feel it yoked. ",
    "sn36.6:1.25": "This is called an unlearned ordinary person who is yoked to birth, old age, and death, to sorrows, lamentations, pains, dissatisfactions, and tribulations; who is yoked to suffering, I say. ",
    "sn36.6:2.1": "But, bhikkhus, a learned noble disciple, when struck by unpleasant feeling, does not sorrow, wail, lament, beat their breast, or fall into a muddle. ",
    "sn36.6:2.2": "They feel one feeling: ",
    "sn36.6:2.3": "a bodily one, not one pertaining to the <em>citta</em>. ",
    "sn36.6:3.1": "It is like someone who is pierced by an arrow, ",
    "sn36.6:3.2": "But not by a second arrow. ",
    "sn36.6:3.3": "Thus, they feel the feeling of one arrow. ",
    "sn36.6:3.4": "In the same way, a learned noble disciple, when struck by unpleasant feeling, does not sorrow, wail, lament, beat their breast, or fall into a muddle. ",
    "sn36.6:3.5": "They feel one feeling: ",
    "sn36.6:3.6": "a bodily one, not one pertaining to the <em>citta</em>. ",
    "sn36.6:3.7": "Struck by unpleasant feeling, they do not resist it. ",
    "sn36.6:3.8": "Thus, the underlying tendency to resistance against unpleasant feeling does not underlie them. ",
    "sn36.6:3.9": "Struck by unpleasant feeling, they do not delight in the pleasure of sensuality. ",
    "sn36.6:3.10": "Why is that? ",
    "sn36.6:3.11": "Because a learned noble disciple understands the escape from unpleasant feeling that is apart from the pleasure of sensuality. ",
    "sn36.6:3.12": "Since they do not delight in the pleasure of sensuality, the underlying tendency to passion for pleasant feeling does not underlie them. ",
    "sn36.6:3.13": "They understand as they are the origin, ending, gratification, peril, and escape from those feelings. ",
    "sn36.6:3.14": "Since they understand as they are the origin, ending, gratification, peril, and escape from those feelings, the underlying tendency to ignorance with regard to neither-pleasant-nor-unpleasant feeling does not underlie them. ",
    "sn36.6:3.15": "If they feel a pleasant feeling, they feel it unyoked. ",
    "sn36.6:3.16": "If they feel an unpleasant feeling, they feel it unyoked. ",
    "sn36.6:3.17": "If they feel a neither-pleasant-nor-unpleasant feeling, they feel it unyoked. ",
    "sn36.6:3.18": "This is called a learned noble disciple who is unyoked from birth, old age, and death, from sorrows, lamentations, pains, dissatisfactions, and tribulations; who is unyoked from suffering, I say. ",
    "sn36.6:3.19": "This is the distinction, disparity, and difference between a learned noble disciple and an unlearned ordinary person. ",
    "sn36.6:4.1": "One who understands and is learned does not feel a feeling ",
    "sn36.6:4.2": "of pleasure or unpleasure. ",
    "sn36.6:4.3": "This is the great distinction ",
    "sn36.6:4.4": "between the wise and skilled, and the ordinary person. ",
    "sn36.6:5.1": "A learned person who has comprehended the teaching ",
    "sn36.6:5.2": "sees through this world and the next. ",
    "sn36.6:5.3": "Desirable things do not agitate their mind ",
    "sn36.6:5.4": "nor are they repelled by the undesirable. ",
    "sn36.6:6.1": "Both welcoming and opposing ",
    "sn36.6:6.2": "are dispelled and vanished, they are absent. ",
    "sn36.6:6.3": "Knowing the stainless, sorrowless state ",
    "sn36.6:6.4": "they—gone beyond being—understand rightly. ” ",
    "sn36.6:6.5": ""
}