{
  "sn35.246:1.1": "Here “mind” corresponds to _citta_, which is why further below the same is repeated for _mano_, often also translated as “mind” although they're not the same. This is important because the passage would otherwise be stating that the object must be vanquished from one's field of awareness altogether, but this is not achievable through volition. An intention of suppression and denial can be exerted only for as long as that which is being suppressed is still there, even if faintly, which means that such attempts are ultimately founded upon a fallacy. Furthermore, if the outright elimination of an arisen experience were the goal, there would be situations where success would simply not be possible: when sense objects are being forced upon one by the external situation (e.g., loud music playing in the vicinity). But in SN 35.239, restraining the senses is compared to directing a chariot in whichever way one wants, which illustrates how perfect sense restraint is always possible regardless of the current circumstance—regardless of the fact that the six senses and what comes through them is not ultimately in one's control (SN 4.19). See also the comments in [MN 20](https://suttas.hillsidehermitage.org/?q=mn20). ",
  "sn35.246:1.7": "Rein in the _citta_ from what is experienced by _mano_ (mental faculty). For more on _citta_ see [this](https://www.youtube.com/watch?v=1XMDbO8JLvo) and [this](https://www.youtube.com/watch?v=lMl8C1ViL1c). ",
  "sn35.246:2.1": "This simile closely resembles the one given in  [MN 19](https://suttas.hillsidehermitage.org/?q=mn19), another discourse which describes the very same practice in slightly different terms. ",
  "sn35.246:2.3": "With pressure/contact already being there, they fail to exercise restraint. That is what is meant by [_papañca_ or “proliferation”](https://suttas.hillsidehermitage.org/?q=mn18). The proliferation does not begin with the mere arising of perceptions and feelings (which, in terms of the the sixth sense base, includes ideas and concepts of any kind). ",
  "sn35.246:3.14": "See the talk [“Abandoning the All”](https://www.youtube.com/watch?v=9jsmfGXInJc), and also SN 35.240 which is referenced in that discussion. ",
  "sn35.246:4.24": "It is possible for the bhikkhu to do this as a result of the previous taming of the mind, i.e., the abandonment of the five hindrances, after which knowing and seeing things as they are happens as a matter of course (AN 10.2, SN 22.5). It should be noted that the Suttas always discuss the abandonment of the five hindrances in similar terms as this discourse, and [do not lend support](https://www.hillsidehermitage.org/what-the-jhanas-actually-are/) to the contemporary idea of concentration upon meditation objects being the gateway to _samādhi_. [The four _satipaṭṭhānas_ are not “objects” of focused attention](https://suttas.hillsidehermitage.org/?q=mn10). ",
  "sn35.246:4.29": "[A playlist on the theme of _anattā_](https://www.youtube.com/watch?v=L4lt6JlhOp4&list=PLUPMn2PfEqIyfZ4LiLspKvbaq0K-YnPFa). "
}
