{
    "sn1.20:0.1": "Linked Discourses 1.20 ",
    "sn1.20:0.2": "2. The Garden of Delight ",
    "sn1.20:0.3": "With Samiddhi ",
    "sn1.20:1.1": "So I have heard. ",
    "sn1.20:1.2": "At one time the Buddha was staying near Rājagaha in the Hot Springs Monastery. ",
    "sn1.20:1.3": "Then Venerable Samiddhi rose at the crack of dawn and went to the hot springs to bathe. ",
    "sn1.20:1.4": "When he had bathed and emerged from the water he stood in one robe drying himself. ",
    "sn1.20:1.5": "Then, late at night, a glorious deity, lighting up the entire hot springs, went up to Venerable Samiddhi, and, standing in the air, addressed him in verse: ",
    "sn1.20:2.1": "“Bhikkhu, you seek alms without having eaten ",
    "sn1.20:2.2": "instead of seeking alms after having eaten. ",
    "sn1.20:2.3": "But you should eat first, then seek alms: ",
    "sn1.20:2.4": "don’t let the time pass you by.” ",
    "sn1.20:3.1": "“I actually don’t know the time; ",
    "sn1.20:3.2": "it’s covered up and unseen. ",
    "sn1.20:3.3": "That’s why I seek alms without having eaten, ",
    "sn1.20:3.4": "so that the time may not pass me by!” ",
    "sn1.20:4.1": "Then that deity landed on the ground and said to Venerable Samiddhi, ",
    "sn1.20:4.2": "“You’ve gone forth while young, bhikkhu. With pristine black hair, you’re blessed with youth, in the prime of life, and you’ve never flirted with sensuality. ",
    "sn1.20:4.3": "Enjoy human sensuality! ",
    "sn1.20:4.4": "Don’t give up what is presently evident to chase after what involves time.” ",
    "sn1.20:5.1": "“Friend, I’m not giving up what is presently evident to chase after what involves time. ",
    "sn1.20:5.2": "I’m giving up what involves time to chase after what is presently evident. ",
    "sn1.20:5.3": "For the Buddha has said that sensuality involves time, with much suffering and distress, and the peril there is what’s greater. ",
    "sn1.20:5.4": "But this Dhamma is presently evident, not involving time, verifiable, and goading-on, to be known by the wise for themselves.” ",
    "sn1.20:6.1": "“But in what way, bhikkhu, has the Buddha said that sensuality involves time, with much suffering and distress, and that the peril there is what’s greater”? ",
    "sn1.20:6.2": "And how is this Dhamma presently evident, not involving time, verifiable, and goading-on, to be known by the wise for themselves?” ",
    "sn1.20:7.1": "“Friend, I’m junior, recently gone forth, newly come to this teaching-and-discipline. ",
    "sn1.20:7.2": "I’m not able to explain this in detail. ",
    "sn1.20:7.3": "But the Blessed One, the Arahant, the fully awakened Buddha is staying near Rājagaha in the Hot Springs Monatery. ",
    "sn1.20:7.4": "You should go to him and ask about this matter. ",
    "sn1.20:7.5": "And you should remember it in line with the Buddha’s answer.” ",
    "sn1.20:8.1": "“It’s not easy for us to approach the Buddha, as he is surrounded by other illustrious deities. ",
    "sn1.20:8.2": "If you go to the Buddha and ask him about this matter, we’ll come along and listen to the Dhamma.” ",
    "sn1.20:8.3": "“Yes, friend,” Venerable Samiddhi replied. He went to the Buddha, bowed, sat down to one side, and informed him of the matter. Then he added: ",
    "sn1.20:9.1": "",
    "sn1.20:9.2": "",
    "sn1.20:9.3": "",
    "sn1.20:10.1": "",
    "sn1.20:10.2": "",
    "sn1.20:10.3": "",
    "sn1.20:10.4": "",
    "sn1.20:11.1": "",
    "sn1.20:12.1": "",
    "sn1.20:12.2": "",
    "sn1.20:12.3": "",
    "sn1.20:12.4": "",
    "sn1.20:13.1": "",
    "sn1.20:13.2": "",
    "sn1.20:13.3": "",
    "sn1.20:13.4": "",
    "sn1.20:14.1": "",
    "sn1.20:14.2": "",
    "sn1.20:14.3": "",
    "sn1.20:14.4": "",
    "sn1.20:14.5": "",
    "sn1.20:15.1": "",
    "sn1.20:15.2": "",
    "sn1.20:15.3": "",
    "sn1.20:16.1": "",
    "sn1.20:16.2": "",
    "sn1.20:16.3": "",
    "sn1.20:16.4": "",
    "sn1.20:16.5": "",
    "sn1.20:17.1": "",
    "sn1.20:17.2": "",
    "sn1.20:17.3": "",
    "sn1.20:17.4": "“Bhante, if that deity spoke the truth, he’ll be close by.” ",
    "sn1.20:18.1": "When he had spoken, that deity said to Venerable Samiddhi, ",
    "sn1.20:18.2": "“Ask, bhikkhu, ask! For I have arrived.” ",
    "sn1.20:19.1": "Then the Buddha addressed the deity in verse: ",
    "sn1.20:20.1": "“Beings perceive the describable ",
    "sn1.20:20.2": "and are established in the describable. ",
    "sn1.20:20.3": "Not understanding the describable, ",
    "sn1.20:20.4": "they fall under the yoke of Death. ",
    "sn1.20:21.1": "But having fully understood the describable, ",
    "sn1.20:21.2": "he does not conceive ‘one who describes’, ",
    "sn1.20:21.3": "for he has nothing ",
    "sn1.20:21.4": "by which one could designate him. ",
    "sn1.20:21.5": "Tell me if you understand, spirit.” ",
    "sn1.20:22.1": "“I don’t understand the detailed meaning of the Buddha’s brief statement. ",
    "sn1.20:22.2": "Please teach me this matter so I can understand the detailed meaning.” ",
    "sn1.20:23.1": "“‘Equal, superior, or worse’ ",
    "sn1.20:23.2": "conceiving like this, one falls into conflict. ",
    "sn1.20:23.3": "Unwavering in the face of the three discriminations, ",
    "sn1.20:23.4": "‘equal or superior’ do not occur to him. ",
    "sn1.20:23.5": "Tell me if you understand, spirit.” ",
    "sn1.20:24.1": "“I don’t understand the detailed meaning of the Buddha’s brief statement. ",
    "sn1.20:24.2": "Please teach me this matter so I can understand the detailed meaning.” ",
    "sn1.20:25.1": "“He has given up designation; he does not come into measurement. ",
    "sn1.20:25.2": "He has cut off craving here—in relation to name-and-form. ",
    "sn1.20:25.3": "He’s cut all ties, untroubled, free from hope. ",
    "sn1.20:25.4": "Though gods and humans search for him ",
    "sn1.20:25.5": "in this world and the world beyond, they never find him, ",
    "sn1.20:25.6": "not in heaven nor in any abode. ",
    "sn1.20:26.1": "Tell me if you understand, spirit.” ",
    "sn1.20:27.1": "“This is how I understand the detailed meaning of the Buddha’s brief statement: ",
    "sn1.20:28.1": "One should never do anything bad ",
    "sn1.20:28.2": "by speech or mind or body in all the world. ",
    "sn1.20:28.3": "Having given up sensuality, recollected and aware, ",
    "sn1.20:28.4": "one shouldn’t engage in what’s painful and unbeneficial.” ",
    "sn1.20:28.5": "",
    "sn1.20:29.1": "",
    "sn1.20:29.2": "",
    "sn1.20:29.3": "",
    "sn1.20:29.4": "",
    "sn1.20:29.5": ""
}