{
  "sn35.70:0.1": "Linked Discourses 35.70 ",
  "sn35.70:0.2": "7. With Migajāla ",
  "sn35.70:0.3": "Presently Evident (With Upavāna) ",
  "sn35.70:1.1": "Then Venerable Upavāna went up to the Buddha … ",
  "sn35.70:1.2": "and said to him: ",
  "sn35.70:1.3": "“Bhante, it is said that the Dhamma is presently evident. ",
  "sn35.70:1.4": "In what way is the Dhamma presently evident, not involving time, verifiable, and goading-on, to be known by the wise for themselves?” ",
  "sn35.70:2.1": "“Upavāna, take a bhikkhu who sees a sight with the eye. He feels both the sight and passion for the sight. ",
  "sn35.70:2.2": "There being passion for sights internally, he understands: ‘There is passion for sights internally for me’. ",
  "sn35.70:2.3": "This is how ",
  "sn35.70:2.4": "",
  "sn35.70:2.5": "the Dhamma is presently evident, not involving time, verifiable, and goading-on, to be known by the wise for themselves. ",
  "sn35.70:3.1": "Take a bhikkhu who hears … smells … tastes … touches … ",
  "sn35.70:3.2": "",
  "sn35.70:3.3": "",
  "sn35.70:3.4": "",
  "sn35.70:4.1": "Take a bhikkhu who cognizes a phenomenon with the mental faculty. He feels both the phenomenon and passion for the phenomenon. ",
  "sn35.70:4.2": "There being passion for phenomena internally, he understands: ‘There is passion for phenomena internally for me’. ",
  "sn35.70:4.3": "This is how ",
  "sn35.70:4.4": "",
  "sn35.70:4.5": "the Dhamma is presently evident, not involving time, verifiable, and goading-on, to be known by the wise for themselves. ",
  "sn35.70:5.1": "Now, take a bhikkhu who sees a sight with the eye. He feels the sight, but no passion for the sight. ",
  "sn35.70:5.2": "There being no passion for sights internally, he understands: ‘There is no passion for sights internally for me’. ",
  "sn35.70:5.3": "This is how ",
  "sn35.70:5.4": "",
  "sn35.70:5.5": "the Dhamma is presently evident, not involving time, verifiable, and goading-on, to be known by the wise for themselves. ",
  "sn35.70:6.1": "Take a bhikkhu who hears … smells … tastes … touches … ",
  "sn35.70:7.1": "",
  "sn35.70:7.2": "",
  "sn35.70:7.3": "Take a bhikkhu who cognizes a phenomenon with the mental faculty. He feels the phenomenon, but no passion for the phenomenon. ",
  "sn35.70:7.4": "There being no passion for phenomena internally, he understands: ‘There is no passion for phenomena internally for me’. ",
  "sn35.70:7.5": "This is how, Upavāna, the Dhamma is presently evident, not involving time, verifiable, and goading-on, to be known by the wise for themselves. "
}