{
    "sn35.246:0.1": "Linked Discourses 35.246 ",
    "sn35.246:0.2": "19. The Simile of the Vipers ",
    "sn35.246:0.3": "The Simile of the Lute ",
    "sn35.246:1.1": "“Bhikkhus, if for any bhikkhu or bhikkhuni desire or passion or aversion or muddledness or resistance with regard to sights cognizable by the eye arises, they should rein in the mind from that: ",
    "sn35.246:1.2": "‘This path is dangerous and perilous, thorny and tangled; it’s a wrong turn, a bad path, a harmful way. ",
    "sn35.246:1.3": "This path is frequented by untrue persons, not by true persons. ",
    "sn35.246:1.4": "It’s not worthy of you.’ ",
    "sn35.246:1.5": "Therefore, they should rein in the mind from those sights cognizable by the eye. ",
    "sn35.246:1.6": "If for any bhikkhu or bhikkhuni desire or passion or aversion or muddledness or resistance with regard to sounds cognizable by the ear … smells cognizable by the nose … tastes cognizable by the tongue … touches cognizable by the body … ",
    "sn35.246:1.7": "phenomena cognizable by the mental faculty arises, they should rein their mind in from that: ",
    "sn35.246:1.8": "‘This path is dangerous and perilous, thorny and tangled; it’s a wrong turn, a bad path, a harmful way. ",
    "sn35.246:1.9": "This path is frequented by untrue persons, not by true persons. ",
    "sn35.246:1.10": "It’s not worthy of you.’ ",
    "sn35.246:1.11": "Therefore, they should rein in the mind from those phenomena cognizable by the mental faculty. ",
    "sn35.246:2.1": "Suppose the crops have ripened, ",
    "sn35.246:2.2": "but the caretaker is negligent. If an ox fond of crops invades the crops, it would indulge itself as much as it likes. ",
    "sn35.246:2.3": "In the same way, an unlearned ordinary person, failing to exercise restraint with regard to the six fields of pressure, indulges themselves as much as they like and falls into carelessness with regard to the five strands of sensuality. ",
    "sn35.246:3.1": "Suppose the crops have ripened, and the caretaker is diligent. If an ox fond of crops invades the crops, ",
    "sn35.246:3.2": "the caretaker would grab it firmly by the muzzle. ",
    "sn35.246:3.3": "Then they’d grab it above the hump and hold it fast there. ",
    "sn35.246:3.4": "Then they’d give it a good thrashing ",
    "sn35.246:3.5": "before driving it away. ",
    "sn35.246:3.6": "For a second time, ",
    "sn35.246:3.7": "and even a third time, the same thing might happen. ",
    "sn35.246:3.8": "",
    "sn35.246:3.9": "",
    "sn35.246:3.10": "",
    "sn35.246:3.11": "",
    "sn35.246:3.12": "As a result, no matter how long it stands or sits in a village or wilderness, that ox fond of crops would never invade that crop again, ",
    "sn35.246:3.13": "remembering the beating it got earlier. ",
    "sn35.246:3.14": "In the same way, when a bhikkhu’s mind is subdued, well subdued with regard to the six fields of pressure, it becomes established internally; it settles, unifies, and becomes composed. ",
    "sn35.246:4.1": "Suppose a king or his minister had never heard the sound of a lute. ",
    "sn35.246:4.2": "When he first hears the sound, ",
    "sn35.246:4.3": "he would say, ",
    "sn35.246:4.4": "‘My man, what is making this sound, so arousing, sensuous, intoxicating, infatuating, and captivating?’ ",
    "sn35.246:4.5": "They’d say to him, ",
    "sn35.246:4.6": "‘That, sir, is a lute.’ ",
    "sn35.246:4.7": "He would say, ",
    "sn35.246:4.8": "‘Go, my man, fetch me that lute.’ ",
    "sn35.246:4.9": "So they’d fetch it ",
    "sn35.246:4.10": "and say, ",
    "sn35.246:4.11": "‘This, sir, is that lute, whose sound is so arousing, sensuous, intoxicating, infatuating, and captivating.’ ",
    "sn35.246:4.12": "He would say, ",
    "sn35.246:4.13": "‘I’ve had enough of that lute! Just fetch me the sound.’ ",
    "sn35.246:4.14": "They’d say, ",
    "sn35.246:4.15": "‘Sir, this lute is made of many components assembled together, ",
    "sn35.246:4.16": "which make a sound when they’re played. That is, ",
    "sn35.246:4.17": "it depends on the body, the skin, the neck, the head, the strings, the plectrum, and a person to play it properly. That’s how a lute is made of many components assembled together, ",
    "sn35.246:4.18": "which make a sound when they’re played.’ ",
    "sn35.246:4.19": "But he would split that lute into ten pieces or a hundred pieces, then splinter it up. ",
    "sn35.246:4.20": "He would burn the splinters with fire, and reduce them to ashes. ",
    "sn35.246:4.21": "Then he would sweep away the ashes in a strong wind, or float them away down a swift stream. ",
    "sn35.246:4.22": "Then he would say, ",
    "sn35.246:4.23": "‘A poor thing indeed is this so-called lute and whatever else is called a lute! But people waste their time with it, careless and duped!’ ",
    "sn35.246:4.24": "In the same way, a bhikkhu investigates form as far as it goes, feeling as far as it goes, perception as far as it goes, activities as far as they go, and consciousness as far as it goes. ",
    "sn35.246:4.25": "As he investigates in this way, ",
    "sn35.246:4.26": "",
    "sn35.246:4.27": "",
    "sn35.246:4.28": "",
    "sn35.246:4.29": "any ideas of ‘I’ or ‘mine’ or ‘I am’ do not occur to him.” "
}