{
  "snp4.4:1.2": "",
  "snp4.4:1.4": "These lines neither confirm nor deny the validity of what he regards as “the highest purity”. The point is that the very attitude of taking *something* as pure and giving it priority over everything else implies conceiving (even in relation to Nibbāna, as per [MN 1](https://suttas.hillsidehermitage.org/?q=mn1)), and it is this very conceiving that is the root of the problem. This does not mean one should instead try to deny or dismiss everything that can be known or experienced, (which would imply ‘resting on’ that very act of denial). And resting on things in this way is not a deliberate act: it takes place simply by overlooking one’s attitude and prioritizing the content and ideas regarding the relevant experience. The question of whether the experience itself is “right” or not rests on a wrong premise. ",
  "snp4.4:2.3": "This line, in the context of the preceding ones, encapsulates the entirety of what is *not* Dhamma, (in this way negatively summing up the entire Dhamma as well): nothing but the abandonment of all attachment ([regardless of attachment to *what*](https://suttas.hillsidehermitage.org/?q=mn1#mn1:26.1-mn1:26.4)) gives rise to wisdom, (i.e. full understanding of the nature of any and all things, as the verse further down says) and abandons suffering at its root.<br><br> That is another reason why knowledge and vision in and of themselves, in the sense of any experience no matter how lofty, can never be the source of purity – it is precisely by expecting purity and peace to come from ‘something else’ in this way that one overlooks that very attitude of *reliance* on that something, which is the immediate cause of impurity. ",
  "snp4.4:3.1": "",
  "snp4.4:3.2": "<em>Anīgha:</em> “From something else” (_aññato_) means something external, not just out in the world, but including even mental images, perceptions and visions (the external sense fields). The notion that enlightenment is something that “occurs”, an extraordinary experience that manifests as a result of meditation, is quite common. Although the particulars of it may vary, its general nature is common to every distorted interpretation of the Dhamma. ",
  "snp4.4:5.2": "<em>Anīgha:</em> Again, it is not the presence of notions that is the issue, but implicitly believing purity to lie somewhere within the sphere of notions, whether high or low. The Right View could be said to be [the understanding of the whole domain of notions and ideas](https://suttas.hillsidehermitage.org/?q=mn8#mn8:3.4-mn8:3.6), rather than just one of the many possibilities within said domain. ",
  "snp4.4:5.3": "",
  "snp4.4:5.4": "For those who remain ‘tied up in perceptions,’ it is not because of failing to access something more fundamental ‘beyond’ those perceptions, but because of conceiving those perceptions to be, or to represent, more than they are: in other words, not understanding their nature as perceptions. <br><br> It is this understanding that constitutes the wisdom of the one whose discernment pertains to the nature of any and all things; and so has no need of going ‘high and low’ after specific things/ideas/experiences. <br><br>That’s also what differentiates his wisdom and understanding from the ‘knowledge’ of the one in the first verse. ",
  "snp4.4:7.2": "<em>Anīgha:</em> Which would imply that purity is *in* that concrete phenomenon or experience they’re referring to, but as explained in the first comment above, even Nibbāna is not “pure” when accompanied by conceiving. Thus, it is the principle of non-conceiving and dispassion in regard to anything anyone might call “the utmost purity” that is the actual purity/Nibbāna. <br><br> In other words, true safety lies in not finding safety in anything whatsoever. ",
  "snp4.4:8.3": ""
}