{
  "snp4.4:1.2": "",
  "snp4.4:1.4": "These lines neither confirm nor deny the validity of what he regards as “the highest purity”. The point is that the very attitude of taking *something* as pure and giving it priority over everything else implies conceiving (even in relation to Nibbāna, as per MN 1), and it is this very conceiving that is the root of the problem. This does not mean one should instead try to deny or dismiss everything that can be known or experienced, (which would imply ‘resting on’ that very act of denial). And resting on things in this way is not a deliberate act: it takes place simply by overlooking one’s attitude and prioritizing the content and ideas regarding the relevant experience. The question of whether the experience itself is “right” or not rests on a wrong premise. ",
  "snp4.4:2.3": "Knowledge or vision per se, in the sense of an arisen experience, no matter how lofty or extraordinary, can never be the source of purity – it is precisely by expecting purity and peace to come from ‘something else’ in this way that one overlooks how *expectation itself* is the impurity and cause of suffering. Of course, effort and diligence are a must to progress on the path, but the effort is always in relation to what is here *now* (wrong attitudes and assumptions), and if that is rightly understood, there is no room for placing any emphasis on “experiences”. Also, if it were an experience that purifies one, the purification would be gone if that experience or the memory of it were to be lost, which eventually has to happen owing to the impermanence of all phenomena. ",
  "snp4.4:3.1": "",
  "snp4.4:3.2": "“From something else” (_aññato_) means something external, not just out in the world, but including even mental images, perceptions and visions (the external sense fields). The overall view that enlightenment is something that “occurs” when some sort of extraordinary experience arises (i.e., a cluster of *sense objects*, no matter how elaborate) is quite common, although the particulars of it may vary. ",
  "snp4.4:4.2": "It is precisely the fact of being driven by longing and  internal pressures that constitutes bondage, and so even the right teaching will not free one who takes it up with the same attitude of acting out of pressure that they’ve always had. ",
  "snp4.4:5.2": "Again, it is not the state of having notions that is the issue, but implicitly believing purity to lie somewhere within the sphere of notions, whether high or low. The Right View could be said to be [the understanding of the whole domain of notions and ideas](https://suttas.hillsidehermitage.org/?q=mn8#mn8:3.4-mn8:3.6), rather than just one of the many possibilities within said domain. ",
  "snp4.4:7.2": "Which would imply that purity is *in* that concrete phenomenon or experience they’re referring to, but as explained in the first comment above, even Nibbāna is not “pure” when accompanied by conceiving. Thus, it is the principle of non-conceiving and dispassion in regard to anything anyone might call “the utmost purity” that is the actual purity/Nibbāna. ",
  "snp4.4:8.3": ""
}