{
  "sn46.6:0.1": "Linked Discourses 46.6 ",
  "sn46.6:0.2": "1. Mountains ",
  "sn46.6:0.3": "Kuṇḍaliya ",
  "sn46.6:1.1": "On one occasion, the Blessed One was dwelling at Saketa in the Deer Park at the Añjana Grove. ",
  "sn46.6:1.2": "Then the wanderer Kuṇḍaliya approached the Blessed One and exchanged greetings with him. ",
  "sn46.6:1.3": "When they had concluded their greetings and cordial talk, he sat down to one side and said to the Blessed One: ",
  "sn46.6:1.4": "“Master Gotama, I am one who resides in monastic parks and frequents assemblies. ",
  "sn46.6:1.5": "After the meal, when I have finished my breakfast, it is my custom to ",
  "sn46.6:1.6": "roam and wander from park to park, from garden to garden. ",
  "sn46.6:1.7": "There, I see some ascetics and brahmins engaged in discussion for the benefits of defending their own theses in debate and condemning the theses of others. ",
  "sn46.6:1.8": "But what is the benefit that Master Gotama lives for?” ",
  "sn46.6:1.9": "“Kuṇḍaliya, the Tathagata lives for the benefit and fruit of true knowledge and liberation.” ",
  "sn46.6:2.1": "“But, Master Gotama, what things, when developed and cultivated, fulfil true knowledge and liberation?” ",
  "sn46.6:2.2": "“The seven factors of enlightenment, Kuṇḍaliya, when developed and cultivated, fulfil true knowledge and liberation.” ",
  "sn46.6:2.3": "“But, Master Gotama, what things, when developed and cultivated, fulfil the seven factors of enlightenment?” ",
  "sn46.6:2.4": "“The four establishments of recollectedness, Kuṇḍaliya, when developed and cultivated, fulfil the seven factors of enlightenment.” ",
  "sn46.6:2.5": "“But, Master Gotama, what things, when developed and cultivated, fulfil the four establishments of recollectedness?” ",
  "sn46.6:2.6": "“The three kinds of good conduct, Kuṇḍaliya, when developed and cultivated, fulfil the four establishments of recollectedness.” ",
  "sn46.6:2.7": "“But, Master Gotama, what things, when developed and cultivated, fulfil the three kinds of good conduct?” ",
  "sn46.6:2.8": "“Restraint of the sense faculties, Kuṇḍaliya, when developed and cultivated, fulfils the three kinds of good conduct. ",
  "sn46.6:3.1": "And how, Kuṇḍaliya, is restraint of the sense faculties developed and cultivated so that it fulfils the three kinds of good conduct? ",
  "sn46.6:3.2": "Here, Kuṇḍaliya, having seen an agreeable form with the eye, a bhikkhu does not covet for it, or delight in it, or generate lust for it. ",
  "sn46.6:3.3": "His body is steady and his mind is steady, inwardly well settled and well freed. ",
  "sn46.6:3.4": "But having seen a disagreeable form with the eye, he is not dismayed by it, not daunted, not dejected, without ill will. ",
  "sn46.6:3.5": "His body is steady and his mind is steady, inwardly well settled and well freed. ",
  "sn46.6:4.1": "“Further, Kuṇḍaliya, having heard an agreeable sound with the ear, … ",
  "sn46.6:4.2": "having smelt an agreeable odour with the nose, … ",
  "sn46.6:4.3": "having savoured an agreeable taste with the tongue, … ",
  "sn46.6:4.4": "having felt an agreeable tactile object with the body, … ",
  "sn46.6:4.5": "having cognized an agreeable mental phenomenon with the mind, a bhikkhu does not covet for it, or delight in it, or generate lust for it. ",
  "sn46.6:4.6": "His body is steady and his mind is steady, inwardly well settled and well freed. ",
  "sn46.6:4.7": "But having cognized a disagreeable mental phenomenon with the mind, he is not dismayed by it, not daunted, not dejected, without ill will. ",
  "sn46.6:4.8": "His body is steady and his mind is steady, inwardly well settled and well freed. ",
  "sn46.6:5.1": "When, Kuṇḍaliya, after he has seen a form with the eye, a bhikkhu’s body is steady and his mind is steady, inwardly well settled and well freed in regard to both agreeable and disagreeable forms; ",
  "sn46.6:5.2": "when, after he has heard a sound with the ear, … ",
  "sn46.6:5.3": "smelt an odour with the nose, … ",
  "sn46.6:5.4": "savoured a taste with the tongue, … ",
  "sn46.6:5.5": "felt a tactile object with the body, … ",
  "sn46.6:5.6": "cognized a mental phenomenon with the mind, a bhikkhu’s body is steady and his mind is steady, inwardly well settled and well freed in regard to both agreeable and disagreeable mental phenomena, ",
  "sn46.6:5.7": "then, his restraint of the sense faculties has been developed and cultivated in such a way that it fulfils the three kinds of good conduct. ",
  "sn46.6:6.1": "And how, Kuṇḍaliya, are the three kinds of good conduct developed and cultivated so that they fulfil the four establishments of recollectedness? ",
  "sn46.6:6.2": "Here, Kuṇḍaliya, having abandoned bodily misconduct, a bhikkhu develops good bodily conduct; having abandoned verbal misconduct, he develops good verbal conduct; having abandoned mental misconduct, he develops good mental conduct. ",
  "sn46.6:6.3": "It is in this way that the three kinds of good conduct are developed and cultivated so that they fulfil the four establishments of recollectedness. ",
  "sn46.6:7.1": "And how, Kuṇḍaliya, are the four establishments of recollectedness developed and cultivated so that they fulfil the seven factors of enlightenment? ",
  "sn46.6:7.2": "Here, Kuṇḍaliya, a bhikkhu abides maintaining perspective of the body concurrently with the body, ardent, clearly comprehending and recollected, having removed covetousness and displeasure in regard to the world. ",
  "sn46.6:7.3": "A bhikkhu abides maintaining perspective of feelings concurrently with feelings … ",
  "sn46.6:7.4": "mind concurrently with mind … ",
  "sn46.6:7.5": "phenomena concurrently with phenomena, ardent, clearly comprehending and recollected, having removed covetousness and displeasure in regard to the world. ",
  "sn46.6:7.6": "It is in this way that the four establishments of recollectedness are developed and cultivated so that they fulfil the seven factors of enlightenment. ",
  "sn46.6:8.1": "And how, Kuṇḍaliya, are the seven factors of enlightenment developed and cultivated so that they fulfil true knowledge and liberation? ",
  "sn46.6:8.2": "Here, Kuṇḍaliya, a bhikkhu develops the enlightenment factor of recollectedness … investigation of phenomena … energy … joy … calm … composure … ",
  "sn46.6:8.3": "equanimity, which is based upon seclusion, dispassion, and cessation, maturing in release ",
  "sn46.6:8.4": "It is in this way that the seven factors of enlightenment are developed and cultivated so that they fulfil true knowledge and liberation.” ",
  "sn46.6:9.1": "When this was said, the wanderer Kuṇḍaliya said to the Blessed One: ",
  "sn46.6:9.2": "“Magnificent, Master Gotama! Magnificent! ",
  "sn46.6:9.3": "The Dhamma has been made clear in many ways by Master Gotama, as though he were turning upright what had been turned upside down, revealing what was hidden, showing the way to one who was lost, or holding up a lamp in the dark for those with eyesight to see forms.  ",
  "sn46.6:9.4": "I go for refuge to Master Gotama, and to the Dhamma, and to the Bhikkhu Saṅgha. ",
  "sn46.6:9.5": "From today, let Master Gotama remember me as a lay follower who has gone for refuge for life.” "
}
