{
  "mn10:1.6": "On _ekāyana magga_, see [this comment to MN 12](https://suttas.hillsidehermitage.org/?q=mn12#mn12:37.5).",
  "mn10:2.1": " The [“noble method”](https://www.youtube.com/watch?v=FhIkN4C15Pk) is seeing _paṭiccasamuppāda_ with_ yoniso manasikāra_ (SN 12.41,[MN 2](https://suttas.hillsidehermitage.org/?q=mn%202), [“The Meaning of Yoniso Manasikāra”](https://www.hillsidehermitage.org/wp-content/uploads/2023/06/The-Meaning-of-Yoniso-Manasikara-Bhikkhu-Anigha.pdf).  _sati_ literally means “memory” or “recollection”, from _√sar_  (“remember”). “Mindfulness” often has connotations of “focused awareness” that are foreign to the term _sati_. MN 53 defines a noble disciple endowed with supreme _sati_ as “one who remembers what was said and done long ago”. It is the same quality, just applied to one’s present experience, that is used in all the _satipaṭṭhānas_. Not incidentally, the Right View is necessary for the Right Recollection: it’s impossible to recollect something that isn’t already known. “Focus”, “observation”, “watching” or “bare attention”, on the other hand, require one to forget (ignore or overlook) the general aspects of one’s present situation in favor of particularities, meaning that the domain where the nature of all experiences truly lies is obscured—even if one then goes on to apply the labels of _anicca_, Four Noble Truths, five aggregates, etc., to the objects that are focused on. ",
  "mn10:3.2": "[“Seeing a Body Within The Body”](https://www.hillsidehermitage.org/seeing-a-body-within-the-body/), [“Putting The Body First”](https://www.youtube.com/watch?v=hB9dQFtXMKs). The locative case (_kāye_) conveys the sense of “within” as well as simultaneity, hence I’ve chosen “concurrently with the body”. _anupassī_ is a verbal adjective indicating an ongoing action, in this case of “seeing alone with”, hence “maintaining perspective”. ",
  "mn10:4.0.2": "See [“How to Calm Your Mind”](https://www.youtube.com/watch?v=KwRqWW79kFg) and [“Mindfulness of Breathing and Calming of Aversion”](https://www.youtube.com/watch?v=GrgV9KI5LeI), available in written form in [Dhamma Within Reach](https://www.hillsidehermitage.org/dwr/) and [The Only Way to Jhāna](https://www.hillsidehermitage.org/new-book-jhana/) respectively. ",
  "mn10:4.2": "_parimukhaṃ_ > “at the fore”: This does not mean attending to the sensations of breathing at one’s nostrils, or anything of that nature. The same expression occurs for example in MN 39 and several other passages unrelated to _ānāpānasati_ that are about overcoming the five hindrances by reflecting on their troublesome nature.  _“parimukhaṃ satiṃ upaṭṭhapetvā”_ simply means, both in those passages and here, that one makes the establishment of the perspective the priority. ",
  "mn10:4.3": " Literally: “with memory, he breathes in; with memory, he breathes out”. _sati_ here, as always, pertains to something that is *not* the particular in and out breaths. That is the principle behind all memory: knowing, in regard to what is directly present, something that is *not* directly present. The subject of this memory is not the *sensations* of the in-breath and out-breath (which is why the breath remains throughout the full Ānāpānasati exposition in MN 118, while the background perspective can vary in terms of body, feelings, mind, and phenomena). ",
  "mn10:4.4": " Through this one becomes familiar with how it’s ultimately the body that is responsible for breathing, as one does not get to decide whether the right type of breath at the moment is long or short. This reveals how the nature of breathing constitutes the true foundation for one’s experience, and not one's sense of control and preference. One can try to manipulate it and influence it, but it is apparent if one is honest that this is always secondary to the body, which holds the “final say”. This alone would eventually undercut one’s appropriation of the body if discerned to the sufficient extent, making one’s sense of control (and thus sense of self) be seen as circumstantial—meaning, there is a factual capacity for control, but since it’s subordinate and uncertain, it falls short of justifying any form of ownership and delight. [“Breathing Towards Death”](https://www.hillsidehermitage.org/breathing-towards-death/) and [Notes on Meditation](https://www.hillsidehermitage.org/notes-on-meditation/). ",
  "mn10:4.6": "This doesn't mean expanding one's awareness to include more bodily sensations, as this instruction would sometimes be interpreted. Such an exercise is irrelevant to the task of understanding the unconditional cessation of suffering. MN 44 defines the _kāyasaṅkhāra_ as in and out breathing because “those phenomena are tied to the body”, and thus they serve to outline the entirety of what the body is. The entire six-sense-base, which is where any and all assumptions of ownership would find footing, is seen within the context of the act of breathing, as dependent upon it. This does not involve concentration upon the breath, but the exact opposite: while the six senses are directly experienced, whether while walking, standing, sitting, or lying down, the act of breathing—seen to be in one’s control only relatively speaking—is known as the sustenance that they depend on. ",
  "mn10:5.2": " Only when the foundation that (one’s experience of) the body stands upon is recognized does it become clear how the body is impermanent (in the way that undercuts one’s ownership of it)—how one is privy to neither its arising/increasing nor is falling apart, because it is its foundation (evident from the start to be outside one’s control, such as the functioning of the lungs) which determines that. Merely observing particular instances of rising and waning in sense objects, with no recognition of simultaneous dependence (_paṭiccasamuppāda_), leaves one’s ownership of that same observation unaffected. This is [“perceiving not-self with self”](https://suttas.hillsidehermitage.org/?q=mn2#mn2:8.5) due to not understanding _yoniso manasikāra_. ",
  "mn10:5.3": "[“Mindfulness of the Elements”](https://www.youtube.com/watch?v=psApaFXI_QU) ",
  "mn10:6.1": "Awareness of the current posture can be made the perspective from which anything at all  has to be experienced. All one may be thinking about, no matter if its content is entirely divorced from the present situation, can be discerned as subordinate to the fact that one is currently seated, for instance. Sustaining that simple memory correctly, i.e., with _yoniso manasikāra_, while various phenomena continue to manifest is more than enough to abide “disengaged, not taking up anything in the world”. On the other hand, intently focusing on one’s footsteps while walking, the sensations of the knees touching the floor while sitting, etc., are exercises that revolve around shrinking one’s perspective. ",
  "mn10:8.1": " One who has awareness (_sampajaññā_) is defined in SN 47.35 as one who knows feelings, perceptions, and thoughts as they arise, remain, and cease. But this awareness would always have to pertain to the general, fundamental level of one’s experience (e.g., the thoughts and attitudes behind the desire to engage in a sensation-watching exercise when it arises, rather than the specific sense objects that would be apprehended through said exercise). ",
  "mn10:10.1": " This isn’t meant to be a mechanical visualization of the body parts. For it to classify as a development of perspective”, the *relationship* between the (unattractive) organs and the body (that one takes as attractive by default) must be discerned, while the two are present, as opposed to trying to override one with the other. As with all the other contemplations, the two “bodies” are on different levels, one being primary and the other subordinate—one is a memory about the present experience (the image of body parts) and the other is the present experience itself—“this very body”, which also happens to be perceiving, feeling, and thinking. The same principle applies to the next two contemplations. ",
  "mn10:10.2": "[“Beautiful Side of Ugly, Living SIde of Death”](https://www.youtube.com/watch?v=EwxRFPkurhI). ",
  "mn10:12.1": "[A brief comment on the four elements.](https://suttas.hillsidehermitage.org/?q=mn28#mn28:6.1) ",
  "mn10:32.0": "Feelings must not be confused with sensations. Feeling or _vedanā_ is the general pleasantess, unpleasantness, or neutrality of an experience, while sensations are perceptions (_saññā_, the third aggregate) of the fifth sense base (touch). Sensations/perceptions that would most of the time be felt unpleasantly can sometimes be felt as the opposite, depending on the situation within which they are present. ",
  "mn10:33.4": " Every specific sense experience is necessarily accompanied by a feeling (SN 35.60), but on the whole, there is always one general feeling underpinning the experience. When that feeling is unpleasant, particular pleasures are not gratifying, and when it is pleasant, particular displeasures are not upsetting. By understanding that it is that general feeling (which is always only found to be already there) that determines one’s experience of the world, the never-ending project of trying to feel only pleasure and avoid displeasure is seen as futile, since even if the particular feelings can be manipulated by doing this or that, the general one changes of its own accord. [“Feeling Only One Feeling”](https://www.youtube.com/watch?v=bGtA6eKn8mE). ",
  "mn10:35.4": "_cittānupassanā_ is about not forgetting one’s present mental state. [Knowing a mind of passion as a mind of passion](https://www.youtube.com/watch?v=1XMDbO8JLvo) would pull one away from the otherwise automatic engagement in the thoughts that mind inclines to. By sustaining this perspective instead of directly trying to manage unwholesome thoughts—[focusing on the symptoms instead of the illness](https://www.youtube.com/watch?v=edaHv35nVek)—the mind would be purified from passion towards the mind (SN 47.37). See the discussion in the comments of [MN 18](https://suttas.hillsidehermitage.org/?q=mn%2018). ",
  "mn10:36.2": "",
  "mn10:36.4": "The five hindrances are not to be found in the content of an arisen phenomenon, and thus they cannot be abandoned by suppressing this or that thought. They are always within, “internally”, regarding any phenomena that arise, and this includes experiences (seemingly) free from thinking that are arrived at through focused attention. Recognizing them correctly in itself completely undermines one’s capacity to feed them further, as they require _ayoniso manasikāra_ to grow (SN 46.51). [“Seeing Through the Hindrances Instead of Denying Them”](https://www.youtube.com/watch?v=QDdMyOTylH0) ",
  "mn10:38.1": " The aggregates are to be understood as the foundations of any experience, which, when put into perspective, undermine one’s assumed mastery of it. They are not things that one can observe and “grab” by means of direct attention, as that the result of that would just be a particular instance of the aggregate of perception. Similarly for the sense fields below. ",
  "mn10:40.1": "“In the Seen, Just The Seen”[https://www.youtube.com/watch?v=Jp0WtFO5qm0]. ",
  "mn10:40.3": "The fetters of passion and aversion do not arise by themselves, hence it is possible if one understands rightly—the principle outlined throughout this entire discourse, to be specific—to ensure that they do not arise again without having to neurotically stay away from the things that would *trigger* the fetters. ",
  "mn10:42.2": "See [this comment](https://suttas.hillsidehermitage.org/?q=mn2#mn2:18.0-mn2:21.2). ",
  "mn10:44.1": "[“Only the  Noble Truth of Pain”](https://www.youtube.com/watch?v=3ZwG3FXsKaA), [“It’s Not the Pain that Makes You Suffer”](https://www.youtube.com/watch?v=f8R1za5f9sI) ",
  "mn10:44.3": ""
}