{
  "mn134:0.2": "This discourse is widely known but its message is often misinterpreted. It’s not that one must stop intending in relation the past or the future altogether—which is a matter of choice only on the superficial, not fundamental level—but that one must stop *delighting* in such thoughts. This is achieved through [yoniso manasikāra](https://www.hillsidehermitage.org/wp-content/uploads/2023/06/The-Meaning-of-Yoniso-Manasikara-Bhikkhu-Anigha.pdf). See also [“Gateway to Nibbāna”](https://www.youtube.com/watch?v=_XKSVuKe8_c). ",
  "mn134:3.5": "A phenomenon is a totality of all the aggregates, the present situation as a whole (“sitting alone in a room perceiving various agreeable or disagreeable mental images about the past or future”), and not just one specific object within that. ",
  "mn134:3.6": " One sees thoughts about the past or future *as present phenomena* too. This automatically prevents one from delighting in and getting pulled by them if done properly, without having to deny their presence. ",
  "mn134:3.9": "",
  "mn134:3.15": "Diligence is required to curb one’s own tendency to the wrong type of diligence: interference with arisen phenomena, most especially feelings. It’s not a matter of just relaxing and letting things be. ",
  "mn134:4.5": "It’s not just *one way* of practice; it’s the template for every type of mental cultivation because it’s the Middle Way: one does not indulge in presently arisen states, nor does one try to replace them (beyond the foundational setup of virtue and sense restraint, which needs to be there from beforehand). The four _satipaṭṭhānas_ are the practices to achieve this Middle Way: they serve as a foundation with which the arisen form, feeling, perception, intention, and consciousness can be allowed to be what they are without thereby falling into appropriation of them. If they are used as _objects_ to directly attend to, they simply replace the present experience, losing their entire purpose. When the Suttas speak about [“obliterating”](https://suttas.hillsidehermitage.org/?q=mn2#mn2:20.1-mn2:20.2) unskillful thoughts, they refer to the stopping of one’s intentional engagement and proliferation of certain feelings and perceptions, not to the stopping of those feelings and perceptions themselves. The background “anchoring” that the _satipaṭṭhānas_ create, comparable to [a post](https://suttacentral.net/sn35.247/en/sujato?lang=en) to which wild animals are tied to as they continue to pull in different directions, is what prevents precisely this intentional engagement without thereby generating another one. Perseverance in this type of effort eventually leads to an [opening *amidst* the confinement](https://suttas.hillsidehermitage.org/?q=an9.42#an9.42:3.2-an9.42:4.2) of those same feelings and perceptions instead of providing one with an altogether different content of experience. ",
  "mn134:8-13.3": "The Pāli has a direct quote of the thought and says one does not delight *there*. It does not say one _doesn’t have_ memories about the past. ",
  "mn134:8-13.5": "This is ironically what’s happening behind the scenes whenever one attempts to suppress thoughts about the past or future, and fabricate more agreeable states in general. One internally longs for a particular type of experience that has not yet arisen, whereas the right cultivation is equanimity towards what is there *now*, as said in the verse. Obviously, there has to be a wholesome interest (_chanda_) in developing the mind, but that interest should drive one to abandon all longing (_abhijjhā_, the first hindrance), not to justify certain types of it. ",
  "mn134:8-13.9": "Similar to the above, it’s only because of still appropriating the five aggregates to some extent that one would seek to change their _content_, instead of cultivating the unfaltering recognition of the nature of whatever content is presently arisen. "
}
