{
  "mn13:6.2": "Even though technically the term usually occurs as plural in Pāli, I have chosen to translate _kāma_ as “sensuality” throughout because it can accommodate both the instances when it refers more to desirable objects as well as when it refers to the desire itself. _kāma_ may be accurately translated as “pleasure”, while _sukha_, which can be of a wholesome kind such as that of _samādhi_, would instead be “ease”; the implication of the five senses is actually not present in the word _kāma_ itself, but in the definition of the five _kāmaguṇa_. However, as AN 6.63 says, the five strands of sensuality are not _kāma_; _kāma_ is one's *passionate intention* (_saṅkapparāga_). The _Kāmasutta_ (Snp 4.1) describes things like property, cattle, and wealth, which may not be considered not crudely “sensual”, as _kāma_. ",
  "mn13:7.4": "Note that a thing being likable, desirable, etc., is not a property of the object “out there in the world” that is publicly agreed as as such by everyone. A thing's attractiveness is determined by one's own sense organs and the preferences they have circumstantially developed. “Beauty is in the eye of the beholder”, as the saying goes. It is therefore necessary to make oneself fully dispassionate and unmoved regarding what one's senses happen to find agreeable, as opposed to removing the agreeability itself. The five strands of sensuality are called “confinement” in AN 9.42, and the true escape can only be found *within* that confinement. See [“Not Wanting the Wanting of Sensuality”](https://www.youtube.com/watch?v=_ttVxzlzlj0). ",
  "mn13:8.1": "MN 54. ",
  "mn13:18.1": "I've opted for the singular even though the Pāli is plural so as to not cause confusion with “forms” as the counterparts of the eye organ. ",
  "mn13:32.5": "i.e., a sense of safety from all threats. See the similes given for the abandonment of the five hindrances in MN 39. This is quite different from the popular conception of the pleasre of the _jhānas_, where the gratification comes from a sense of ecstasy (often centered around physical sensations) that has nothing to do with the _recognition_ that one is free from danger and affliction. The bliss is usually only possible through disabling one's capacity to reflect in the way that the Suttas say give rise to the right type of joy (_pīti_). There are a great many passages describing what actually leads leads to this joy, and it's not concentration techniques. A few examples: DN 2, DN 9, DN 10, DN 13, MN 7, MN 15, MN 39, AN 9.41, AN 10.2. See also AN 6.73. "
}