{
  "mn16:0.2": "The term _khila_ that is central to this Sutta has often been interpreted by translators as (emotional) “callosity”, or “harshness”. But the word _khila_ here is being used  metaphorically to describe the first set of five attitudes because they cause the person's mind to be infertile ground (khila, (m. nt.) (cp. Sk. khila): waste or fallow land) for growth in the Dhamma. At the same time there is likely a play of words: _khīla_  means stake or post, and so, the sense of something that is fixed and immovable is also being conveyed, referring to the bhikkhu being unwilling to change his mind about some gripe or another regarding the teaching, hence I've chosen the rendering “obstinacy (examples of this are found in MN 22, MN 38, and MN 65). A person can be as tender and kind as they please while still harboring these obstinacies internally, and the opposite is true as well—case in point being Ven. Mahākassapa, one of the foremost Arahants who in the eyes of most people today would've qualified as “harsh” (SN 16.11). (Additionally, even if the intended word was _khīla_ and not _khila_, three long syllables in a row are usually avoided in Pāli, leaving us still with the same _cetokhila_.) ",
  "mn16:13.1": " The first three obviously don’t imply that one needs to be a non-returner in order to make progress in the Dhamma, but that one certainly must have abandoned *actions* rooted in passion for sensuality, the body, and form. That is the only way to increase one’s capacity to understand the Dhamma (i.e., abandon the five hindrances, see AN 10.61 on what causes the hindrances). Those who already have a sufficient capacity (with “little dust in their eyes”) can understand it without a long period of developing restraint beforehand, like many householders of the Buddha’s time who attained stream-entry upon their first encounter with the teaching. For whomever it does not happen that way, there is “dust” that needs to be cleared up through the abandonment of passion for these three things, as it clearly indicates that one cannot presently understand the Four Noble Truths despite having more information about them than the average attained layperson in the Buddha's time probably did. See [“Stream Entry for Laypeople”](https://www.youtube.com/watch?v=o2AWxZnxeYk). ",
  "mn16:26.1": " _iddhipāda_ > basis of spiritual ability. “Psychic power” is inappropriate because that's only one side-effect of developing the _iddhipādas_. The Buddha always taught them chiefly for the sake of liberation, which is a spiritual ability too, and the only one that is guaranteed to come from developing these things. "
}