{
  "mn18:1.1": " [A discussion on this Sutta](https://www.youtube.com/watch?v=MfTM20wVhHg). ",
  "mn18:4.1": " “Non-contention” does not mean that the Buddha refrained from pointing out the fallacies in the views that were an obstacle to the liberation he realized (e.g., [MN 11](https://suttas.hillsidehermitage.org/?q=mn11), [MN 14](https://suttas.hillsidehermitage.org/?q=mn14), [MN 22](https://suttas.hillsidehermitage.org/?q=mn22). On being “underlain”, see SN 12.38. This is also what is meant with “harboring [a hindrance] internally, one meditates”, in MN 108, AN 11.8, and it's the aspect that the unskilled monk overlooks in [SN 47.8](https://suttas.hillsidehermitage.org/?q=sn47.8). This is the reason why the traditional approach to meditation is entirely inadequate: subtler intentions infected with hindrances will always be “underlying” the act of concentration, no matter how “one-pointed” it is. See [“The Nature of Ignorance”](https://www.hillsidehermitage.org/the-nature-of-ignorance/). One ceases to be “underlain” by developing _yoniso manasikāra_, on which see [MN 2](https://suttas.hillsidehermitage.org/?q=mn2), and [this essay](https://www.hillsidehermitage.org/wp-content/uploads/2023/06/The-Meaning-of-Yoniso-Manasikara-Bhikkhu-Anigha.pdf). ",
  "mn18:8.1": " This is the controversial term _papañcasaññāsaṅkhā_, discussed in [this short essay](https://www.hillsidehermitage.org/papanca-sanna-sankha/). “Proliferation” (_papañca_) here means something much more nuanced than simply an overuse of concepts and thinking. Allowing one's mind to overly dwell on the details of something would be a form of proliferation not because of the “amount” of thinking that is taking place, but if and when that thinking is accompanied by delight and craving. See the next comment. ",
  "mn18:8.2": " In other words, the problem is not that such things arise (thoughts and mental activities of an active and forceful nature), but that the mind is not dispassionate towards them. See AN 6.55, SN 35.228, and the talk [“Becoming Imperturbable”](https://www.youtube.com/watch?v=-039SYi2a94). ",
  "mn18:8.4": " It is the categorical end to all these things because one's dispassion and withdrawal no longer depends on any circumstances, including the intensity of the phenomena that arise at the six sense fields. In contrast to this, the natural tendency for the ignorant mind is to strive for freedom through the suppression of the besetting perceptions, such that, to use the simile from AN 6.55, the mind does not tremble because there is no storm, not because it's immovable. ",
  "mn18:12.3": "_jānaṃ jānāti, passaṃ passati_ > “knows while knowing; sees while seeing”. This is essentially the principle of _yoniso manasikāra_, and it's how the Arahant is not “underlain by perceptions” as said above. The Buddha's knowledge-and-vision does not simply occur at the level of attention and perception (e.g., extraordinary meditative experiences or visions), but at the level of understanding the nature of any and all perception while it takes place, regardless of whether its of a mundane or extraordinary kind (SN 22.59: “*all* perception, whether past, present, or future ...”). ",
  "mn18:17.1": " The point of Ven. Mahākaccāna's explanation here is that, instead of trying to prevent the besetting perceptions from manifesting, one attends to it [“through the origin”](https://suttas.hillsidehermitage.org/?q=mn%202), which means simultaneously keeping in mind the basis on which its entire manifestation depends, i.e. that the manifestation is inconceivable without that basis. This eventually results in the mind being unable to find anything to delight in within that experience, as the entire array of besetting perceptions is now seen as impermanent, conditioned by the eye, a lump of flesh that is fully liable to destruction. This is the right kind of equanimity, born of renunciation instead of circumstantial management of feelings (MN 137). This is how _paṭiccasamuppāda_ is concretely reflected on, how the [_satipaṭṭhānas_ ](https://suttas.hillsidehermitage.org/?q=mn%2010) are practiced, and how the two extremes of indulgence and denial (of the besetting perceptions) are both avoided (SN 1.1, SN 12.15): the Middle Way. ",
  "mn18:22.3": "i.e., a _bhikkhu_ with the Right View who is able to see _paṭiccasamuppāda_. The exposition would remind him that the work of overcoming the defilements is entirely doable, because it does not depend on something outside his control—whether the besetting perceptions arise or not. They inevitably will (SN 35.28, SN 35.240, SN 4.19). It depends solely on whether he sustains the right perspective in face of them, and that is fully in his control. "
}
