{
  
  
  "mn19:2.2": "[“Good Thoughts, Bad Thoughts”](https://www.youtube.com/watch?v=VBiB0W7U6FQ) ",
  "mn19:2.3": "A sensual thought is a thought that is underlain by a mental state of delight and passion, not a thought that is about something in the domain of the five senses, in which case almost every thought would be a sensual thought. That would be ludicrous, and is how one arrives at the idea that the only way to be free from hindrances is to suppress all thinking. The same thought—about, say, agreeable food—is determined as involving sensuality or not by the more general state of mind. This is why sometimes, if the mind is in a depressed or anxious state, thinking about the exact same things that used to excite the mind fails to do so. Therefore, just as with the hindrances, one needs to be able to recognize when there is sense-desire “internally”, as discussed in the [context of the satipaṭṭhānas](https://suttas.hillsidehermitage.org/?q=mn10#mn10:36.4), to be able to even recognize the sensual thoughts (and the rest) as described here, let alone to dispel them. See [“Sensuality VS Agreeability”](https://www.youtube.com/watch?v=wc9XWIZ64Wc). ",
  "mn19:2.5": "Translating _nekkhamma_ as “non-sensual” instead of “renunciation”, since the etymology is ambiguous and allows for either. “Non-sensual” fits better in this context, as thoughts of renunciation would involve active maintenance and involvement. See the discussion in the comments below. ",
  
  "mn19:3.4": " [“The Ultimate Method for Overcoming Hindrances”](https://www.youtube.com/watch?v=9voIhZij5Io) ",
  "mn19:3.5": "This reflection is not a “one-shot” affair. The context of danger and harm needs to be fostered and more clearly discerned in order for the thoughts to subside. One knows the thought of sensuality, aversion or cruelty has subsided when one is freely able to think about the same topic without at all experiencing the mental state of desire, aversion, or cruelty. As stated at the end of the following Sutta, one who develops this sort of practice is able to “think whatever he wants to think and not think whatever he doesn’t want to think”, without any harmful mental states. ",
  
  "mn19:6.1": "“Along with” (_anu-vitakketi anu-vicāreti_) is a relevant nuance in the Pāli that seems to have been missed so far. The sensual thoughts and the rest will continue to arise in a myriad forms for as long as the mental state causing them is there, but one can incline the mind in the opposite direction so that eventually the mental state changes, by *not thinking along with* the harmful thoughts. This is different from simple-mindedly casting aside the *subject* that is giving rise to the sensual thoughts, which does not really address the underlying issue. See the comments in the [previous Sutta](https://suttas.hillsidehermitage.org/?q=mn%2018). This is the “starvation” of hindrances that SN 46.51 refers to: _yoniso manasikāra_ towards the phenomenon that *provokes* the bad mental states, whereas _ayoniso manasikāra_ would be “thinking along with” the sensual thought, either by welcoming it or overly denying it. ",
  
  
  "mn19:7.5": "See the recurring passage about how the hindrances are surmounted by contemplating their unfavorable nature, comparing them to debt, illness, imprisonment, slavery, and an uncrossed desert (e.g., DN 2 & MN 39). ",
  
  "mn19:8.8": "This part is ordinarily thought to mean that to enter the first jhāna one must bring thinking to a halt because *all* thinking is tiresome and incompatible with peace. But the Pāli is _anuvitakketi anuvicāreti_, the same “thinking along with” already explained in a previous comment. What this is saying is that the active utilization of thinking for the sake of inclining the mind is tiresome, even though its certainly indispensable initially. Steadying the mind internally means making it so that actively contemplating (the “_anu-_” component) the danger in unwholesome states is not necessary to keep them at bay. It doesn't mean eliminating _vitakkavicāra_ altogether, which only occurs in the second jhāna. ",
  
  "mn19:8.11": " [“Jhāna Comes Only After Renunciation”](https://www.youtube.com/watch?v=Z7DqygBzFlo) ",
  "mn19:9-10.12": "Compare this with its Chinese Āgama parallel, Madhyama Āgama 102 (pg. 259 of this freely available PDF: https://www.bdkamerica.org/product/the-madhyama-%E2%80%82gama-middle-length-discourses-volume-ii/). Most importantly, at the point where the Buddha realizes that continuously “thinking along” thoughts of renunciation, non-aversion, and non-cruelty would be tiresome, and decides to “compose his mind internally” instead, the Āgama parallel goes on to describe a state such that “thoughts in accordance with the Dhamma” were “allowed to arise” as opposed to intentionally cultivated, and that dwelling in this way, the mind was no longer troubled. It is implied there that this state of mind—for which the same simile below of the cowherd only needing to “remember that the cows are there” is used—is in fact the first jhāna, as right after it, the Buddha enters the second jhāna. Further support for this is found in MN 78: the first jhāna is where sensual, averse, and cruel thoughts cease without remainder, whereas their opposites only cease in the second jhāna. ",
  
  
  "mn19:14.1": "Applied and sustained thought”, “directed thought and evaluation”, “placing the mind and keeping it connected”—none of these popular renderings correspond to the free-roaming _vitakkavicāra_ of the first jhāna. These are still the active _anuvitakketi_ and _anuvicāreti_ referred to above, whereas, ironically, those interpretations tend to be chosen because simple “thinking and pondering” is regarded as “too coarse” to be present in the first jhāna. The very reason why the first jhāna is peaceful is precisely because there is no need to “apply, place, direct…” or even “restrain” anything anymore, hence the simile of the cows roaming free and the cowherd having to do nothing but watch them from afar. Note that “verbal thinking” does not cease in the first jhāna, as is generally expected. SN 36.11 explains that what ceases is _vācā_, meaning speech itself. n MN 44, _vitakkavicāra_ is said to be the “verbal activity”, understood in the sense that “having thought and pondered, one breaks into speech (vācā)”. Thus it is the “breaking into speech” on account of verbal thinking that ceases in the first jhāna, not the verbal thinking as such. ",
  
  
  
  
  "mn19:25.1": "[MN 25](https://suttas.hillsidehermitage.org/?q=mn%2018) "
  
}