{
  "mn1:1.1": "https://www.youtube.com/watch?v=i5teUsZUSk0 ",
  "mn1:2.1": "The“root”being described is not a metaphysical concept, but simply ignorance in its all-pervasiveness. The purpose of the discourse, and the reason for the extensive repetition, is to show that no experience whatsoever that an ordinary person has escapes the“root”of conceiving. ",
  "mn1:3.1": "The“true persons”are the noble individuals, who have understood and acquired the Noble Eightfold Path (SN 45.26, SN 55.5). ",
  "mn1:3.2": "https://www.youtube.com/watch?v=BZvqDJlxvxc ",
  "mn1:3.3": "“Perceiving”and “conceiving” here do not refer to layering concepts and notions over the“raw”experience—a fallacious view. An experience of an“ultimate reality”that is supposedly free from concepts would be affected by the ordinary person’s conceiving just as much as any regular experience. ",
  "mn1:3.5": "In other words, the only way to not conceive is to cease to be a _puthujjana_, to become one who does understand. ",
  "mn1:25.1": "i.e., anything and everything. The six internal sense bases coupled with their external counterparts constitute everything, or“the All”(SN 35.23). ",
  
  "mn1:26.2": "Even a so-called“glimpse of Nibbāna”would be contaminated by the very same conceiving. It would arise from the same “root“, as it is simply another perception whose *nature* is not understood, no matter how extraordinary, groundbreaking, or revelatory it appears. ",
  "mn1:27.1": "A“trainee”is a noble one who is not yet an Arahant (SN 48.53).“Comprehends”(_abhijānāti_) means that the noble disciple rightly knows the entire“scope”of any experience by default. While for an ordinary person a tacit taking of some ill-defined part of the picture as their Self always lingers “the knower”, “the doer”, etc.)—even if they fully“agree”with the doctrine of _anattā_ and deliberately refrain from labeling anything as “I” or “mine”—, a trainee fully understands even that subtle“inner end”that a _puthujjana_ takes as their Self to be equally within the experience of earth, water, etc. If what *would* be taken as self is, instead of being denied, seen to be squarely within the experience, then it is impossible for it to be taken as an extra-spatial and extra-temporal master of the same experience without having to destroy it. That assumed mastery is what the wrong view of self really boils down to, not to whether that which *can* be taken as the Self/master on (due to ignorance)“really exists”or not. ",
  "mn1:27.2": "It is only the trainee who, on account of their understanding, has the choice to dispel conceiving, and persevering in that is how they would eventually attain Arahantship. ",
  "mn1:75.4": " Translating rāga as “passion”. “Greed” is _lobha_, which is coarser and oriented more towards external things, whereas “lust” has sexual connotations. _Rāga_, on the other hand, is very general, including even the _arūparāga_ still present in a non-returner, who is by definition already free from greed and lust. ",
  "mn1:123.4": " This corresponds better to _moha_ than “delusion”, which tends to signify an incorrect belief regarding a specific state of affairs. “Delusion” in the context of Dhamma (meaning crudely wrong beliefs like eternalism) is more of a side effect of the lack of clarity (muddledness) regarding the nature of one’s experience, which is why simply being told the way things truly are and accepting the right views intellectually, thereby ceasing to be “deluded”, is by no means enough to destroy _moha_. ",
  "mn1:147.4": "All Arahants fully understand their experience to the extent necessary to be completely free from suffering, but the Buddha understands experience beyond that point. "
}