{
  "mn20:1.1": "[“Become a Master of your Thoughts”](https://www.youtube.com/watch?v=Woq8vFgl2Rs) ",
  "mn20:3.1": "It is crucial to note that this doesn't mean one eliminates the unwholesome thoughts simply by overriding the entire arise experience with a different one (e.g., moving one's attention to sensations of breathing to stop all mental activity). It means that while the overall experience of the mind being provoked by the respective perceptions still remains, one makes the effort to emphasize other aspects within that same experience that do not serve as fuel for the unwholesome. In this way, the mind actually gains perspective over the assailing phenomena, such that it is no longer passionate, averse, or muddled despite their presence. Replacing the pressuring phenomena altogether, which is generally the tacit goal in contemporary meditation methods, only serves to cover up the problem, and it does not at all fit the simile given of knocking out a coarser peg with a subtler one. See the comments in [MN 18](https://suttas.hillsidehermitage.org/?q=mn18), and[“Seeing Through The Hindrances Instead of Denying Them”](https://www.youtube.com/watch?v=QDdMyOTylH0). ",
  "mn20:3.2": "The thoughts—the mind's intentional welcoming and revolving around the phenomena or images, not the phenomena or images themselves—are given up. ",
  "mn20:4.2": "[MN 19](https://www.youtube.com/watch?v=QDdMyOTylH0), [“The Ultimate Method for Overcoming Hindrances”](https://www.youtube.com/watch?v=9voIhZij5Io). ",
  "mn20:5.1": "One should ignore and not pay attention to the *thoughts*, the mind's intention to revolve around the images, instead of ignoring the images themselves, which is, in the fundamental sense, not possible. Forcefully trying to ignore an arisen perception entails acknowledging and reacting to it—an attempt to control the aggregates (SN 22.59). One can, however, at any given instant abandon *mental action*, and this is what is being referred to. [“Stop Thinking That You Can Stop Thinking”](https://www.youtube.com/watch?v=Bsv9JLMh4e8) ",
  "mn20:6.1": "One should recognize the extent to which one is actively engaging in and proliferating the thoughts, and then simply stop that activity, hence the simile. Again, this does not refer to stopping the images that the mind is assailed by, but to abandoning the involvement with them, which *is* entirely deliberate, just like a choice to walk instead of stand. ",
  "mn20:7.2": "_cetasā cittaṃ_ > “mind with mind”. First one needs to [see the _citta_](https://www.youtube.com/watch?v=lMl8C1ViL1c) in order to “crush” it. Straining extra hard to suppress *perceptions* is something very different, and it doesn't take any wisdom at all to do that. ",
  "mn20:7.5": "See the comments to [MN 8](https://suttas.hillsidehermitage.org/?q=mn8#mn8:1.1). ",
  "mn20:8.12": "i.e., no defilements arise no matter what one thinks about, as opposed to defilements not arising because the range of attention is limited. "
}