{
  "mn26:15.13": "It is evident that the teaching of Aḷāra Kālāma was more than just a contemporary concentration method or system. As said above, there were things to be learned and *comprehended* in that teaching, and the _bodhisatta_ had a sense that there was a deeper form of  “knowing and seeing” than what he had so far achieved. In MN 106, the *reflection* that leads to the field of nothingness is described, and it is likely that Aḷāra Kālāma's teaching centered around something similar to that, but that he was the only one in the group who was able to not only preach those principles but also gain the corresponding _samādhi_. ",
  "mn26:16.13": "The contemplation that leads to this attainment is given in MN 106, and AN 10.29 describes that view as “the highest among outsiders”. Again, as with Aḷāra Kālāma above, this teaching was about more than just some arbitrary concentration “technique”. It was a _dhamma_, a principle/phenomenon to be understood and realized. Further below, both of his former teachers are declared by the Buddha to have “little dust in their eyes”. ",
  "mn26:17.7": "A fuller account of this is given in MN 36. ",
  "mn26:19.4": "_idappaccayatā_, lit. “dependence-upon-this”. This is a principle of simultaneous dependence. It's about knowing the underlying foundation of one's experience while that experience is there so that the appropriation of it ceases. _paṭiccasamuppāda_ is not an explanatory, pseudo-scientific description of how our experiences come to be or are in some sort of continuous “flux”. In SN 12.67, Ven. Sāriputta employs the simile of two sticks standing in (simultaneous) dependence upon each other to describe _paṭiccasamuppāda_.   See the comments in [MN 10](https://suttas.hillsidehermitage.org/?q=mn10) and [this talk](https://www.youtube.com/watch?v=igsI_pMfrrQ). ",
  "mn26:19.5": "[“The Stilling of All Activities”](https://www.youtube.com/watch?v=z1qG8z_yV1M) ",
  "mn26:19.6": "It is worthwhile to ponder on this. If the Dhamma were as easy to convey and grasp as it's typically assumed today, there would be no reason for the Buddha to say this. ",
  "mn26:19.10": "",
  "mn26:19.11": "",
  "mn26:19.14": "*This* is “the dust in people's eyes”. ",
  "mn26:19.16": "Warm-hearted benevolence and altruism are sometimes wrongly ascribed to the Buddha as motivations for his efforts to teach, in spite of this oft-repeated account. ",
  "mn26:22.5": "",
  "mn26:22.7": "MN 36 describes with a [simile](https://www.youtube.com/watch?v=4_wfPa7EjZ0) the reason why some people have the ability to see the Dhamma and others not. Establishing one's mind in the field of nothingness, as Aḷāra Kālāma did, entails going well beyond the threshold of abandoning sensuality, which is the first jhāna. That is why he would've easily understood it. See also AN 9.47. ",
  "mn26:33.1": "See AN 9.42. One is “confined” within the five strands of sensuality, i.e., for as long as one is alive, *something* will have to be experienced as pleasant and alluring. So the only true escape is *within* the confinement: learning how to be dispassionate and seeing the danger in the midst of those things ([MN 25](https://suttas.hillsidehermitage.org/?q=MN25)). However, this doesn't mean that it is possible to perform _actions_ of sensual nature while still partaking in the escape; see the wrong view proclaimed by Ariṭṭha in [MN 22](https://suttas.hillsidehermitage.org/?q=MN22). It also doesn't mean that a hectic environment loaded with temptations is not an impediment for one whose mind is still not liberated from sensuality (MN 36, the simile of the wet sticks). Only in seclusion does one begin to see what the “snares” really are (AN 6.63). "
}