{
    "mn28:6.1": "A brief note on the four elements or _dhātu_: this is not a framework for explaining the external word in the manner of science or physics, but a characteristic of every arisen phenomenon in one’s experience— which is to say, of everything in the ultimate sense. A scientist’s *experience* of studying or observing physical forces, states of matter, or subatomic particles has the four elements as its foundation. Consequently, as explained further down in the discourse, even mental phenomena have a component of form or _rūpa_—which is defined in terms of the four elements—just like of all the other aggregates. ",
    "mn28:6.7": " One should see that there is no fundamental difference between the two. The internal form, upon which one’s whole life depends, is not somehow more permanent or reliable than the external one. ",
    "mn28:8.5": " If there were no earth element making up the ear, or any other sense base, there could be no _phassa_. The latter is thus also impermanent. See the comments in [MN 18](https://suttas.hillsidehermitage.org/?q=mn18). ",
    "mn28:9.8": "This is the attitude that’s in accordance with the recognition that the internal earth element does not have a privileged position to the external one. It’s not about *trying* to experience bodily pain however, but about a mental context of dispassion that would not budge no matter what happens to the body. ",
    "mn28:26.1": "Again, the point here is that there is no miraculous reason why it couldn’t at any time fall apart just like a building. ",
    "mn28:27.1": "The “corresponding engagement” (_tajjo samannāhāro_) is automatically there in a mind with _avijjā_ (_avijjāpaccayā saṅkhārā_). With that engagement, there is the corresponding consciousness (_saṅkhārapaccayā viññāṇaṃ_). If there were not that ignorance nor the engagement/_saṅkhāras_ that automatically comes with it, there would be no manifestation of the _five assumption-aggregates_, i.e., there would be no _dukkha_. It is because of this that a _puthujjana_ must regard Arahantship as something inconceivable from their present point of view: it is the utter cessation of the five assumption-aggregates (which are _sakkāya_ or “personality”, MN 109), which is to say, the cessation of everything that makes them what they are. Only the stream-enterer who sees _paṭiccasamuppāda_ and its cessation knows how to put an end to the five assumption-aggregates so that only the five aggregates remain. ",
    "mn28:28.10": "Such a bhikkhu sees paṭiccasamuppāda and the cessation of suffering, so he’s at least a sotāpanna. The same applies whenever this last phrase occurred previously in the Sutta. "
}