{
  "mn2:0.2": "[MN 2 Sutta Study](https://www.youtube.com/watch?v=UiaSmfyHcEg) ",
  "mn2:2.1": "",
  "mn2:3.1": "I translate _āsava_ as “influx”. In SN 12.32, Ven. Sāriputta states that his complete liberation is defined as an abiding where “_āsavas_ do not flow in (anvāssavati)”. This illustrates how the _āsavas_ come *into* instead of *out of* the mind, which is implied in “outflow” or “effluent”. The mind of the ordinary person however does not *become* contaminated with _āsavas_, but rather has been so always, without a beginning (AN 10.61, SN 48.50). Only after understanding _yoniso manasikāra_, and thereby gaining the Right View, is it possible to overcome the influxes, as stated here. ",
  "mn2:3.3": "_yoniso manasikāra_ and _ayoniso manasikāra_. For an in-depth treatise, [see my essay on the subject](https://www.hillsidehermitage.org/wp-content/uploads/2023/06/The-Meaning-of-Yoniso-Manasikara-Bhikkhu-Anigha.pdf). ",
  "mn2:3.5": "Compare with AN 1.66 and SN 46.51. ",
  "mn2:5.3": "This is not as straightforward as focusing on certain objects and avoiding others. That should be quite evident from the context, since if it were as simple as that, there would be no need to *understand* what things need to be attended to and why, i.e., what is _kusala_ and what is _akusala_, the knowledge which sets apart a noble disciple from an ordinary person (MN 9). It would be a matter of adhering to a prescribed set of instructions mechanically. ",
  "mn2:6.2": " One directs ones mind in such ways precisely because one is not aware of oneself doing so. One might even think that the current direction of attention is wholesome because the topic is superficially “good”, while in reality the deeper motivation for it is affected with defilements. <br><br> The reason for not knowing what to attend to and what not to attend to is not a lack of learning, but a lack of familiarity [with one’s own mind](https://www.hillsidehermitage.org/the-cues-of-the-mind/). ",
  "mn2:7.1": "",
  "mn2:7.3": "It's not that the person would necessarily be asking themselves these specific questions, but rather that not knowing how to attend through-the-origin would make one at least implicitly regard such questions as important, or at least agree with the premises that they stem from. Such questions are often implied in people’s attempts to clarify doctrinal points like rebirth and not-self. ",
  "mn2:7.4": "A person may not ask themselves these specific questions, but by not knowing how to attend through-the-origin, they would implicitly regard such questions as relevant, or agree with the premises that they stem from. Such questions are often implied in people’s attempts to clarify doctrinal points like rebirth and not-self. ",
  "mn2:8.5": "The less clearly defined, background aspect of experience where choice and intentionality are found can be implicitly taken as self, even though specific phenomena are regarded as not-self. ",
  "mn2:8.6": "The reflective aspect of experience can be regarded as not-self, while the more concrete domain of the five senses—the “present moment”in contemporary parlance—is implicitly assumed as self (in the sense of being welcomed and delighted in). ",
  "mn2:9.3": "“Limpid, bhikkhus, is this mind, but it is blemished by adventitious defilements. The unlearned ordinary person does not understand this as it is; therefore I say that for the unlearned ordinary person there is no development of the mind.”“Limpid, bhikkhus, is this mind, and it is freed from adventitious defilements. The trained noble disciple understands this as it is; therefore I say that for the instructed noble disciple there is development of the mind.” —AN 1.51-52. <br><br> It is only with this understanding as foundation that the other 6 categories of influxes below can be abandoned. ",
  "mn2:11.1": "_Dukkha_ is not to be found at the level of particular objects and experiences (which is why liberation from suffering amid disagreeable experiences is possible), but in one’s “background” attitude of resisting them. Hence, that attitude can only be recognized and the Four Noble Truths understood if one has learned how to attend “through-the-origin”, by means of which the full subtlety of craving can eventually become apparent, and the right view attained. ",
  "mn2:11.3": "_sīlabbataparāmāsa_: “Clinging to rites and rituals” is certainly an instance of this, but a very coarse one that doesn't require stream-entry to be given up. _parāmāsa_ means “grasping” or “holding” in general, not “misapprehension”, as it’s sometimes glossed. ",
  "mn2:12.2": "Sense-restraint hinges entirely on _yoniso manasikāra_, and therefore even that basic practice (as well as all further ones below) can only be implemented rightly by a noble disciple, who has sufficiently understood through-the-origin attention. One cannot just blindly avoid perceiving things; one avoids things when one *knows* that they will give rise to the influxes of sensuality, being, and ignorance, as above. ",
  "mn2:12.3": "SN 35.94. ",
  "mn2:12.9": "See this comment explaining this rendering of [_mano_](https://suttas.hillsidehermitage.org/?q=mn27#mn27:15.7). ",
  "mn2:14.2": "[Moderation in Eating](https://www.youtube.com/watch?v=jruJr2dDcO8) ",
  "mn2:18.2": "Anybody can do this, but, again, it's when only when one understands through-the-origin attention that enduring discomfort would purify the mind. Bearing things without _yoniso manasikāra_ would at best make one more resilient, like a soldier, and at worst increase one's conceit. ",
  "mn2:20.2": "See [MN 19](https://suttas.hillsidehermitage.org/?q=mn%2019) and [MN 20](https://suttas.hillsidehermitage.org/?q=mn%2020) ",
  "mn2:21.2": "The seven awakening factors are present only in noble ones, just like the five faculties (SN 46.30, SN 48.12). Continuing the theme of the Sutta, _yoniso manasikāra_ also happens to be what is required for the awakening factors to be developed (AN 1.74). ",
  "mn2:21.3": " _dhammavicaya_: “Discernment” corresponds better etymologically to _vicaya_ (“picking apart”) than to _paññā_. "
}
