{
  "mn33:4.2": "The implication that a given instance of form is more than just the four great elements is there whenever there is passion with regard to it, irrespective of what theoretical views one has about what form is. See [MN 28](https://suttas.hillsidehermitage.org/?q=mn%2028) on how the most personally regarded form, the body, should be reflected on as not being any more special or sacred than the elements in the world, which are seen to break apart even though they're way less fragile than the body. This is not an idea to be merely “agreed” with, but a contemplation that must be developed until, as that Sutta says, the mind becomes equanimous and imperturbable based on that discernment. “At the Old Guard’s Cave”[https://youtu.be/L4lt6JlhOp4?si=Ck4_SnBKSD0RbKf5]. ",
  "mn33:5.2": "AN 3.3. This is less trivial than it would seem. Many people have an expectation that _paññā_ revolves around esoteric insights about “Ultimate Reality” or similar mystical concepts. But as the Buddha himself stated, the purpose of the practice is the fading away of passion (SN 45.41). Thus, regardless of how many groundbreaking meditative experiences and insights a person has accumulated, if their bodily, verbal, and mental actions remain polluted by passion and aversion, they still qualify as fool just as much. [“The Nature of Ignorance”](https://www.hillsidehermitage.org/the-nature-of-ignorance/). ",
  "mn33:6.2": "[“Good Thoughts, Bad Thoughts”](https://www.youtube.com/watch?v=VBiB0W7U6FQ) ",
  "mn33:7.2": "For a brief description of sense restraint, see [this comment](https://suttas.hillsidehermitage.org/?q=mn27#mn27:15.2). ",
  "mn33:10.2": "This, as well as the next 2 points, can be fulfilled only by someone with the Right View (i.e., a _sotāpanna_ or higher). It follows that the Right View—knowing [what it is](https://suttas.hillsidehermitage.org/?q=mn9) that needs to be developed to begin with—is indispensable for achieving any type of growth, improvement, or maturity in the Dhamma. See also [MN 16](https://suttas.hillsidehermitage.org/?q=mn16) on obstructions to progress in the Dhamma. "
}