{
  "mn35:4.5": "_saṅkhāras_ are, strictly speaking, neither the simplistic  “choices”, nor the abstruse “fabrications/volitional formations”. They are “movements” in the most general sense, but they need not always be fully deliberate. For instance, a _puthujjana's_ misconceiving of the aggregates as “mine” is a _saṅkhāra_ (SN 22.81), but because they're unable to recognize that attitude as a _saṅkhāra_—and thereby straight away as impermanent, in which case they would irreversibly cease to be a _puthujjana_—that “activity” continues to take place. It is therefore not possible to simply choose not to take things as self: that _saṅkhāra_ is neither a “choice” nor an “intention”. ",
  "mn35:15.5": "This doesn't mean that choice and will do not exist. It means that they are always *subordinate* to the aggregates. By taking medicine, one *might* successfully cure an illness and thereby modify one's form,  but the fact remains that it's always possible for all of one's attempts to fail. That is because form has the final say; one can at best, to use an analogy, submit proposals to it. ",
  "mn35:16.7": "One can seek all sorts of entertainment and distraction to alleviate an unpleasant feeling that has arisen (which is always mental and should not be confused with physical sensations), but it's always a gamble as to whether it will work. That is why people can, for example, remain depressed even though they are actively trying to get out of that state. ",
  "mn35:18.8": "We have the capacity to make certain choices only because the possibility of making them was given to us beforehand, whatever the reason may be. For instance, someone who is incapacitated cannot engage in the activity of moving their affected limbs; they at best engage in the activity of *thinking* about moving their limbs, and that is something different. ",
  "mn35:19.8": "Consciousness in the modern sciences is defined in various ways that are incompatible with the five-aggregate scheme, as they often end up mixing it up with the other four aggregates. In the Buddha's teaching, there is not one consciousness; each sense base has its own consciousness (MN 38). _viññāṇa_ is simply the fact that the other four aggregates and instances of them (or a sense experience with the six-sense scheme) are being experienced, with each distinct phenomenon possessing its own consciousness. So the statement that one does not wield power over consciousness means, in simple terms, that one cannot decide to be aware of things that one is not aware of, or to not be aware of things that one is already aware of. Even a choice to go and find out more about something would require being aware about that something in the first place, at least in imagination. ",
  "mn35:20.11": "It's important to see that _anattā_ is the result of seeing impermanence and not-self: things are *unfit* to be regarded as “mine” because of their inherently unreliable nature, and *not* because the things themselves somehow “do not ultimately exist” or “are never the same for two successive moments”, which is pure mysticism not found anywhere in the Suttas. One develops the insight of _anattā_ by understanding that appropriation is a _mistake_ that requires training and diligence to rectify, and not by taking on an intellectually pleasing belief that the self is “merely an illusion”. ",
  "mn35:20.17": "_anicca_ is not about our experience being in constant flux, in which case it would not follow automatically that whatever is _anicca_ is _dukkha_. There is no reason why perpetual novelty must be inherently unpleasant. One must start these contemplations not from a theoretical stance aiming to ascertain the metaphysical “true nature of reality”, but from a concrete and personal point of view of acknowledging one's attachments, emotional dependences, and appropriations. Seeing impermanence in that context automatically entails suffering, and that makes it impossible (when seen rightly) to keep taking things as “mine”. ",
  "mn35:25.2": "“Liberated through non-assumption” describes how an Arahant is freed from suffering not because they have somehow altered or “fixed” their experience—including their feelings—but because their mind is disenchanted with the aggregates regardless of how they manifest. See SN 35.228. "
}