{
  "mn38:5.13": "",
  "mn38:5.14": "Proclaiming a wrong view such as this, especially when it’s touted as being the Buddha’s teaching, is not as innocuous as it would seem if it’s taken as a merely theoretical point of doctrine. Such seemingly harmless misconceptions do have the potential to [entirely derail one’s practice ([AN 10.105](https://suttas.hillsidehermitage.org/?q=an10.105)). ",
  "mn38:8.15": "Sāti’s wrong view takes consciousness to be primordial, as if it's there first and things arise “within” it or “for” it (which is incidentally how it would tend to be conceived in modern thought, even among Buddhists). But consciousness is not a singular entity (nor is it “in the brain” and similar assumptions); _viññāṇa_ is one of the five aspects (five aggregates) inherent in _each phenomenon_. Also, note the simile: the burning of the fire is something that lasts for an indefinite duration of time (i.e., for as long as there is fuel). There is no such thing as an ever-changing stream of infinitesimal moments of consciousness. ",
  "mn38:9.1": "[“Do you see what is present?”](https://www.youtube.com/watch?v=lPk_dXveXSU&pp=ygUtaGlsbHNpZGUgaGVybWl0YWdlIGRvIHlvdSBzZWUgd2hhdCBpcyBwcmVzZW50). _bhūta_ here has to be understood in present tense (as in the case with _bhūtā_ (“beings”) _tuṇhibhūta_, _bhūtavādī …) and not as “[this has] come to be”. Only if a phenomenon is still present is it possible to see its foundation (“nutriment”) as explained below. This is one of the many reasons why the view that experience can be neatly divided into sequential “moments” or “units” is fundamentally fallacious, and actually impedes the understanding of _paṭiccasamuppāḍa_. See the simile in [SN 12.67](https://suttas.hillsidehermitage.org/?q=sn12.67) illustrating how the latter is not a “process” or “chain” of causes and effects, neither on moment-to-moment nor a life-to-life scale. ",
  "mn38:9.3": "[“The Meaning of Yoniso Manasikāra”](https://www.hillsidehermitage.org/wp-content/uploads/2023/06/The-Meaning-of-Yoniso-Manasikara-Bhikkhu-Anigha.pdf) ",
  "mn38:10.1": "",
  "mn38:11.1": "Doubt, the third fetter, is overcome not by finding the direct answer to every conceivable question (an impossible task), but by means of thoroughly seeing that the phenomenon of not-knowing is entirely within the present “this” that exists only based on its foundation that is impermanent, uncontrollable, and subject to vanishing. The questions are therefore neither answered nor dismissed—one simply becomes disenchanted with them from a “perpendicular” direction. ",
  "mn38:15.3": "On the four nutriments see [“Simile of the Son’s Flesh”](https://www.youtube.com/watch?v=cmYzJSvZ5jE). ",
  "mn38:16.6": "See comment on phassa [here](https://suttas.hillsidehermitage.org/?q=mn9#mn9:11.4). ",
  "mn38:17.11": "[“With birth, death applies”](https://www.hillsidehermitage.org/with-birth-death-applies/) ",
  "mn38:19.3": "",
  "mn38:24.3": "See [AN 10.93](https://suttas.hillsidehermitage.org/?q=an10.93). The discernment of _paṭiccasamuppāda_ outlined above neatly and effortlessly undercuts *all* possible permutations of views and standpoints. The experience of having a view (“this is”) is fully known beyond doubt as contingent on a foundation (nutriment) that cannot be owned or controlled. The Right View is the irreversible understanding and familiarity with that principle that [undermines all views](https://suttas.hillsidehermitage.org/?q=mn8#mn8:3.1-mn8:3.6); it’s not the adoption of the “Buddhist outlook” of the world, which in itself can very well become yet another speculative answer to “Did I exist in the past?”, “What am I?”, etc. ",
  "mn38:24.10": "Whatever views are expounded by another teacher, they would be known to be within “this” that is dependent upon nutriment, liable to abrupt cessation, and thus not adhered to. Consequently, whatever they proclaim, as grandiose or sublime as it may be, will be at best secondary to what the Buddha teaches, and at worst outright wrong. ",
  "mn38:25.3": "This statement (as well as [this one](https://suttas.hillsidehermitage.org/?q=mn28#mn28:28.5-mn28:28.6)) is demonstrates how absolutely central _paṭiccasamuppāda_ is, and yet it’s rarely given due importance. ",
  "mn38:26.2": "_gandhabba_ here can be confused with the “celestial musicians” (a class of heavenly beings), but from the Buddha’s question at the end of MN 93, it is clear that at least in this context it refers to the being about to take birth. Hence I’ve rendered it as “incoming being”. ",
  "mn38:27.4": "This description is to reinforce the point that our entire existence (“this”) is contingent on “nutriment” in the most general sense: necessary conditions that are nevertheless not in our control. ",
  "mn38:35.9": "This is what the right peace and calm originate from ([SN 35.94](https://suttas.hillsidehermitage.org/?q=sn35.94)). ",
  "mn38:36.1": "[Jhana is a Lifestyle](https://www.youtube.com/watch?v=HVw4gDCrfKQ&list=PLUPMn2PfEqIwds5dessK7trhRO6lYHYbP&index=7&pp=iAQB) ",
  "mn38:40.1": "Note that this is a *result* of the Gradual Training. One cannot “do” equanimity as a matter of choice. "
}