{
  "mn39:3.2": "[“Sense of Shame and Fear of Wrongdoing”](https://www.youtube.com/watch?v=JfwH9m_5psE) ",
  "mn39:11.2": "i.e., with awareness of the potential defiling states that could arise in the course of any action whatsoever, as opposed to awareness of the soles of the feet touching the floor or similar. The latter has nothing at all to do with being an ascetic. ",
  "mn39:13.2": "See [MN 19](https://suttas.hillsidehermitage.org/?q=mn19) and [“Unwelcoming of the Hindrances”](https://www.youtube.com/watch?v=igC9gzKZV6o). ",
  "mn39:13.6": "One “crosses over” doubt not by finding a satisfactory answer to every possible question, nor by forgetting about the uncertainties altogether, but by no longer resisting the displeasure of uncertainty, which is the driving force for the hindrance of doubt. The same principle applies to all other hindrances (SN 46.51). ",
  "mn39:14.30": "",
  "mn39:15.3": "The reflective, mental recognition of total safety and *separation* (_viveka_) from the previous burdens that has been developed—by *considering* them as a burden as said above—is where the joy (including bodily aspect described in this section) originates from, not the enthralment in a novel, quasi-accidental state that covers over and allows one to forget those burdens. It's the joy of,  having been [trapped in a shark tank with no way out](https://suttas.hillsidehermitage.org/?q=an9.42#an9.42:3.2-an9.42:4.5), being now able to freely gaze at the same sharks swimming about through the unbreakable glass window from the outside, at no conceivable risk. That is why whoever still delights in at least the idea of having a good time within the shark tank [will never acquire that joy](https://suttas.hillsidehermitage.org/?q=an6.73), let alone the ones that follow. ",
  "mn39:15.5": "[“Pervading the Body of Jhāna”](https://www.youtube.com/watch?v=6BMfJFWdt-E&pp=ygUbcGVydmFkaW5nIHRoZSBib2R5IG9mIGpoYW5h) ",
  "mn39:23.1": "Each definition in this section hinges on a play on words that is difficult to accurately carry over from the Pāḷi. "
}