{
  "mn44:0.2": "[Full Sutta Study - MN 44](https://www.youtube.com/watch?v=Fwjt5mIGLBQ) ",
  "mn44:3.5": "",
  "mn44:4.4": "“Personality” or ownership is not a matter of choice, and thus giving it up is not a matter of choice either. It’s inseparably bound up with craving, and craving must be present to some degree until ignorance has been fully abandoned. ",
  "mn44:6.3": "Hence _upādāna_ is not abandoned by replacing one state of the aggregates with another (fabricating \"good\" thoughts in place of \"bad\" thoughts). ",
  "mn44:7.8": "This “regarding” is not intentional. A view (_diṭṭhi_) differs from an opinion, belief, or deliberate attitude; while the latter can be willingly relinquished, the former cannot. ",
  "mn44:8.8": " See [MN 2](https://suttas.hillsidehermitage.org/?q=mn2) on how personality-view is abandoned. ",
  "mn44:13.3": "See [this note](https://suttas.hillsidehermitage.org/?q=mn43#mn43:25.3) in the previous Sutta on the difference between _cittasaṅkhāra_ and _manosaṅkhāra_. ",
  "mn44:15.3": "Contrary to popular belief, speech (_vācā_) is what ceases in the first jhāna, not “mental chatter”, and much less the five senses (SN 36.11). Thinking and pondering (_vitakkavicāra_) *is* “mental chatter”, not a cryptic “applied and sustained application of mind” or similar that exists only during intensive meditation (for which the Buddha could've coined a different expression than the one he used for the _vacīsaṅkhāra_ here). This is why it's the second jhāna that is called “noble silence”, not the first. ",
  "mn44:17.2": "i.e., the second jhāna comes before the fourth, and much later comes the cessation of perception-and-feeling. ",
  "mn44:24.4": "[No Joy, No Misery](https://www.youtube.com/watch?v=ow4u4hHQwL8) ",
  "mn44:25.2": "“Underlying tendencies” refers to attitudes which, although one is certainly responsible for them, linger unnoticed at the “background” of one’s experience in a subtle manner. That background plane is where the defilements are above all rooted. ",
  "mn44:28.4": "“Attachment to jhāna” is a contradiction in terms. Becoming a “jhāna junkie” is utterly impossible if it’s legitimately the separation from everything unwholesome—the very definition of the first jhāna. ",
  "mn44:28.7": "",
  "mn44:28.8": "One shouldn’t refrain from striving for attainments under the pretext that “it’s just another craving”. "
}