{
  "mn49:23.1": "These are the same permutations that occur in [MN 1](https://suttas.hillsidehermitage.org/?q=mn1). ",
  "mn49:25.1": "Some scholars believe that this line was not in fact spoken by the Buddha but by Brahmā, and that it refers to a meditative attainment that falls short of Nibbāna. But this is clearly not in keeping with the context, since Brahmā would be claiming to have understood something that lies beyond his range, while right in the preceding statement and before that too, he stubbornly expressed disbelief in such a possibility. \\n\\n The non-indicative consciousness referred to here is not a mystical, altered state that is accessed through meditation, but a structural principle inherent to the five aggregates that needs to be [_discerned and understood_](https://suttas.hillsidehermitage.org/?q=an1.51-60). It is not a separate dimension where the things listed here disappear altogether (which is impossible; there can be nothing that's outside of “the All” or the five aggregates). It's simply that when all traces of passion have been given up, the mind no longer “partakes” in things even as they manifest in full force (AN 6.55). The simile the Buddha employed on different occasions was that of a lotus that remains unsullied by the water that surrounds it (AN 4.36, AN 10.81). SN 12.64 compares it to a ray of light finding nowhere to land on (the point being that [the ray itself is still there](https://www.youtube.com/watch?v=-039SYi2a94)). In reference to the same principle, [AN 9.42](https://suttas.hillsidehermitage.org/?q=an9.42) uses the analogy of an opening _amidst_ confinement. This surmounting of phenomena while they endure is the purpose of the [four _satipaṭṭhānas_](https://suttas.hillsidehermitage.org/?q=mn10). ",
  "mn49:27.2": "Seeking non-being is a form of being: trying to deny or replace the arisen state of the aggregates is in the end a less overt way of delighting in them. ",
  "mn49:27.4": "[“Not Wanting the Wanting of Sensuality”](https://www.youtube.com/watch?v=_ttVxzlzlj0) "
}