{
  "mn62:3.2": "The true difficulty lies in concretely recognizing the full scope of the aggregates, not in the contemplation of _anattā_. This is why members of others sects who had already developed a high degree of _sīla_ and _samādhi_—un-absorption of the mind that uncovers the extent of one’s whole experience previously obscured by desire and passion—were able to gain the Right View and beyond quite easily. ",
  "mn62:13.2": "[Be Like Earth](https://www.youtube.com/watch?v=LCD8jQfg3Ao) ",
  "mn62:13.5": "Note the qualifier: _arisen_ pressures/contactsdo not endure with a grip on the mind, as opposed to them not arising in the first place as a result of management or suppression. See [Uprooting VS Management of Dukkha](https://www.youtube.com/watch?v=zndwMKAszWM) and [Becoming Imperturbable](https://www.youtube.com/watch?v=-039SYi2a94). ",
  "mn62:18.1": "[Pervading the World with Friendliness](https://www.hillsidehermitage.org/pervading-the-world-with-friendliness/). ",
  "mn62:24.2": "Note that even though Rāhula’s question was only about _ānāpānasati_ the Buddha proceeded to encourage all the above practices first, particularly the one involving being unmoved by pleasure and displeasure. This is not accidental:  contrary to mainstream views, _ānāpānasati_ is a very advanced practice—mentioned only a handful of times in the whole Suttapiṭaka—and it cannot be done properly if one’s underlying motivation for it is seeking pleasant contacts and avoiding unpleasant ones, as above. There are also no accounts in the Suttas of this practice ever being taught to laypeople. ",
  "mn62:25.2": "[Mindfulness of Breathing Playlist](https://www.youtube.com/watch?v=GrgV9KI5LeI&list=PLUPMn2PfEqIwuLnCiCoXvgcD89ZQj9TKi) ",
  "mn62:27.2": "These are the joy and ease of having abandoned the five hindrances through understanding and dispassion ([especially towards sensuality](https://suttas.hillsidehermitage.org/?q=an9.41#an9.41:7.1-an9.41:7.15)), not of circumstantially [pleasant bodily sensations and “energies”](https://www.youtube.com/watch?v=KPPShvqsdVQ). A good rule of thumb is that if a certain pleasure is only accessible to one with _anāpānasati_ and they don’t understand how to purify the mind from the five hindrances through [the practice that’s expounded all over the Suttas for that purpose](https://suttas.hillsidehermitage.org/?q=dn2#dn2:68.1-dn2:74.2), it’s not the right type of pleasure. ",
  "mn62:27.3": "_cittasaṅkhāra_: this is [perception and feeling](https://suttas.hillsidehermitage.org/?q=mn44#mn44:14.2). ",
  "mn62:29.1": "[Breathing Towards Death](https://www.hillsidehermitage.org/breathing-towards-death/) "
}