{
  "mn64:3.4": "This line is often rendered as “lies within him” or “lies latent within him”, but it’s clear from other instances that _anuseti_ refers to something that’s _present_ beneath the plane of conspicuous volition, not to something that’s for now absent but will begin to manifest later. In other words, whether it’s a baby or someone who claims to have “let go of all concepts” and fully abide in the present moment, personality-view (and all the others below) is _still occurring_ just not on as blatantly as for someone who also engages in crude actions and thoughts rooted in conceit and a sense of self. Absence of symptoms does not mean absence of the underlying illness. ",
  "mn64:5.3": "This ongoing lack of understanding is the reason why the underlying tendency would be perpetually present, regardless of whether it’s symptoms are visible or not. [Liberation can only come from full understanding](https://suttas.hillsidehermitage.org/?q=mn2#mn2:3.1) of the root illness and the escape from it, whereas the absence of its symptoms can come about by accident or skillful suppression. ",
  "mn64:6.3": "See [AN 3.121](https://suttas.hillsidehermitage.org/?q=an3.121): having truly understood the escape from an arisen defilement makes it not a defilement anymore. This doesn’t mean one needs to keep “giving it up” each time it arises. It simply wouldn’t ever again arise _as defilement_ to begin with, and no action or response is required. ",
  "mn64:9.2": "There is sometimes a belief that one can be “attached” or “addicted” to jhāna. But the very first jhāna is reached precisely by putting aside all such attitudes. If there is attachment or addiction, one is not in fact disjoined from sensuality and detrimental phenomena even temporarily. As stated in [MN 44](https://suttas.hillsidehermitage.org/?q=mn44#mn44:28.3-mn44:28.4), the underlying tendency to passion for pleasant feeling does not underlie the first jhāna already, let alone the next ones. ",
  "mn64:9.3": "In the same vein, it’s not that this supposed to counteract a sense of “attachment” to the jhāna that would otherwise be there. It’s that simply not seeing those phenomena in this way, lofty as they are, entails a degree of ignorance. "
}