{
  
  
  
  "mn7:5.33": " Having accomplished this means already being a noble one. As stated in [MN 2](https://suttas.hillsidehermitage.org/?q=mn%202) and[MN 9](https://suttas.hillsidehermitage.org/?q=mn%209), only one with Right View knows defilements and the way to abandon them. ",
  
  
  
  "mn7:11.2": "  This is all it should take for _samādhi_ to arise according to the Suttas (AN 10.2). The contemporary methodical meditation practices are never mentioned. [“How Virtue Leads to Effortless Samadhi”](https://www.youtube.com/watch?v=uoOIYwY39eE) ",
  
  "mn7:13.1": " _mettā_ comes from √mitt which just means “be friendly”, and mittā is “friend”. “Love” as in “loving-kindness” would correspond to _pema_—a defilement, a form of delight in pleasant feeling that is in direct conflict with liberation from suffering, and the _brahmavihāras_ are one of the many approaches the Buddha gave for the abandonment of “love”. That is why the highest and most refined of them all is equanimity/indifference. See the essay [“Pervading The World With Friendliness”](https://www.hillsidehermitage.org/pervading-the-world-with-friendliness/) ",
  "mn7:14.1": "_pharitvā viharati_ is normally rendered as “he lives pervading…” or “keeps pervading…”, with the idea that it’s about selecting specific individuals or groups of people one by one and “spreading” kindness to them. The Pāli, however, says “he dwells having pervaded…”, which is quite different (the absolutive does not actually ever denote true simultaneity). It’s not a “process” or sequential method revolving around specific beings, but a general attitude of non-ill-will that is established all at once, and that one must then dwell protecting and maintaining, “like a mother would protect her only child with her life” (Snp 1.8). For that, one needs to understand what that general, all-encompassing attitude is, not just mechanically try to arouse pleasant feelings towards individuals—a practice which will be underlain by a general attitude of craving. It will not truly be a _brahmavihāra_, no matter how nice it feels. ",
  "mn7:15.1": "_Muditā_ is not “sympathetic/altruistic joy”. "
  
  
  
  
  
  
  
  
  
  
  
  
}