{
  "mn9:3.1": "This is why it's stated in [AN 2.11](https://suttas.hillsidehermitage.org/?q=an2.11-20) that only a noble disciple is able to abandon what is _akusala_. It cannot be abandoned by accident, without full understanding of *why* the things in question are _akusala_. ",
  "mn9:8.1": " _diṭṭh(ev)a dhamme_, lit. “within the seen phenomenon/thing”, an expression that occurs a few hundred times in the early texts, has often been translated as “in this very life”, “in the present life”, “here and now”, etc., but there are several instances where this would be quite meaningless. ",
  "mn9:11.2": " [“Simile of the Son's Flesh”](https://www.youtube.com/watch?v=cmYzJSvZ5jE) ",
  "mn9:11.4": " _phassa_ “pressure”: The standard “contact” is technically not inaccurate, but there is a tendency to think of it in an abstract way that leaves out one’s personal point of view, as if one can imagine _phassa_ (“touch”, more literally) without already “being touched” (affected by the arisen experience). Whenever there is _phassa_, there is necessarily feeling (_vedanā_), meaning that there is no such thing as “raw experience” which then somehow evolves into engagement and craving. Feeling and craving are *already there* whenever there is _phassa_ (see SN 12.67 on how paṭiccasamuppāda is not a temporal “process” but a simultaneous interdependence of two phenomena). ",
  "mn9:15.2": " _pañcupādānakkhanda_. See note below on upādāna as “assumption”. ",
  "mn9:26.4": "[“With Birth, Death Applies”](https://www.hillsidehermitage.org/with-birth-death-applies/) ",
  "mn9:30.2": " “Becoming” gives the wrong impression that _bhava_ is a matter of choice. But a decision to “not become anything” remains fully enclosed within the much subtler scope of _bhava_, especially if one is not a noble disciple. As said below, the cessation of _bhava_ comes about only through the Noble Eightfold Path. ",
  "mn9:34.1": "Assume: late Middle English: from Latin assumere, from ad- ‘towards’ + sumere ‘take’. _upādāna_: _upa_-‘towards’ + _ādānā_-‘taking’. Just as with “becoming” and _bhava_ noted above, “clinging” or “grasping” make it sound like _upādāna_ is a matter of choice. But _upādāna_ is there to the exact same extent that craving is there, even if one deliberately refrains from “clinging” to anything. Moreover, an assumption is something that cannot return once it’s abandoned, whereas clinging can come and go an indefinite amount of times. ",
  "mn9:38.4": "Craving is an automatic, inevitable result of feeling because the entire _paṭiccasamuppāda_ structure originates from ignorance. There is no possibility, even for a split-second, for there to be feeling but no craving for as long as there is _avijjā_, and same for every other pair of factors listed in the series. ",
  "mn9:46.4": "cf. SN 22.47, SN 35.232, and Udāna 2.4 “Pressures pressure one due to appropriation (_upadhi_)”. The sense fields (as well as everything else following _avijjā_ in dependent origination) no longer exist in an Arahant. They still perceive sights, sounds, etc., and still have five aggregates, but they cannot be said to possess the “same” sense fields or aggregates as an ordinary person minus a certain property, since ignorance distorts things in their totality. In other words, ignorance is not something *within* the sense fields; it's what makes the sense fields be how they are to begin with, such that whatever they encounter affects or pressures one, and as that pressure is felt, that feeling is craved for or against, etc. That is why _paṭiccasamuppāda_ has a certain order, even though it's not a temporal sequence and all factors are simultaneously present. ",
  "mn9:58.4": "“Activities” renders _saṅkhāra_, which literally means “(a) doing”. The customary “(volitional) formations”, “fabrications”, etc., can be  mystical/abstruse, while “intentions” is an oversimplification, and corresponds actually to _cetanā_, a specific type of _saṅkhāra_. <br><br>Regarding _saṅkhārā_ as fundamentally volitional is misleading, since the reason for their presence is not mere will, but ignorance (“With ignorance as basis, activities [exist]...“). Conversely, their cessation isn't reached by intentionally refraining from choice, but by fully dispelling ignorance (“With the remainderless fading away and cessation of ignorance, activities cease...”). ",
  "mn9:71.1": "[AN 1.51-52](https://suttas.hillsidehermitage.org/?q=an1.51-60). "
}
