{
  "sn56.30:0.3": "This short discourse has profound implications:<br><br>(1) It highlights how it’s not correct to think that one has access to the right way of practice (the noble eightfold path) from the beginning, and that by following it one understands the other truths and becomes a stream-enterer. Only a *sotāpanna* or higher can be said to rightly understand the practice, and the Buddha [defines the “stream” that one enters into as precisely the noble eightfold path](https://suttas.hillsidehermitage.org/?q=sn55.5#sn55.5:2.5-sn55.5:2.7). This ties in with the fact that [only at that point has one sufficiently discerned the roots of the wholesome and the unwholesome](https://suttas.hillsidehermitage.org/?q=mn9#mn9:3.1-mn9:3.2), and it’s only on the basis of that comprehension that the path can be followed. Adhering to a prescribed definition of the path and its factors can only circumstantially clear away specific types of unwholesome behaviors, while [their root](https://www.hillsidehermitage.org/the-cues-of-the-mind/) remains unclear. Hence, without right view, there is no truly right intention, right speech, right action, etc., but only a superficial emulation of them.<br><br> (2) Similarly, not only here but always, the third noble truth comes before instead of after the fourth. This underlines how the eightfold path is made right and noble because one has *already* understood the cessation of craving—which is not a one-off extraordinary experience but a perpetually accessible knowledge—and one is thus able to strive for their intentions, speech, actions, livelihood, etc., to be devoid of craving, and that is what makes those factors *right*.<br><br>(3) We must not assume that we all understand what suffering is from the start, since that would entail knowing what the escape is too.<br><br>(4) Whenever it seems like various divergent practices and approaches are equally viable in leading to the cessation of suffering, it is because one’s conception of what suffering and craving are is excessively vague. Just as with a mundane problem or ailment, the less clearly one understands it, the more options will appear to be viable solutions. But one who understands the problem fully will know that there is only one way to solve it. This is why a noble disciple [does not waver at all](https://suttas.hillsidehermitage.org/?q=sn56.40) in their view of the practice; they are not stubborn or close-minded out of hubris.<br><br>(5) Two differing practices inherently entail two differing ideas of what the problem and its resolution are, because any treatment is born out of what the illness is, even implicitly, thought to be. The various topics of right mindfulness taught in the Suttas—the brahmavihāras, the four *satipaṭṭhānas*, etc.—are not different practices as such, but avenues through which the very same treatment can be applied. That is to say, they must all be underpinned by [the same understanding of the Four Noble Truths](https://suttas.hillsidehermitage.org/?q=mn28#mn28:2.1-mn28:2.4). For instance, if it is to be a part of the path, one cannot engage in [_mettā_](https://www.hillsidehermitage.org/pervading-the-world-with-friendliness/) with a view that confuses unpleasant feelings with suffering—a view that is there whenever the fabrication of pleasantness is conceived as a solution. Instead, it must be a practice of giving up craving *against* disagreeability that has arisen on its own, since that is what ill will actually is. "
}